<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!--
   Copyright (c) 2018, Oracle and/or its affiliates. All rights reserved.
   Licensed under the Universal Permissive License v 1.0 as shown at http://oss.oracle.com/licenses/upl.
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ja" lang="ja">
<head><meta http-equiv="Content-Type" content="text/html; charset=us-ascii" />
<meta name="DC.Type" content="task" />
<meta name="DC.Title" content="&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12398;&#20351;&#29992;" />
<meta name="abstract" content="&#28784;&#33394;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#12523;&#12540;&#12523;&#12399;&#12289;&#12514;&#12491;&#12479;&#12540;&#12373;&#12428;&#12390;&#12356;&#12427;JVM&#12391;&#12399;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12523;&#12540;&#12523;&#12364;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12523;&#12540;&#12523;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12377;&#12427;&#12395;&#12399;&#12289;&#27178;&#12398;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;" />
<meta name="description" content="&#28784;&#33394;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#12523;&#12540;&#12523;&#12399;&#12289;&#12514;&#12491;&#12479;&#12540;&#12373;&#12428;&#12390;&#12356;&#12427;JVM&#12391;&#12399;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12523;&#12540;&#12523;&#12364;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12523;&#12540;&#12523;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12377;&#12427;&#12395;&#12399;&#12289;&#27178;&#12398;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;" />
<meta name="DC.Format" content="XHTML" />
<meta name="DC.Identifier" content="GUID-18677545-5152-4688-8C51-4A1151361BB9" />
<meta name="DC.Language" content="ja" />

<meta http-equiv="Content-Style-Type" content="text/css" />
<meta http-equiv="Content-Script-Type" content="text/javascript" />
<title>&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12398;&#20351;&#29992;</title>

<meta name="doctitle" content="&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12398;&#20351;&#29992;&#xA;" />
<meta name="robots" content="noarchive" />
<link rel="copyright" href="http://oss.oracle.com/licenses/upl" title="&#33879;&#20316;&#27177;" type="text/html" />

<link rel="contents" href="toc.htm" title="&#30446;&#27425;" type="text/html" />
<link rel="prev" href="GUID-DAB13FDA-9430-4457-BFF3-04F9DC0E3977.htm" title="&#21069;" type="text/html" />
<link rel="next" href="GUID-D475ABB1-DE41-4A24-8BB8-A058FDDC6645.htm" title="&#27425;" type="text/html" />
</head>
<body>
<div class="zz-skip-header"><a href="#BEGIN">&#12503;&#12521;&#12452;&#12510;&#12522;&#12539;&#12467;&#12531;&#12486;&#12531;&#12484;&#12408;&#31227;&#21205;</a></div>
<table class="simple oac_no_warn" summary="" cellspacing="0" cellpadding="0" width="100%">
<col width="86%" /><col width="*" /><tr valign="bottom">
<td></td>


<td align="center">
<a href="GUID-DAB13FDA-9430-4457-BFF3-04F9DC0E3977.htm">
<img src="./dcommon/gifs/leftnav.gif" alt="&#21069;" /><br />
<span class="icon">&#21069;</span>
</a>
</td>
<td align="center">
<a href="GUID-D475ABB1-DE41-4A24-8BB8-A058FDDC6645.htm">
<img src="./dcommon/gifs/rightnav.gif" alt="&#27425;" /><br />
<span class="icon">&#27425;</span>
</a>
</td>
<td> </td>


</tr>
</table><div class="ind"><a id="GUID-18677545-5152-4688-8C51-4A1151361BB9" name="GUID-18677545-5152-4688-8C51-4A1151361BB9"></a><!-- End Header -->
<h1 id="JMCOH-GUID-18677545-5152-4688-8C51-4A1151361BB9" class="sect1">&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12398;&#20351;&#29992;</h1>
<div><p>&#28784;&#33394;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#12523;&#12540;&#12523;&#12399;&#12289;&#12514;&#12491;&#12479;&#12540;&#12373;&#12428;&#12390;&#12356;&#12427;JVM&#12391;&#12399;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12523;&#12540;&#12523;&#12364;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12523;&#12540;&#12523;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12377;&#12427;&#12395;&#12399;&#12289;&#27178;&#12398;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<div class="section">
         <p>&#26032;&#12375;&#12356;&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12434;&#36861;&#21152;&#12377;&#12427;&#25163;&#38918;:</p>

      </div>
<!-- class="section" -->
<ol><li class="stepexpand"><span><span class="bold">&#12300;&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12301;</span>&#12497;&#12493;&#12523;&#12391;&#12289;<span class="bold">&#12300;&#36861;&#21152;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</span></li>
<li class="stepexpand"><span><span class="bold">&#26032;&#12375;&#12356;&#12523;&#12540;&#12523;&#12398;&#36861;&#21152;</span>&#12454;&#12451;&#12470;&#12540;&#12489;&#12398;&#26368;&#21021;&#12398;&#12473;&#12486;&#12483;&#12503;&#12391;&#12289;&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12398;&#23646;&#24615;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;<span class="bold">&#12300;&#27425;&#12408;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</span></li>
<li class="stepexpand"><span>&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12398;&#26465;&#20214;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12473;&#12486;&#12483;&#12503;&#12395;&#12399;&#12289;&#27425;&#12398;&#35373;&#23450;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</span><div>
               <ul style="list-style-type: disc;"><li>
                     <p><span class="bold">&#12300;&#26368;&#22823;&#12488;&#12522;&#12460;&#12540;&#20516;&#12301;</span>(&#25968;&#20516;&#23646;&#24615;)&#12414;&#12383;&#12399;<span class="bold">&#12300;&#19968;&#33268;&#25991;&#23383;&#21015;&#12301;</span>(&#25968;&#20516;&#20197;&#22806;&#12398;&#23646;&#24615;): &#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12391;&#36984;&#25246;&#12375;&#12383;&#23646;&#24615;&#12398;&#26368;&#22823;&#20516;&#12414;&#12383;&#12399;&#19968;&#33268;&#25991;&#23383;&#21015;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#25345;&#32154;&#26178;&#38291;:</span> &#12523;&#12540;&#12523;&#12364;&#12488;&#12522;&#12460;&#12540;&#12373;&#12428;&#12427;&#12414;&#12391;&#12289;&#26465;&#20214;&#12434;true&#12395;&#12375;&#12390;&#12362;&#12367;&#24517;&#35201;&#12364;&#12354;&#12427;&#26178;&#38291;(&#31186;)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#21046;&#38480;&#26399;&#38291;:</span> &#24460;&#12391;&#12523;&#12540;&#12523;&#12364;&#12488;&#12522;&#12460;&#12540;&#21487;&#33021;&#12395;&#12394;&#12427;&#12414;&#12391;&#12398;&#26368;&#23567;&#26178;&#38291;(&#31186;)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#26465;&#20214;&#12395;&#21512;&#33268;&#12375;&#12383;&#12392;&#12365;&#12395;&#12488;&#12522;&#12460;&#12540;&#12375;&#12414;&#12377;&#12290;:</span> &#26465;&#20214;&#12434;&#28288;&#12383;&#12375;&#12383;&#22580;&#21512;&#12395;&#12523;&#12540;&#12523;&#12434;&#12488;&#12522;&#12460;&#12540;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12488;&#12522;&#12460;&#12540;&#20516;&#12364;100&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#20516;&#12364;100&#26410;&#28288;&#12363;&#12425;100&#20197;&#19978;&#12395;&#22793;&#26356;&#12373;&#12428;&#12427;&#12392;&#12289;&#12523;&#12540;&#12523;&#12364;&#12488;&#12522;&#12460;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#26465;&#20214;&#12363;&#12425;&#24489;&#24112;&#12375;&#12383;&#12392;&#12365;&#12395;&#12488;&#12522;&#12460;&#12540;&#12375;&#12414;&#12377;:</span> &#26465;&#20214;&#12434;&#28288;&#12383;&#12373;&#12394;&#12367;&#12394;&#12387;&#12383;&#22580;&#21512;&#12395;&#12523;&#12540;&#12523;&#12434;&#12488;&#12522;&#12460;&#12540;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12488;&#12522;&#12460;&#12540;&#20516;&#12364;100&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#20516;&#12364;100&#20197;&#19978;&#12363;&#12425;100&#26410;&#28288;&#12395;&#22793;&#26356;&#12373;&#12428;&#12427;&#12392;&#12289;&#12523;&#12540;&#12523;&#12364;&#12488;&#12522;&#12460;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

                  </li>
</ul>

               <p><span class="bold">&#12300;&#27425;&#12408;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

            </div></li>
<li class="stepexpand"><span>&#12523;&#12540;&#12523;&#12364;&#12488;&#12522;&#12460;&#12540;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#23455;&#34892;&#12377;&#12427;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12450;&#12463;&#12471;&#12519;&#12531;&#12395;&#24540;&#12376;&#12390;&#12289;&#36861;&#21152;&#12487;&#12540;&#12479;&#12398;&#25351;&#23450;&#12364;&#24517;&#35201;&#12395;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#27425;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</span><div>
               <ul style="list-style-type: disc;"><li>
                     <p><span class="bold">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12450;&#12521;&#12540;&#12488;</span>: JDK Mission Control&#12395;&#12450;&#12521;&#12540;&#12488;&#12539;&#12480;&#12452;&#12450;&#12525;&#12464;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#12467;&#12531;&#12477;&#12540;&#12523;&#20986;&#21147;</span>: JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12364;&#36215;&#21205;&#12373;&#12428;&#12383;&#12467;&#12531;&#12477;&#12540;&#12523;(&#12467;&#12510;&#12531;&#12489;&#12539;&#12503;&#12525;&#12531;&#12503;&#12488;)&#12398;&#27161;&#28310;&#20986;&#21147;(stdout)&#12395;&#36890;&#30693;&#12434;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#12501;&#12521;&#12452;&#12488;&#35352;&#37682;&#12398;&#12480;&#12531;&#12503;</span>: JFR&#12501;&#12449;&#12452;&#12523;&#12395;&#26368;&#24460;&#12395;&#25351;&#23450;&#12375;&#12383;&#26178;&#38291;(&#31186;)&#12398;&#12501;&#12521;&#12452;&#12488;&#35352;&#37682;&#12395;&#12487;&#12540;&#12479;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12487;&#12540;&#12479;&#12434;&#12480;&#12531;&#12503;&#12375;&#12414;&#12377;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">HPROF&#12480;&#12531;&#12503;</span>: &#25351;&#23450;&#12375;&#12383;HPROF&#12501;&#12449;&#12452;&#12523;&#12395;&#12513;&#12514;&#12522;&#12540;&#12539;&#12480;&#12531;&#12503;&#12434;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#35386;&#26029;&#12467;&#12510;&#12531;&#12489;&#12398;&#36215;&#21205;</span>: &#25351;&#23450;&#12375;&#12383;&#35386;&#26029;&#12467;&#12510;&#12531;&#12489;&#12434;&#36215;&#21205;&#12375;&#12289;&#32080;&#26524;&#12434;&#36861;&#21152;&#12414;&#12383;&#12399;&#19978;&#26360;&#12365;&#12375;&#12390;&#12289;&#25351;&#23450;&#12375;&#12383;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12395;&#20986;&#21147;&#12434;&#35352;&#37682;&#12375;&#12414;&#12377;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#12501;&#12449;&#12452;&#12523;&#12395;&#12525;&#12462;&#12531;&#12464;</span>: &#25351;&#23450;&#12375;&#12383;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12395;&#36890;&#30693;&#12434;&#26360;&#12365;&#36796;&#12415;&#12414;&#12377;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#38651;&#23376;&#12513;&#12540;&#12523;&#12398;&#36865;&#20449;</span>: &#36890;&#30693;&#12434;&#38651;&#23376;&#12513;&#12540;&#12523;&#12391;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;SMTP&#12469;&#12540;&#12496;&#12540;&#12398;&#12450;&#12489;&#12524;&#12473;&#12392;&#12509;&#12540;&#12488;&#12289;&#38651;&#23376;&#12513;&#12540;&#12523;&#12398;&#21463;&#20449;&#32773;&#12392;&#36865;&#20449;&#32773;&#12434;&#27083;&#25104;&#12375;&#12289;&#12475;&#12461;&#12517;&#12450;&#12394;&#25509;&#32154;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12399;&#12289;SSL&#36039;&#26684;&#35388;&#26126;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#36899;&#32154;&#12501;&#12521;&#12452;&#12488;&#35352;&#37682;&#12398;&#38283;&#22987;</span>: &#36899;&#32154;&#12375;&#12383;&#12501;&#12521;&#12452;&#12488;&#35352;&#37682;&#12434;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#26399;&#38480;&#20184;&#12365;&#12501;&#12521;&#12452;&#12488;&#35352;&#37682;&#12398;&#38283;&#22987;</span>: &#25351;&#23450;&#12375;&#12383;&#26178;&#38291;&#24460;(&#31186;)&#12395;&#12289;&#32080;&#26524;&#12434;JFR&#12501;&#12449;&#12452;&#12523;&#12395;&#12480;&#12531;&#12503;&#12377;&#12427;&#12501;&#12521;&#12452;&#12488;&#35352;&#37682;&#12434;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;</p>

                  </li>
</ul>

               <p><span class="bold">&#12300;&#27425;&#12408;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#32154;&#34892;&#12377;&#12427;&#12363;&#12289;<span class="bold">&#12300;&#32066;&#20102;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#12523;&#12540;&#12523;&#12434;&#12381;&#12398;&#12414;&#12414;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</p>

            </div></li>
<li class="stepexpand"><span>(&#12458;&#12503;&#12471;&#12519;&#12531;)&#25351;&#23450;&#12375;&#12383;&#26085;&#20184;&#12289;&#26332;&#26085;&#12289;&#26178;&#38291;&#12398;&#12415;&#12391;&#12523;&#12540;&#12523;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#26178;&#38291;&#21046;&#32004;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;<span class="bold">&#12300;&#27425;&#12408;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</span></li>
<li class="stepexpand"><span>(&#12458;&#12503;&#12471;&#12519;&#12531;)&#12523;&#12540;&#12523;&#12364;&#23646;&#12377;&#12427;&#12464;&#12523;&#12540;&#12503;&#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;&#26032;&#12375;&#12356;&#12464;&#12523;&#12540;&#12503;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12523;&#12540;&#12523;&#12398;&#21517;&#21069;&#12362;&#12424;&#12403;&#35443;&#32048;&#12394;&#35500;&#26126;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</span><div>
               <p>&#12454;&#12451;&#12470;&#12540;&#12489;&#12398;&#21069;&#12398;&#12473;&#12486;&#12483;&#12503;&#12395;&#25147;&#12426;&#12289;&#35373;&#23450;&#12434;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;<span class="bold">&#12300;&#32066;&#20102;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#12523;&#12540;&#12523;&#12434;&#12522;&#12473;&#12488;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</p>

            </div></li>
</ol>
<div class="section">
         <p>&#12523;&#12540;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;&#12289;<span class="bold">&#12300;&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12301;</span>&#12497;&#12493;&#12523;&#12391;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#21491;&#20596;&#12398;<span class="bold">&#12300;&#12523;&#12540;&#12523;&#12398;&#35443;&#32048;&#12301;</span>&#12497;&#12493;&#12523;&#12395;&#12399;&#12289;3&#12388;&#12398;&#12469;&#12502;&#12479;&#12502;&#12364;&#34920;&#31034;&#12373;&#12428;&#12289;&#21508;&#12469;&#12502;&#12479;&#12502;&#12395;&#12399;&#12289;&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12398;&#23646;&#24615;&#12362;&#12424;&#12403;&#20516;&#12289;&#12523;&#12540;&#12523;&#12395;&#12424;&#12387;&#12390;&#12488;&#12522;&#12460;&#12540;&#12373;&#12428;&#12427;&#12450;&#12463;&#12471;&#12519;&#12531;&#12289;&#12362;&#12424;&#12403;&#12523;&#12540;&#12523;&#12434;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12377;&#12427;&#22580;&#21512;&#12398;&#26178;&#38291;&#21046;&#32004;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

         <p>&#12523;&#12540;&#12523;&#12398;&#21517;&#21069;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;<span class="bold">&#12300;&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12301;</span>&#12497;&#12493;&#12523;&#12391;&#12523;&#12540;&#12523;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;<span class="bold">&#12300;&#21517;&#21069;&#12398;&#22793;&#26356;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;&#12523;&#12540;&#12523;&#12398;&#26032;&#12375;&#12356;&#21517;&#21069;&#12434;&#25351;&#23450;&#12375;&#12289;<span class="bold">&#12300;OK&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

         <p>&#12523;&#12540;&#12523;&#12434;&#12488;&#12522;&#12460;&#12540;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;<span class="bold">&#12300;&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12301;</span>&#12497;&#12493;&#12523;&#12391;&#12289;&#12523;&#12540;&#12523;&#12398;&#27178;&#12398;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12398;&#36984;&#25246;&#12434;&#35299;&#38500;&#12377;&#12427;&#12371;&#12392;&#12391;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#12523;&#12540;&#12523;&#12434;&#20877;&#24230;&#20351;&#29992;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12523;&#12540;&#12523;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;<span class="bold">&#12300;&#21066;&#38500;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12522;&#12473;&#12488;&#12363;&#12425;&#23436;&#20840;&#12395;&#21066;&#38500;&#12391;&#12365;&#12414;&#12377;&#12290;</p>

         <p>&#12523;&#12540;&#12523;&#12398;&#12475;&#12483;&#12488;&#12434;XML&#12501;&#12449;&#12452;&#12523;&#12395;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12377;&#12427;&#12395;&#12399;&#12289;<span class="bold">&#12300;&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12301;</span>&#12497;&#12493;&#12523;&#12398;<span class="bold">&#12300;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;&#12377;&#12427;&#12523;&#12540;&#12523;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12501;&#12449;&#12452;&#12523;&#21517;&#12434;&#25351;&#23450;&#12375;&#12289;<span class="bold">&#12300;OK&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#12523;&#12540;&#12523;&#12398;&#12475;&#12483;&#12488;&#12434;XML&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12452;&#12531;&#12509;&#12540;&#12488;&#12377;&#12427;&#12395;&#12399;&#12289;<span class="bold">&#12300;&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12301;</span>&#12497;&#12493;&#12523;&#12398;<span class="bold">&#12300;&#12452;&#12531;&#12509;&#12540;&#12488;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;<span class="bold">&#12300;OK&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

         <p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12523;&#12540;&#12523;&#12398;&#12475;&#12483;&#12488;&#12395;&#12522;&#12475;&#12483;&#12488;&#12377;&#12427;&#12395;&#12399;&#12289;<span class="bold">&#12300;&#12488;&#12522;&#12460;&#12540;&#12539;&#12523;&#12540;&#12523;&#12301;</span>&#12497;&#12493;&#12523;&#12398;<span class="bold">&#12300;&#12522;&#12475;&#12483;&#12488;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#12377;&#12409;&#12390;&#12398;&#12523;&#12540;&#12523;&#12364;&#19978;&#26360;&#12365;&#12373;&#12428;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12475;&#12483;&#12488;&#12391;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;</p>

      </div>
<!-- class="section" -->
</div>
</div><!-- class="ind" --><!-- Start Footer -->
<table class="simple oac_no_warn" summary="" cellspacing="0" cellpadding="0" width="100%">
<col width="86%" /><col width="*" /><tr valign="bottom">
<td><a href="http://oss.oracle.com/licenses/upl"><br />
<span class="copyrightlogo">Copyright&#160;&#169;&#160;2018, Oracle&#160;and/or&#160;its&#160;affiliates &#160;All&#160;rights&#160;reserved.</span></a></td>


<td align="center">
<a href="GUID-DAB13FDA-9430-4457-BFF3-04F9DC0E3977.htm">
<img src="./dcommon/gifs/leftnav.gif" alt="&#21069;" /><br />
<span class="icon">&#21069;</span>
</a>
</td>
<td align="center">
<a href="GUID-D475ABB1-DE41-4A24-8BB8-A058FDDC6645.htm">
<img src="./dcommon/gifs/rightnav.gif" alt="&#27425;" /><br />
<span class="icon">&#27425;</span>
</a>
</td>
<td> </td>


</tr>
</table>

<!-- class="footer" -->
</body>
</html>