<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!--
   Copyright (c) 2018, Oracle and/or its affiliates. All rights reserved.
   Licensed under the Universal Permissive License v 1.0 as shown at http://oss.oracle.com/licenses/upl.
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ja" lang="ja">
<head><meta http-equiv="Content-Type" content="text/html; charset=us-ascii" />
<meta name="DC.Type" content="task" />
<meta name="DC.Title" content="&#12464;&#12521;&#12501;&#12398;&#20351;&#29992;" />
<meta name="abstract" content="JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12399;&#12289;&#12464;&#12521;&#12501;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#23646;&#24615;&#12364;&#26178;&#38291;&#20869;&#12395;&#12393;&#12398;&#12424;&#12358;&#12395;&#20516;&#12434;&#22793;&#26356;&#12377;&#12427;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;" />
<meta name="description" content="JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12399;&#12289;&#12464;&#12521;&#12501;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#23646;&#24615;&#12364;&#26178;&#38291;&#20869;&#12395;&#12393;&#12398;&#12424;&#12358;&#12395;&#20516;&#12434;&#22793;&#26356;&#12377;&#12427;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;" />
<meta name="DC.Format" content="XHTML" />
<meta name="DC.Identifier" content="GUID-59CA7784-185A-4EED-B523-F640881040FC" />
<meta name="DC.Language" content="ja" />

<meta http-equiv="Content-Style-Type" content="text/css" />
<meta http-equiv="Content-Script-Type" content="text/javascript" />
<title>&#12464;&#12521;&#12501;&#12398;&#20351;&#29992;</title>

<meta name="doctitle" content="&#12464;&#12521;&#12501;&#12398;&#20351;&#29992;&#xA;" />
<meta name="robots" content="noarchive" />
<link rel="copyright" href="http://oss.oracle.com/licenses/upl" title="&#33879;&#20316;&#27177;" type="text/html" />

<link rel="contents" href="toc.htm" title="&#30446;&#27425;" type="text/html" />
<link rel="prev" href="GUID-DE2B88DD-9E08-4C0A-80ED-4684986F3A73.htm" title="&#21069;" type="text/html" />
<link rel="next" href="GUID-440C24FA-59FD-471D-A1DC-7581C522E54E.htm" title="&#27425;" type="text/html" />
</head>
<body>
<div class="zz-skip-header"><a href="#BEGIN">&#12503;&#12521;&#12452;&#12510;&#12522;&#12539;&#12467;&#12531;&#12486;&#12531;&#12484;&#12408;&#31227;&#21205;</a></div>
<table class="simple oac_no_warn" summary="" cellspacing="0" cellpadding="0" width="100%">
<col width="86%" /><col width="*" /><tr valign="bottom">
<td></td>


<td align="center">
<a href="GUID-DE2B88DD-9E08-4C0A-80ED-4684986F3A73.htm">
<img src="./dcommon/gifs/leftnav.gif" alt="&#21069;" /><br />
<span class="icon">&#21069;</span>
</a>
</td>
<td align="center">
<a href="GUID-440C24FA-59FD-471D-A1DC-7581C522E54E.htm">
<img src="./dcommon/gifs/rightnav.gif" alt="&#27425;" /><br />
<span class="icon">&#27425;</span>
</a>
</td>
<td> </td>


</tr>
</table><div class="ind"><a id="GUID-59CA7784-185A-4EED-B523-F640881040FC" name="GUID-59CA7784-185A-4EED-B523-F640881040FC"></a><!-- End Header -->
<h1 id="JMCOH-GUID-59CA7784-185A-4EED-B523-F640881040FC" class="sect1">&#12464;&#12521;&#12501;&#12398;&#20351;&#29992;</h1>
<div><p>JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12399;&#12289;&#12464;&#12521;&#12501;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#23646;&#24615;&#12364;&#26178;&#38291;&#20869;&#12395;&#12393;&#12398;&#12424;&#12358;&#12395;&#20516;&#12434;&#22793;&#26356;&#12377;&#12427;&#12363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
<div class="section">&#12377;&#12409;&#12390;&#12398;&#12464;&#12521;&#12501;&#12398;&#21491;&#20596;&#12399;&#12289;&#12464;&#12521;&#12501;&#12395;&#36861;&#21152;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;&#23646;&#24615;&#12398;&#20961;&#20363;&#12391;&#12377;&#12290;&#23646;&#24615;&#12398;&#27178;&#12398;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#12381;&#12428;&#12425;&#12434;&#12464;&#12521;&#12501;&#12395;&#34920;&#31034;&#12375;&#12383;&#12426;&#12289;&#38750;&#34920;&#31034;&#12395;&#12375;&#12383;&#12426;&#12391;&#12365;&#12414;&#12377;&#12290;&#12464;&#12521;&#12501;&#12398;&#23646;&#24615;&#12398;&#36861;&#21152;&#12362;&#12424;&#12403;&#21066;&#38500;&#12398;&#35443;&#32048;&#12399;&#12289;&#12300;&#23646;&#24615;&#12398;&#25805;&#20316;&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;<p>&#12473;&#12463;&#12522;&#12540;&#12531;&#12539;&#12522;&#12540;&#12480;&#12540;&#12398;&#12518;&#12540;&#12470;&#12540;&#12364;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12394;&#34920;&#24418;&#24335;&#12395;&#12464;&#12521;&#12501;&#12434;&#20999;&#12426;&#26367;&#12360;&#12427;&#12395;&#12399;&#12289;&#12464;&#12521;&#12501;&#12398;&#21491;&#19978;&#38533;&#12398;<span class="bold">&#12300;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#12539;&#12514;&#12540;&#12489;&#12301;</span>&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12409;&#12390;&#12398;&#12464;&#12521;&#12501;&#12398;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#12539;&#12514;&#12540;&#12489;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#25163;&#38918;:</p>
</div>
<!-- class="section" -->
<ol><li><span><span class="bold">&#12300;&#12454;&#12451;&#12531;&#12489;&#12454;&#12301;</span>&#12513;&#12491;&#12517;&#12540;&#12434;&#38283;&#12365;&#12289;<span class="bold">&#12300;&#12503;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12301;</span>&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</span></li>
<li><span>&#24038;&#12506;&#12452;&#12531;&#12391;&#12289;<span class="bold">&#12300;JDK Mission Control&#12301;</span>&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</span></li>
<li><span><span class="bold">&#12300;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12301;</span>&#12391;&#12289;<span class="bold">&#12300;&#12450;&#12463;&#12475;&#12471;&#12499;&#12522;&#12486;&#12451;&#12539;&#12514;&#12540;&#12489;&#12398;&#20351;&#29992;&#12301;</span>&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</span></li>
<li><span><span class="bold">&#12300;&#36969;&#29992;&#12301;</span>&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#22793;&#26356;&#12434;&#36969;&#29992;&#12375;&#12414;&#12377;&#12290;</span></li>
</ol>
<div class="section"><span class="bold">&#12300;&#26356;&#26032;&#12398;&#26377;&#21177;&#21270;&#12301;</span>&#12508;&#12479;&#12531;&#12434;&#20999;&#12426;&#26367;&#12360;&#12390;&#12289;&#20219;&#24847;&#12398;&#12464;&#12521;&#12501;&#12398;&#26356;&#26032;&#12434;&#38283;&#22987;&#12414;&#12383;&#12399;&#20572;&#27490;&#12375;&#12414;&#12377;&#12290;<p>&#12464;&#12521;&#12501;&#12398;&#22806;&#35251;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12464;&#12521;&#12501;&#12434;&#21491;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#27425;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12513;&#12491;&#12517;&#12540;&#38917;&#30446;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<div class="p"><ul style="list-style-type: disc;"><li><p><span class="bold">&#34920;&#31034;</span>: &#34920;&#31034;&#12377;&#12427;&#26178;&#38291;&#38291;&#38548;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#36942;&#21435;15&#31186;&#12289;&#20998;&#12289;10&#20998;&#12289;&#26178;&#38291;&#12289;&#26085;&#12289;&#36913;&#12434;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li><p><span class="bold">Y&#36600;&#12398;&#31684;&#22258;</span>: &#32294;&#36600;&#12398;&#12473;&#12465;&#12540;&#12523;&#12398;&#31684;&#22258;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#26368;&#23567;&#20516;&#12392;&#26368;&#22823;&#20516;&#12395;&#24467;&#12387;&#12390;&#31684;&#22258;&#12434;&#33258;&#21205;&#35519;&#25972;&#12377;&#12427;&#12289;&#26368;&#22823;&#20516;&#12398;&#12415;&#12395;&#24467;&#12387;&#12390;&#31684;&#22258;&#12434;&#33258;&#21205;&#35519;&#25972;&#12377;&#12427;&#12289;&#12393;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12391;&#12418;&#12476;&#12525;&#12434;&#34920;&#31034;&#12377;&#12427;&#12289;&#12414;&#12383;&#12399;&#26368;&#23567;&#20516;&#12392;&#26368;&#22823;&#20516;&#12434;&#25163;&#21205;&#12391;&#25351;&#23450;&#12377;&#12427;&#12424;&#12358;&#12395;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li><p><span class="bold">&#12521;&#12505;&#12523;&#23494;&#24230;</span>: &#32294;&#36600;&#12398;&#12473;&#12465;&#12540;&#12523;&#12398;&#12521;&#12505;&#12523;&#23494;&#24230;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12300;&#21487;&#22793;&#12301;&#12289;&#12300;&#38750;&#24120;&#12395;&#23494;&#12301;&#12289;&#12300;&#23494;&#12301;&#12289;&#12300;&#27161;&#28310;&#12301;&#12289;&#12300;&#30094;&#12301;&#12362;&#12424;&#12403;&#12300;&#38750;&#24120;&#12395;&#30094;&#12301;&#12434;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li><p><span class="bold">&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12539;&#12514;&#12540;&#12489;</span>: &#12464;&#12521;&#12501;&#12398;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12398;&#12469;&#12502;&#12469;&#12531;&#12503;&#12522;&#12531;&#12464;&#12414;&#12383;&#12399;&#24179;&#22343;&#21270;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li><p><span class="bold">&#12479;&#12452;&#12488;&#12523;&#12398;&#32232;&#38598;</span>: &#12464;&#12521;&#12501;&#12398;&#12479;&#12452;&#12488;&#12523;&#12289;Y&#36600;&#12398;&#12479;&#12452;&#12488;&#12523;&#12414;&#12383;&#12399;X&#36600;&#12398;&#12479;&#12452;&#12488;&#12523;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li><p><span class="bold">&#12474;&#12540;&#12512;&#12539;&#12452;&#12531;</span>: &#12464;&#12521;&#12501;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#12474;&#12540;&#12512;&#12539;&#12452;&#12531;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li><p><span class="bold">&#12474;&#12540;&#12512;&#12539;&#12450;&#12454;&#12488;</span>: &#12464;&#12521;&#12501;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#12474;&#12540;&#12512;&#12539;&#12450;&#12454;&#12488;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li><p><span class="bold">&#30011;&#20687;&#12392;&#12375;&#12390;&#12456;&#12463;&#12473;&#12509;&#12540;&#12488;</span>: &#12464;&#12521;&#12501;&#12398;&#29694;&#22312;&#12398;&#29366;&#24907;&#12434;PNG&#12452;&#12513;&#12540;&#12472;&#12539;&#12501;&#12449;&#12452;&#12523;&#12392;&#12375;&#12390;&#20445;&#23384;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</div>
</div>
<!-- class="section" -->
</div>
</div><!-- class="ind" --><!-- Start Footer -->
<table class="simple oac_no_warn" summary="" cellspacing="0" cellpadding="0" width="100%">
<col width="86%" /><col width="*" /><tr valign="bottom">
<td><a href="http://oss.oracle.com/licenses/upl"><br />
<span class="copyrightlogo">Copyright&#160;&#169;&#160;2018, Oracle&#160;and/or&#160;its&#160;affiliates &#160;All&#160;rights&#160;reserved.</span></a></td>


<td align="center">
<a href="GUID-DE2B88DD-9E08-4C0A-80ED-4684986F3A73.htm">
<img src="./dcommon/gifs/leftnav.gif" alt="&#21069;" /><br />
<span class="icon">&#21069;</span>
</a>
</td>
<td align="center">
<a href="GUID-440C24FA-59FD-471D-A1DC-7581C522E54E.htm">
<img src="./dcommon/gifs/rightnav.gif" alt="&#27425;" /><br />
<span class="icon">&#27425;</span>
</a>
</td>
<td> </td>


</tr>
</table>

<!-- class="footer" -->
</body>
</html>