<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!--
   Copyright (c) 2018, Oracle and/or its affiliates. All rights reserved.
   Licensed under the Universal Permissive License v 1.0 as shown at http://oss.oracle.com/licenses/upl.
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ja" lang="ja">
<head><meta http-equiv="Content-Type" content="text/html; charset=us-ascii" />
<meta name="DC.Type" content="concept" />
<meta name="DC.Title" content="JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#12388;&#12356;&#12390;" />
<meta name="abstract" content="JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12289;Java Virtual Machine (JVM)&#12398;&#23455;&#34892;&#20013;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12420;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#23455;&#34892;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12514;&#12491;&#12479;&#12540;&#12362;&#12424;&#12403;&#21046;&#24481;&#12391;&#12365;&#12414;&#12377;&#12290;" />
<meta name="description" content="JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12289;Java Virtual Machine (JVM)&#12398;&#23455;&#34892;&#20013;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12420;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#23455;&#34892;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12514;&#12491;&#12479;&#12540;&#12362;&#12424;&#12403;&#21046;&#24481;&#12391;&#12365;&#12414;&#12377;&#12290;" />
<meta name="DC.Format" content="XHTML" />
<meta name="DC.Identifier" content="GUID-D319B54B-FB4B-422E-8B92-50F4FFBF1153" />
<meta name="DC.Language" content="ja" />

<meta http-equiv="Content-Style-Type" content="text/css" />
<meta http-equiv="Content-Script-Type" content="text/javascript" />
<title>JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#12388;&#12356;&#12390;</title>

<meta name="doctitle" content="5 JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#12388;&#12356;&#12390;&#xA;" />
<meta name="robots" content="noarchive" />
<link rel="copyright" href="http://oss.oracle.com/licenses/upl" title="&#33879;&#20316;&#27177;" type="text/html" />

<link rel="contents" href="toc.htm" title="&#30446;&#27425;" type="text/html" />
<link rel="prev" href="GUID-2125BB8B-CC13-4125-8562-F0BFD428F1DC.htm" title="&#21069;" type="text/html" />
<link rel="next" href="GUID-E7631E91-FDF6-48A1-B5C4-8C0B72E515DA.htm" title="&#27425;" type="text/html" />
</head>
<body>
<div class="zz-skip-header"><a href="#BEGIN">&#12503;&#12521;&#12452;&#12510;&#12522;&#12539;&#12467;&#12531;&#12486;&#12531;&#12484;&#12408;&#31227;&#21205;</a></div>
<table class="simple oac_no_warn" summary="" cellspacing="0" cellpadding="0" width="100%">
<col width="86%" /><col width="*" /><tr valign="bottom">
<td></td>


<td align="center">
<a href="GUID-2125BB8B-CC13-4125-8562-F0BFD428F1DC.htm">
<img src="./dcommon/gifs/leftnav.gif" alt="&#21069;" /><br />
<span class="icon">&#21069;</span>
</a>
</td>
<td align="center">
<a href="GUID-E7631E91-FDF6-48A1-B5C4-8C0B72E515DA.htm">
<img src="./dcommon/gifs/rightnav.gif" alt="&#27425;" /><br />
<span class="icon">&#27425;</span>
</a>
</td>
<td> </td>


</tr>
</table><div class="ind"><a id="GUID-D319B54B-FB4B-422E-8B92-50F4FFBF1153" name="GUID-D319B54B-FB4B-422E-8B92-50F4FFBF1153"></a><!-- End Header -->
<h1 id="JMCOH-GUID-D319B54B-FB4B-422E-8B92-50F4FFBF1153" class="sect1"><span class="enumeration_chapter">5 </span>JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#12388;&#12356;&#12390;</h1>
<div><p>JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12289;Java Virtual Machine (JVM)&#12398;&#23455;&#34892;&#20013;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12420;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#23455;&#34892;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12514;&#12491;&#12479;&#12540;&#12362;&#12424;&#12403;&#21046;&#24481;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12399;&#12289;&#12513;&#12514;&#12522;&#12540;&#12392;CPU&#12398;&#20351;&#29992;&#29366;&#27841;&#12394;&#12393;&#12398;Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#29305;&#24615;&#12289;&#12362;&#12424;&#12403;&#12460;&#12505;&#12540;&#12472;&#12539;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12289;&#12513;&#12477;&#12483;&#12489;&#12398;&#26368;&#36969;&#21270;&#12394;&#12393;&#12398;JVM&#12450;&#12463;&#12486;&#12451;&#12499;&#12486;&#12451;&#12395;&#38306;&#12377;&#12427;&#12522;&#12450;&#12523;&#12479;&#12452;&#12512;&#12398;&#24773;&#22577;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#24773;&#22577;&#12399;&#12289;&#38283;&#30330;&#29872;&#22659;&#12395;&#12362;&#12356;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12521;&#12452;&#12501;&#12539;&#12469;&#12452;&#12463;&#12523;&#12398;&#12393;&#12398;&#26178;&#28857;&#12391;&#26368;&#12418;&#12513;&#12514;&#12522;&#12540;&#12434;&#28040;&#36027;&#12377;&#12427;&#12363;&#35211;&#12388;&#12369;&#20986;&#12377;&#12371;&#12392;&#12420;&#12289;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#29872;&#22659;&#12395;&#12362;&#12356;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12398;&#12471;&#12473;&#12486;&#12512;&#12539;&#12504;&#12523;&#12473;&#12434;&#12514;&#12491;&#12479;&#12540;&#12377;&#12427;&#12371;&#12392;&#12394;&#12393;&#12289;&#12393;&#12385;&#12425;&#12398;&#29872;&#22659;&#12391;&#12418;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12399;&#12510;&#12523;&#12481;&#12479;&#12502;&#12434;&#20633;&#12360;&#12383;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#21508;&#12479;&#12502;&#12391;&#12289;JVM&#12420;&#12381;&#12398;JVM&#12391;&#23455;&#34892;&#20013;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#19968;&#37096;&#20998;&#12434;&#12514;&#12491;&#12479;&#12540;&#12362;&#12424;&#12403;&#21046;&#24481;&#12391;&#12365;&#12414;&#12377;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#12479;&#12502;&#12398;&#12475;&#12483;&#12488;&#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12398;&#12503;&#12521;&#12464;&#12452;&#12531;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="GUID-E7631E91-FDF6-48A1-B5C4-8C0B72E515DA.htm" title="JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#25509;&#32154;&#20808;&#12398;JVM&#12434;JVM&#12502;&#12521;&#12454;&#12470;&#12391;&#21491;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#12300;JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#38283;&#22987;&#12375;&#12414;&#12377;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;">JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12398;&#20351;&#29992;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>Java&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12289;&#12522;&#12477;&#12540;&#12473;&#28040;&#36027;&#12362;&#12424;&#12403;&#12525;&#12462;&#12531;&#12464;&#35373;&#23450;&#12398;&#12514;&#12491;&#12479;&#12522;&#12531;&#12464;&#12392;&#31649;&#29702;&#12434;&#34892;&#12358;&#12383;&#12417;&#12398;&#12289;&#25216;&#34899;&#30340;&#12395;&#20778;&#12428;&#12383;&#35373;&#35336;&#12434;&#20633;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;JDK Mission Control&#12399;&#12289;JVM&#12362;&#12424;&#12403;Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12522;&#12477;&#12540;&#12473;&#12398;&#12514;&#12491;&#12479;&#12522;&#12531;&#12464;&#12392;&#31649;&#29702;&#12398;&#12383;&#12417;&#12395;Java Management Extensions (JMX)&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>Simple Network Management Protocol (SNMP)&#12420;&#20182;&#12398;&#31649;&#29702;&#27161;&#28310;&#12392;&#21516;&#12376;&#12367;&#12289;JMX&#12399;&#24195;&#12367;&#30693;&#12425;&#12428;&#12383;&#20181;&#27096;&#12391;&#12354;&#12426;&#12289;&#19968;&#33324;&#30340;&#12395;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#12514;&#12491;&#12479;&#12522;&#12531;&#12464;&#35069;&#21697;&#12398;&#22810;&#12367;&#12398;&#12505;&#12531;&#12480;&#12540;&#12364;JMX&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;JMX&#12391;&#12399;Java Runtime Environment (JRE)&#12362;&#12424;&#12403;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12514;&#12491;&#12479;&#12540;&#12377;&#12427;&#27161;&#28310;&#30340;&#12394;&#26041;&#27861;&#12364;&#25552;&#20379;&#12373;&#12428;&#12414;&#12377;&#12290;JMX Remote Method Invocation (JMXRMI) API&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#12381;&#12398;&#12514;&#12491;&#12479;&#12522;&#12531;&#12464;&#12395;&#12522;&#12514;&#12540;&#12488;&#12391;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290;&#12484;&#12540;&#12523;&#12399;&#12289;&#31649;&#29702;&#23550;&#35937;&#12469;&#12540;&#12496;&#12540;&#12395;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;JMX Managed Bean (MBean)&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12363;&#12425;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12289;&#29420;&#33258;&#12398;MBean&#12434;&#20316;&#25104;&#12375;&#12390;&#31649;&#29702;&#23550;&#35937;&#12469;&#12540;&#12496;&#12540;&#12395;&#30331;&#37682;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;(&#31649;&#29702;&#23550;&#35937;&#12469;&#12540;&#12496;&#12540;&#12399;&#12289;&#12522;&#12514;&#12540;&#12488;&#12539;&#12450;&#12463;&#12475;&#12473;&#12398;&#12383;&#12417;&#12398;&#12471;&#12531;&#12464;&#12523;&#12539;&#12509;&#12452;&#12531;&#12488;&#12392;&#12375;&#12390;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;)&#12290;JMX&#28310;&#25312;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;(JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12394;&#12393;)&#12399;&#12289;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;&#12395;&#25509;&#32154;&#12391;&#12365;&#12289;JMX&#12486;&#12463;&#12494;&#12525;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;JVM&#12398;&#20001;&#26041;&#12434;&#31649;&#29702;&#12391;&#12365;&#12414;&#12377;&#12290;JMX&#27161;&#28310;&#12398;&#35443;&#32048;&#12399;&#12289;&#12300;Java Management Extensions API&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#23455;&#34892;&#12375;&#12390;JVM&#12434;&#12514;&#12491;&#12479;&#12540;&#12377;&#12427;&#12383;&#12417;&#12395;&#12363;&#12363;&#12427;&#20313;&#20998;&#12394;&#12467;&#12473;&#12488;&#12399;&#12431;&#12378;&#12363;&#12391;&#12354;&#12426;&#12289;&#32771;&#24942;&#12375;&#12394;&#12367;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;&#12381;&#12428;&#12395;&#12424;&#12387;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12514;&#12491;&#12479;&#12522;&#12531;&#12464;&#12420;&#12503;&#12525;&#12501;&#12449;&#12452;&#12522;&#12531;&#12464;&#12434;&#20302;&#12467;&#12473;&#12488;&#12391;&#23455;&#34892;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<div class="infoboxnote" id="GUID-D319B54B-FB4B-422E-8B92-50F4FFBF1153__GUID-A72BD337-F518-43DD-8DAC-441962AA4C97"><p class="notep1">&#27880;:</p>JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;JVM&#12392;&#21516;&#12376;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12391;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;JVM&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#26412;&#26469;&#20351;&#29992;&#12391;&#12365;&#12427;&#12522;&#12477;&#12540;&#12473;&#12434;JMX&#12467;&#12531;&#12477;&#12540;&#12523;GUI&#12364;&#28040;&#36027;&#12375;&#12414;&#12377;&#12290;JMX&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#20351;&#29992;&#12379;&#12378;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#24819;&#23450;&#12375;&#12390;&#12356;&#12383;&#22580;&#21512;&#12289;&#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#35492;&#12387;&#12383;&#20998;&#26512;&#12364;&#23566;&#12365;&#20986;&#12373;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</div>
</div>
</div><!-- class="ind" --><!-- Start Footer -->
<table class="simple oac_no_warn" summary="" cellspacing="0" cellpadding="0" width="100%">
<col width="86%" /><col width="*" /><tr valign="bottom">
<td><a href="http://oss.oracle.com/licenses/upl"><br />
<span class="copyrightlogo">Copyright&#160;&#169;&#160;2018, Oracle&#160;and/or&#160;its&#160;affiliates &#160;All&#160;rights&#160;reserved.</span></a></td>


<td align="center">
<a href="GUID-2125BB8B-CC13-4125-8562-F0BFD428F1DC.htm">
<img src="./dcommon/gifs/leftnav.gif" alt="&#21069;" /><br />
<span class="icon">&#21069;</span>
</a>
</td>
<td align="center">
<a href="GUID-E7631E91-FDF6-48A1-B5C4-8C0B72E515DA.htm">
<img src="./dcommon/gifs/rightnav.gif" alt="&#27425;" /><br />
<span class="icon">&#27425;</span>
</a>
</td>
<td> </td>


</tr>
</table>

<!-- class="footer" -->
</body>
</html>