#
#  Copyright (c) 2018, Oracle and/or its affiliates. All rights reserved.
#
#  DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.
#
#  The contents of this file are subject to the terms of either the Universal Permissive License 
#  v 1.0 as shown at http://oss.oracle.com/licenses/upl
#   
#  or the following license:
#   
#  Redistribution and use in source and binary forms, with or without modification, are permitted
#  provided that the following conditions are met:
#   
#  1. Redistributions of source code must retain the above copyright notice, this list of conditions
#  and the following disclaimer.
#   
#  2. Redistributions in binary form must reproduce the above copyright notice, this list of
#  conditions and the following disclaimer in the documentation and/or other materials provided with
#  the distribution.
#   
#  3. Neither the name of the copyright holder nor the names of its contributors may be used to
#  endorse or promote products derived from this software without specific prior written permission.
#
#  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR
#  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND
#  FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
#  CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
#  DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
#  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
#  WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY
#  WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
#
# Since these properties are inserted into a XML-file the newlines must be &#13; instead of \n.
# Otherwise they will only be newlines in the XML-file, not in tag values.
# The translation would be done prematurely.

RULE_PATH_JAVA_SE=Java SE
RULE_PATH_WLS31=WebLogic Server 10.3 - \u30B5\u30F3\u30D7\u30EB\u30FB\u30B5\u30FC\u30D0\u30FC

CPU_HIGH_USAGE_MACHINE_NAME=CPU\u4F7F\u7528\u72B6\u6CC1 - \u30DE\u30B7\u30F3(\u904E\u5270)
CPU_HIGH_USAGE_MACHINE_DESCRIPTION=\u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30FB\u30B7\u30B9\u30C6\u30E0MBean\u306ESystemCpuLoad\u5C5E\u6027\u3067\u306F\u3001\u30DB\u30B9\u30C8\u30FB\u30B3\u30F3\u30D4\u30E5\u30FC\u30BF\u306E\u3059\u3079\u3066\u306E\u30D7\u30ED\u30BB\u30C3\u30B5\u306E\u5E73\u5747\u8CA0\u8377\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002&#13;&#13;CPU\u4F7F\u7528\u7387\u304C\u9AD8\u3044\u5834\u5408\u3001\u30EC\u30B9\u30DD\u30F3\u30B9\u6642\u9593\u304C\u8A31\u5BB9\u7BC4\u56F2\u3092\u8D85\u3048\u3066\u9045\u304F\u306A\u3063\u305F\u308A\u3001GC\u306E\u4E00\u6642\u505C\u6B62\u6642\u9593\u304C\u9577\u304F\u306A\u3063\u305F\u308A\u3001\u30AF\u30E9\u30B9\u30BF\u30EA\u30F3\u30B0\u306E\u554F\u984C\u304C\u767A\u751F\u3057\u305F\u308A\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
CPU_LOW_USAGE_MACHINE_NAME=CPU\u4F7F\u7528\u72B6\u6CC1 - \u30DE\u30B7\u30F3(\u904E\u5C11)
CPU_LOW_USAGE_MACHINE_DESCRIPTION=\u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30FB\u30B7\u30B9\u30C6\u30E0MBean\u306ESystemCpuLoad\u5C5E\u6027\u3067\u306F\u3001\u30DB\u30B9\u30C8\u30FB\u30B3\u30F3\u30D4\u30E5\u30FC\u30BF\u306E\u3059\u3079\u3066\u306E\u30D7\u30ED\u30BB\u30C3\u30B5\u306E\u5E73\u5747\u8CA0\u8377\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002&#13;&#13;CPU\u4F7F\u7528\u7387\u304C\u4F4E\u3044\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u30FB\u30DE\u30B7\u30F3\u4E0A\u306E\u30A8\u30E9\u30FC\u306B\u3088\u308B\u3082\u306E\u3067\u3042\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
PENDING_QUEUE_REQUESTS_NAME=\u30AD\u30E5\u30FC\u306B\u5165\u308C\u3089\u308C\u305F\u4FDD\u7559\u4E2D\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u6570(\u904E\u5270)
PENDING_QUEUE_REQUESTS_DESCRIPTION=ThreadPoolRuntime MBean\u306EQueueLength\u5C5E\u6027\u3067\u306F\u3001\u512A\u5148\u30AD\u30E5\u30FC\u306B\u5165\u308C\u3089\u308C\u305F\u4FDD\u7559\u4E2D\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u6570\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u5185\u90E8\u30B7\u30B9\u30C6\u30E0\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u3068\u30E6\u30FC\u30B6\u30FC\u30FB\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u5408\u8A08\u3067\u3059\u3002&#13;&#13;\u30AD\u30E5\u30FC\u306B\u5165\u308C\u3089\u308C\u305F\u4FDD\u7559\u4E2D\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u6570\u304C\u975E\u5E38\u306B\u591A\u3044\u5834\u5408\u3001\u30DC\u30C8\u30EB\u30CD\u30C3\u30AF\u306E\u5B58\u5728\u3092\u793A\u3057\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
CPU_HIGH_USAGE_JVM_NAME=CPU\u4F7F\u7528\u72B6\u6CC1 - JVM\u30D7\u30ED\u30BB\u30B9(\u904E\u5270)
CPU_HIGH_USAGE_JVM_DESCRIPTION=\u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30FB\u30B7\u30B9\u30C6\u30E0Mbean\u306EProcessCpuLoad\u5C5E\u6027\u3067\u306F\u3001JVM\u30D7\u30ED\u30BB\u30B9\u306E\u3059\u3079\u3066\u306E\u30D7\u30ED\u30BB\u30C3\u30B5\u306E\u5E73\u5747\u8CA0\u8377\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002&#13;&#13;CPU\u4F7F\u7528\u7387\u304C\u9AD8\u3044\u5834\u5408\u3001\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306B\u554F\u984C\u304C\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
CPU_LOW_USAGE_JVM_NAME=CPU\u4F7F\u7528\u72B6\u6CC1 - JVM\u30D7\u30ED\u30BB\u30B9(\u904E\u5C11)
CPU_LOW_USAGE_JVM_DESCRIPTION=\u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30FB\u30B7\u30B9\u30C6\u30E0Mbean\u306EProcessCpuLoad\u5C5E\u6027\u3067\u306F\u3001JVM\u30D7\u30ED\u30BB\u30B9\u306E\u3059\u3079\u3066\u306E\u30D7\u30ED\u30BB\u30C3\u30B5\u306E\u5E73\u5747\u8CA0\u8377\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002&#13;&#13;CPU\u4F7F\u7528\u7387\u304C\u4F4E\u3044\u5834\u5408\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u30DC\u30C8\u30EB\u30CD\u30C3\u30AF\u304C\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
MONITORED_DEADLOCKED_THREADS_NAME=\u30E2\u30CB\u30BF\u30FC\u5BFE\u8C61\u306E\u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9
MONITORED_DEADLOCKED_THREADS_DESCRIPTION=Threading MBean\u306EfindMonitoredDeadlockedThreads\u30E1\u30BD\u30C3\u30C9\u3067\u306F\u3001\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30E2\u30CB\u30BF\u30FC\u306E\u53D6\u5F97\u3092\u5F85\u6A5F\u3057\u3066\u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002&#13;&#13;\u3053\u306E\u30EB\u30FC\u30EB\u306F\u3001\u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u304C\u767A\u751F\u3059\u308B\u3068\u30C8\u30EA\u30AC\u30FC\u3055\u308C\u307E\u3059\u3002
DEADLOCKED_THREADS_NAME=\u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9
DEADLOCKED_THREADS_DESCRIPTION=Threading MBean\u306EfindDeadlockedThreads\u30E1\u30BD\u30C3\u30C9\u3067\u306F\u3001\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30E2\u30CB\u30BF\u30FC\u307E\u305F\u306F\u6240\u6709\u53EF\u80FD\u306A\u30B7\u30F3\u30AF\u30ED\u30CA\u30A4\u30B6\u306E\u53D6\u5F97\u3092\u5F85\u6A5F\u3057\u3066\u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002&#13;&#13;\u3053\u306E\u30EB\u30FC\u30EB\u306F\u3001\u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u304C\u767A\u751F\u3059\u308B\u3068\u30C8\u30EA\u30AC\u30FC\u3055\u308C\u307E\u3059\u3002
THREAD_COUNT_NAME=\u30B9\u30EC\u30C3\u30C9\u6570(\u904E\u5270)
THREAD_COUNT_DESCRIPTION=Threading MBean\u306EThreadCount\u5C5E\u6027\u3067\u306F\u3001\u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u3059\u3079\u3066\u306E\u30D7\u30ED\u30BB\u30C3\u30B5\u3067\u73FE\u5728\u5B9F\u884C\u4E2D\u306EJava\u30B9\u30EC\u30C3\u30C9(\u30C7\u30FC\u30E2\u30F3\u304A\u3088\u3073\u30C7\u30FC\u30E2\u30F3\u4EE5\u5916)\u306E\u6570\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002&#13;&#13;\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u304C\u591A\u3044\u5834\u5408\u3001\u30DC\u30C8\u30EB\u30CD\u30C3\u30AF\u306E\u5B58\u5728\u3092\u793A\u3057\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u305F\u3068\u3048\u3070\u3001WLS\u304C\u81EA\u5DF1\u30C1\u30E5\u30FC\u30CB\u30F3\u30B0\u30FB\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30FC\u30EB\u3092\u4F7F\u7528\u3059\u308B\u3088\u3046\u306B\u69CB\u6210\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u30B9\u30EC\u30C3\u30C9\u6570\u306E\u5909\u5316\u306F\u3001\u7AF6\u5408\u306E\u767A\u751F\u7387\u304C\u9AD8\u304F\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306B\u554F\u984C\u304C\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
THREADS_WAITING_FOR_MBEAN_NAME=Bean\u5F85\u6A5F\u30B9\u30EC\u30C3\u30C9\u6570(\u904E\u5270)
THREADS_WAITING_FOR_MBEAN_DESCRIPTION=EJBPoolRuntime MBean\u306EWaiterCurrentCount\u5C5E\u6027\u3067\u306F\u3001\u7A7A\u304D\u30D7\u30FC\u30EB\u304B\u3089\u4F7F\u7528\u53EF\u80FD\u306ABean\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u73FE\u5728\u5F85\u6A5F\u3057\u3066\u3044\u308B\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u304C\u793A\u3055\u308C\u307E\u3059\u3002&#13;&#13;Bean\u306E\u53D6\u5F97\u3092\u5F85\u6A5F\u4E2D\u306E\u30B9\u30EC\u30C3\u30C9\u6570\u304C\u591A\u3044\u5834\u5408\u3001\u7AF6\u5408\u304C\u5B58\u5728\u3059\u308B\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
OPEN_SESSIONS_NAME=\u30AA\u30FC\u30D7\u30F3\u30FB\u30BB\u30C3\u30B7\u30E7\u30F3\u6570(\u904E\u5270)
OPEN_SESSIONS_DESCRIPTION=WebAppComponentRuntime MBean\u306EOpenSessionCurrentCount\u5C5E\u6027\u3067\u306F\u3001\u3053\u306E\u30E2\u30B8\u30E5\u30FC\u30EB\u3067\u30AA\u30FC\u30D7\u30F3\u3057\u3066\u3044\u308B\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u73FE\u5728\u306E\u5408\u8A08\u6570\u304C\u793A\u3055\u308C\u307E\u3059\u3002&#13;&#13;\u5358\u4E00\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u904E\u8CA0\u8377\u306B\u306A\u308B\u306E\u3092\u907F\u3051\u308B\u305F\u3081\u306B\u3001\u73FE\u5728\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u6570\u3092\u30E2\u30CB\u30BF\u30FC\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002HTTP\u30BB\u30C3\u30B7\u30E7\u30F3\u6570\u304C\u591A\u3044\u5834\u5408\u3001Web\u30B5\u30FC\u30D0\u30FC\u30FB\u30D7\u30E9\u30B0\u30A4\u30F3\u3067\u306E\u8CA0\u8377\u5206\u6563\u306B\u554F\u984C\u304C\u3042\u308B\u304B\u3001\u30EC\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30B0\u30EB\u30FC\u30D7\u69CB\u6210\u306B\u554F\u984C\u304C\u3042\u308B\u304B\u3001\u307E\u305F\u306F\u4ED6\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u4F7F\u7528\u4E0D\u53EF\u3067\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
SERVER_HEALTH_NAME=\u30B5\u30FC\u30D0\u30FC\u30FB\u30D8\u30EB\u30B9(OK\u3067\u306A\u3044)
SERVER_HEALTH_DESCRIPTION=ServerRuntime Mbean\u306EHealthState\u5C5E\u6027\u3067\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u306E\u30D8\u30EB\u30B9\u72B6\u614B\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002\u305F\u3068\u3048\u3070\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u6570\u304C\u591A\u3059\u304E\u3066\u904E\u8CA0\u8377\u306B\u306A\u3063\u3066\u3044\u308B\u304B\u3001\u3088\u308A\u591A\u304F\u306E\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30BD\u30FC\u30B9\u304C\u5FC5\u8981\u304B\u3001\u305D\u306E\u4ED6\u306E\u7406\u7531\u3067\u305F\u3060\u3061\u306B\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3059\u308B\u304B\u306A\u3069\u3092\u5831\u544A\u3067\u304D\u307E\u3059\u3002\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u308B\u5024\u306F\u6B21\u306E\u3068\u304A\u308A\u3067\u3059\u3002&#13;&#13;&lt;b&gt;HEALTH_OK&lt;/b&gt;&#13;&lt;b&gt;HEALTH_WARN&lt;/b&gt;&#13;&lt;b&gt;HEALTH_CRITICAL&lt;/b&gt;&#13;&lt;b&gt;HEALTH_FAILED&lt;/b&gt;&#13;&lt;b&gt;HEALTH_OVERLOADED&lt;/b&gt;&#13;&lt;b&gt;UNKNOWN&lt;/b&gt;&#13;&#13;\u30D8\u30EB\u30B9\u72B6\u614B\u304C&lt;b&gt;HEALTH_OK&lt;/b&gt;\u4EE5\u5916\u306E\u5834\u5408\u306F\u7570\u5E38\u306A\u72B6\u614B\u3067\u3042\u308A\u3001\u306A\u3093\u3089\u304B\u306E\u5BFE\u51E6\u3092\u8B1B\u3058\u308B\u5FC5\u8981\u304C\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
PRIMARY_OBJECTS_NAME=1\u6B21\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u6570(\u904E\u5270)
PRIMARY_OBJECTS_DESCRIPTION=ClusterRuntime MBean\u306EPrimaryCount\u5C5E\u6027\u3067\u306F\u3001\u30ED\u30FC\u30AB\u30EB\u30FB\u30B5\u30FC\u30D0\u30FC\u304C1\u6B21\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3068\u3057\u3066\u30DB\u30B9\u30C8\u3057\u3066\u3044\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u6570\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002&#13;&#13;1\u6B21\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u6570\u304C\u975E\u5E38\u306B\u591A\u3044\u5834\u5408\u306F\u3001\u8CA0\u8377\u5206\u6563\u306B\u554F\u984C\u304C\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
SERVER_STATE_NAME=\u30B5\u30FC\u30D0\u30FC\u72B6\u614B(\u5B9F\u884C\u4E2D\u3067\u306A\u3044)
SERVER_STATE_DESCRIPTION=ServerRuntime MBean\u306EState\u5C5E\u6027\u3067\u306F\u3001\u30E2\u30CB\u30BF\u30FC\u5BFE\u8C61\u30B5\u30FC\u30D0\u30FC\u306E\u73FE\u5728\u306E\u30E9\u30A4\u30D5\u30FB\u30B5\u30A4\u30AF\u30EB\u72B6\u614B\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002&#13;&#13;\u305F\u3068\u3048\u3070\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u9001\u53D7\u4FE1\u3067\u304D\u308B&lt;b&gt;RUNNING&lt;/b&gt;\u72B6\u614B\u3084\u3001\u7BA1\u7406\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u307F\u3092\u53D7\u4FE1\u3067\u304D\u308B&lt;b&gt;ADMIN&lt;/b&gt;\u72B6\u614B\u304C\u3042\u308A\u307E\u3059\u3002&#13;&#13;&lt;b&gt;RUNNING&lt;/b&gt;\u3068\u7570\u306A\u308B\u305D\u306E\u4ED6\u3059\u3079\u3066\u306E\u72B6\u614B\u306F\u7570\u5E38\u306A\u72B6\u614B\u3092\u793A\u3057\u3066\u304A\u308A\u3001\u306A\u3093\u3089\u304B\u306E\u5BFE\u51E6\u304C\u5FC5\u8981\u3067\u3059\u3002
LIVE_SET_NAME=\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8(\u904E\u5270)
LIVE_SET_DESCRIPTION=LiveSet\u5C5E\u6027\u3067\u306F\u3001\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u5F8C\u306E\u4F7F\u7528\u6E08Java\u30D2\u30FC\u30D7\u306E\u5272\u5408\u304C0\u304B\u30891.0\u307E\u3067\u306E\u5024\u3067\u5831\u544A\u3055\u308C\u307E\u3059\u3002&#13;&#13;\u6570\u5B57\u304C100%\u306B\u8FD1\u3044\u5834\u5408\u3001JVM\u304C\u30E1\u30E2\u30EA\u30FC\u4E0D\u8DB3\u306B\u306A\u308B\u30EA\u30B9\u30AF\u304C\u3042\u308A\u307E\u3059\u3002
PENDING_JMS_MESSAGES_NAME=\u4FDD\u7559\u4E2D\u306EJMS\u30E1\u30C3\u30BB\u30FC\u30B8\u6570(\u904E\u5270)
PENDING_JMX_MESSAGES_DESCRIPTION=JMSSessionRuntime MBean\u306EMessagesPendingCount\u5C5E\u6027\u3067\u306F\u3001\u3053\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u3067\u4FDD\u7559\u4E2D(\u672A\u30B3\u30DF\u30C3\u30C8\u304B\u3064\u672A\u78BA\u8A8D)\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u6570\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002&#13;&#13;\u4FDD\u7559\u4E2D\u30E1\u30C3\u30BB\u30FC\u30B8\u6570\u304C\u591A\u3044\u5834\u5408\u3001\u7AF6\u5408\u307E\u305F\u306F\u98E2\u9913\u72B6\u614B\u304C\u767A\u751F\u3057\u3066\u3044\u308B\u3053\u3068\u3092\u793A\u3057\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
REQ_WAITING_DB_CONNECTION_NAME=DB\u63A5\u7D9A\u3092\u5F85\u6A5F\u4E2D\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u6570(\u904E\u5270)
REQ_WAITING_DB_CONNECTION_DESCRIPTION=JDBCDataSourceRuntime MBean\u306EWaitingForConnectionCurrentCount\u5C5E\u6027\u3067\u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u63A5\u7D9A\u3092\u5F85\u6A5F\u4E2D\u306E\u63A5\u7D9A\u30EA\u30AF\u30A8\u30B9\u30C8\u6570\u304C\u5831\u544A\u3055\u308C\u307E\u3059\u3002&#13;&#13;\u3053\u306E\u6570\u304C\u591A\u3044\u5834\u5408\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306B\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306E\u30DC\u30C8\u30EB\u30CD\u30C3\u30AF\u304C\u5B58\u5728\u3059\u308B\u3053\u3068\u3092\u793A\u3057\u3066\u3044\u307E\u3059\u3002
MEMORY_PRESSURE_NAME=\u30E1\u30E2\u30EA\u30FC\u4E0D\u8DB3(\u904E\u5270)
MEMORY_PRESSURE_DESCRIPTION=\u30E1\u30E2\u30EA\u30FC\u4E0D\u8DB3\u5C5E\u6027\u3067\u306F\u3001\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30BD\u30FC\u30B9\u4E0D\u8DB3\u306B\u3088\u308A\u30B5\u30FC\u30D0\u30FC\u306E\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u304C\u4F4E\u4E0B\u3057\u3066\u3044\u308B\u304B\u3069\u3046\u304B\u3092\u793A\u3057\u307E\u3059\u3002\u5024\u7BC4\u56F2\u306F0\u304B\u308910\u3067\u30010\u306F\u4E0D\u8DB3\u3057\u3066\u3044\u306A\u3044\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002&#13;&#13;0\u3092\u8D85\u3048\u308B\u5024\u306F\u3001\u30E1\u30E2\u30EA\u30FC\u4E0D\u8DB3\u306B\u3088\u308A\u306A\u3093\u3089\u304B\u306E\u30B5\u30FC\u30D0\u30FC\u6A5F\u80FD\u306E\u4F4E\u4E0B\u304C\u767A\u751F\u3057\u3066\u3044\u308B\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
