#
#  Copyright (c) 2018, 2019, Oracle and/or its affiliates. All rights reserved.
#
#  DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.
#
#  The contents of this file are subject to the terms of either the Universal Permissive License 
#  v 1.0 as shown at http://oss.oracle.com/licenses/upl
#   
#  or the following license:
#   
#  Redistribution and use in source and binary forms, with or without modification, are permitted
#  provided that the following conditions are met:
#   
#  1. Redistributions of source code must retain the above copyright notice, this list of conditions
#  and the following disclaimer.
#   
#  2. Redistributions in binary form must reproduce the above copyright notice, this list of
#  conditions and the following disclaimer in the documentation and/or other materials provided with
#  the distribution.
#   
#  3. Neither the name of the copyright holder nor the names of its contributors may be used to
#  endorse or promote products derived from this software without specific prior written permission.
#
#  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR
#  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND
#  FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
#  CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
#  DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
#  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
#  WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY
#  WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
#
# {0} is an event type id, {1} is an attribute id
RulesToolkit_ATTRIBUTE_NOT_FOUND=ID ''{1}''\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u304B\u3089ID ''{0}''\u306E\u5C5E\u6027\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u3053\u306E\u8A18\u9332\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u306A\u3044\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u884C\u308F\u308C\u305F\u3088\u3046\u3067\u3059\u3002
# {0} is an event type id, {1} is an attribute id
RulesToolkit_ATTRIBUTE_NOT_FOUND_LONG=ID ''{1}''\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u304B\u3089ID ''{0}''\u306E\u5C5E\u6027\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u3053\u306E\u8A18\u9332\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u306A\u3044\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u884C\u308F\u308C\u305F\u3088\u3046\u3067\u3059\u3002<p>\u53E4\u3044\u30D0\u30FC\u30B8\u30E7\u30F3\u306EJava\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
RulesToolkit_EVERY_CHUNK=\u3059\u3079\u3066\u306E\u30C1\u30E3\u30F3\u30AF
# {0} is a rule name, {1} is one or more event type ids
RulesToolkit_RULE_REQUIRES_UNAVAILABLE_EVENT_TYPE={0}\u30EB\u30FC\u30EB\u306B\u306F\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u304C\u5FC5\u8981\u3067\u3059: {1}\u3002
# {0} is a rule name, {1} is one or more event type ids
RulesToolkit_RULE_REQUIRES_UNAVAILABLE_EVENT_TYPE_LONG={0}\u30EB\u30FC\u30EB\u306B\u306F\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u304C\u5FC5\u8981\u3067\u3059: {1}\u3002<p>\u3053\u308C\u3089\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u306F\u3001\u3053\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u306EJava\u3067\u306F\u4F7F\u7528\u3067\u304D\u306A\u3044\u304B\u3001\u30B5\u30FC\u30C9\u30D1\u30FC\u30C6\u30A3\u30FB\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u3067\u6709\u52B9\u5316\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u53E4\u3044\u30D0\u30FC\u30B8\u30E7\u30F3\u306EJava\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
# {0} is an event type name
RulesToolkit_RULE_REQUIRES_EVENT_TYPE_NOT_AVAILABLE=\u3053\u306E\u30EB\u30FC\u30EB\u3067\u306F\u3001\u6B21\u306E\u30BF\u30A4\u30D7\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u5B58\u5728\u3057\u306A\u3044\u3088\u3046\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059: {0}\u3002
# {0} is a rule name, {1} is one or more event type names
RulesToolkit_RULE_REQUIRES_EVENT_TYPE_NOT_AVAILABLE_LONG={0}\u30EB\u30FC\u30EB\u3067\u306F\u3001\u6B21\u306E\u30BF\u30A4\u30D7\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u5B58\u5728\u3057\u306A\u3044\u3088\u3046\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059: {1}\u3002<p>\u3053\u306E\u30EB\u30FC\u30EB\u3092\u6A5F\u80FD\u3055\u305B\u308B\u306B\u306F\u3001\u3053\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u3092\u7121\u52B9\u5316\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u306E\u4F5C\u6210\u306BJMC\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u306E\u958B\u59CB\u30A6\u30A3\u30B6\u30FC\u30C9\u3067\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u3092\u7121\u52B9\u306B\u3067\u304D\u307E\u3059\u3002\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u3092\u30B3\u30DE\u30F3\u30C9\u884C\u304B\u3089\u958B\u59CB\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001<a href="https://docs.oracle.com/javase/8/docs/technotes/tools/unix/java.html">-XX:FlightRecorderOptions</a>\u306E\u8A2D\u5B9A\u30D1\u30E9\u30E1\u30FC\u30BF\u3092\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002
# {0} is an event type name
RulesToolkit_RULE_REQUIRES_EVENTS=\u3053\u306E\u30EB\u30FC\u30EB\u3067\u306F\u3001\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u304B\u3089\u30A4\u30D9\u30F3\u30C8\u3092\u4F7F\u7528\u3067\u304D\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059: {0}\u3002
# {0} is a rule name, {1} is one or more event type names
RulesToolkit_RULE_REQUIRES_EVENTS_LONG={0}\u30EB\u30FC\u30EB\u3067\u306F\u3001\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u304B\u3089\u30A4\u30D9\u30F3\u30C8\u3092\u4F7F\u7528\u3067\u304D\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059: {1}\u3002<p>\u3053\u308C\u3089\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u304C\u8A18\u9332\u4E2D\u306B\u7121\u52B9\u5316\u3055\u308C\u305F\u304B\u3001\u30A4\u30D9\u30F3\u30C8\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u3053\u3068\u304C\u8D77\u3053\u3089\u306A\u304B\u3063\u305F\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u671F\u9593\u3084\u3057\u304D\u3044\u5024\u306A\u3069\u306E\u30A4\u30D9\u30F3\u30C8\u8A2D\u5B9A\u306B\u3088\u3063\u3066\u3001\u4E00\u90E8\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u767A\u884C\u3055\u308C\u306A\u304F\u306A\u308B\u5834\u5408\u3082\u3042\u308A\u307E\u3059\u3002\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u306E\u4F5C\u6210\u306BJMC\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u306E\u958B\u59CB\u30A6\u30A3\u30B6\u30FC\u30C9\u3067\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u3092\u6709\u52B9\u5316\u3057\u3066\u69CB\u6210\u3067\u304D\u307E\u3059\u3002\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u3092\u30B3\u30DE\u30F3\u30C9\u884C\u304B\u3089\u958B\u59CB\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001<a href="https://docs.oracle.com/javase/8/docs/technotes/tools/unix/java.html">-XX:FlightRecorderOptions</a>\u306E\u8A2D\u5B9A\u30D1\u30E9\u30E1\u30FC\u30BF\u3092\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002
# {0} is an event type name
RulesToolkit_RULE_REQUIRES_EVENT_TYPE=\u3053\u306E\u30EB\u30FC\u30EB\u3067\u306F\u3001\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u304C\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059: {0}\u3002
# {0} is a rule name, {1} is one or more event type names
RulesToolkit_RULE_REQUIRES_EVENT_TYPE_LONG={0}\u30EB\u30FC\u30EB\u3067\u306F\u3001\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u304C\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059: {1}\u3002<p>\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u306E\u4F5C\u6210\u306BJMC\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u306E\u958B\u59CB\u30A6\u30A3\u30B6\u30FC\u30C9\u3067\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u3092\u6709\u52B9\u306B\u3067\u304D\u307E\u3059\u3002\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u3092\u30B3\u30DE\u30F3\u30C9\u884C\u304B\u3089\u958B\u59CB\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001<a href="https://docs.oracle.com/javase/8/docs/technotes/tools/unix/java.html">-XX:FlightRecorderOptions</a>\u306E\u8A2D\u5B9A\u30D1\u30E9\u30E1\u30FC\u30BF\u3092\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002
# {0} is a rule name, {1} is one or more event type names
RulesToolkit_RULE_REQUIRES_SOME_EVENTS={0}\u30EB\u30FC\u30EB\u3067\u306F\u3001\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u306E\u5C11\u306A\u304F\u3068\u30821\u3064\u304B\u3089\u30A4\u30D9\u30F3\u30C8\u3092\u4F7F\u7528\u3067\u304D\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059: {1}\u3002
# {0} is one or more event type names
RulesToolkit_RULE_RECOMMENDS_EVENTS=\u30EB\u30FC\u30EB\u306E\u7CBE\u5EA6\u3092\u4E0A\u3052\u305F\u308A\u3001\u3055\u3089\u306B\u8ABF\u67FB\u3092\u884C\u3046\u305F\u3081\u306B\u3088\u308A\u8A73\u7D30\u306A\u60C5\u5831\u3092\u53D6\u5F97\u3057\u305F\u308A\u3059\u308B\u306B\u306F\u3001\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u3092\u6709\u52B9\u5316\u3059\u308B\u3053\u3068\u3092\u304A\u85A6\u3081\u3057\u307E\u3059: {0}\u3002
RulesToolkit_TOO_FEW_EVENTS=\u30A4\u30D9\u30F3\u30C8\u304C\u5C11\u306A\u3059\u304E\u308B\u305F\u3081\u7D50\u679C\u3092\u8A08\u7B97\u3067\u304D\u307E\u305B\u3093

Result_SHORT_RECORDING=\u3053\u306E\u8A18\u9332\u306E\u9577\u3055\u306F{0}\u3057\u304B\u3042\u308A\u307E\u305B\u3093\u3002\u30EB\u30FC\u30EB\u306E\u7CBE\u5EA6\u3092\u4E0A\u3052\u308B\u306B\u306F\u3001{1}\u3088\u308A\u9577\u3044\u8A18\u9332\u306E\u4F5C\u6210\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002

Severity_INFORMATION=\u60C5\u5831
Severity_NOT_APPLICABLE=\u9069\u7528\u3067\u304D\u307E\u305B\u3093
Severity_OK=OK
Severity_WARNING=\u8B66\u544A

ItemTreeToolkit_BREAKDOWN_HEADER_LAYERS=<b>\u30D6\u30EC\u30FC\u30AF\u30C0\u30A6\u30F3(\u30EC\u30A4\u30E4\u30FC):</b><br>
ItemTreeToolkit_BREAKDOWN_HEADER_MAX_DURATION_EVENT_CHAIN=<b>\u30D6\u30EC\u30FC\u30AF\u30C0\u30A6\u30F3(\u6700\u5927\u671F\u9593\u30A4\u30D9\u30F3\u30C8\u9023\u9396):</b><br>
ItemTreeToolkit_BREAKDOWN_LAYER_CAPTION=\u30EC\u30A4\u30E4\u30FC{0}:<br>
