<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!--
   Copyright (c) 2018, Oracle and/or its affiliates. All rights reserved.
   Licensed under the Universal Permissive License v 1.0 as shown at http://oss.oracle.com/licenses/upl.
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="zh-cn" lang="zh-cn">
<head><meta http-equiv="Content-Type" content="text/html; charset=us-ascii" />
<meta name="DC.Type" content="task" />
<meta name="DC.Title" content="&#21551;&#21160;&#39134;&#34892;&#35760;&#24405;" />
<meta name="abstract" content="&#36890;&#36807;&#23558;&#39134;&#34892;&#35760;&#24405;&#22120;&#25554;&#20214;&#36830;&#25509;&#21040; JVM &#21487;&#20197;&#21551;&#21160;&#39134;&#34892;&#35760;&#24405;&#12290;&#39134;&#34892;&#35760;&#24405;&#22120;&#25554;&#20214;&#22312; JVM &#19978;&#21551;&#21160; JFR &#36816;&#34892;&#26102;&#24341;&#25806;&#65292;&#24182;&#21019;&#24314;&#35760;&#24405;&#25991;&#20214;&#12290;" />
<meta name="description" content="&#36890;&#36807;&#23558;&#39134;&#34892;&#35760;&#24405;&#22120;&#25554;&#20214;&#36830;&#25509;&#21040; JVM &#21487;&#20197;&#21551;&#21160;&#39134;&#34892;&#35760;&#24405;&#12290;&#39134;&#34892;&#35760;&#24405;&#22120;&#25554;&#20214;&#22312; JVM &#19978;&#21551;&#21160; JFR &#36816;&#34892;&#26102;&#24341;&#25806;&#65292;&#24182;&#21019;&#24314;&#35760;&#24405;&#25991;&#20214;&#12290;" />
<meta name="DC.Format" content="XHTML" />
<meta name="DC.Identifier" content="GUID-4B13023D-6AFA-4563-8532-74871DE29B62" />
<meta name="DC.Language" content="zh-CN" />

<meta http-equiv="Content-Style-Type" content="text/css" />
<meta http-equiv="Content-Script-Type" content="text/javascript" />
<title>&#21551;&#21160;&#39134;&#34892;&#35760;&#24405;</title>

<meta name="doctitle" content="&#21551;&#21160;&#39134;&#34892;&#35760;&#24405;&#xA;" />
<meta name="robots" content="noarchive" />
<link rel="copyright" href="http://oss.oracle.com/licenses/upl" title="&#29256;&#26435;&#25152;&#26377;" type="text/html" />

<link rel="contents" href="toc.htm" title="&#30446;&#24405;" type="text/html" />
<link rel="prev" href="GUID-953292B2-45D3-4842-9656-DAE88D239BA6.htm" title="&#19978;&#19968;&#39029;" type="text/html" />
<link rel="next" href="GUID-41C663D6-F745-4062-BD32-6F7F2BC001BA.htm" title="&#19979;&#19968;&#39029;" type="text/html" />
</head>
<body>
<div class="zz-skip-header"><a href="#BEGIN">&#36716;&#33267;&#20027;&#35201;&#20869;&#23481;</a></div>
<table class="simple oac_no_warn" summary="" cellspacing="0" cellpadding="0" width="100%">
<col width="86%" /><col width="*" /><tr valign="bottom">
<td></td>


<td align="center">
<a href="GUID-953292B2-45D3-4842-9656-DAE88D239BA6.htm">
<img src="./dcommon/gifs/leftnav.gif" alt="&#19978;&#19968;&#39029;" /><br />
<span class="icon">&#19978;&#19968;&#39029;</span>
</a>
</td>
<td align="center">
<a href="GUID-41C663D6-F745-4062-BD32-6F7F2BC001BA.htm">
<img src="./dcommon/gifs/rightnav.gif" alt="&#19979;&#19968;&#39029;" /><br />
<span class="icon">&#19979;&#19968;&#39029;</span>
</a>
</td>
<td> </td>


</tr>
</table><div class="ind"><a id="GUID-4B13023D-6AFA-4563-8532-74871DE29B62" name="GUID-4B13023D-6AFA-4563-8532-74871DE29B62"></a><!-- End Header -->
<h1 id="JMCOH-GUID-4B13023D-6AFA-4563-8532-74871DE29B62" class="sect1">&#21551;&#21160;&#39134;&#34892;&#35760;&#24405;</h1>
<div><p>&#36890;&#36807;&#23558;&#39134;&#34892;&#35760;&#24405;&#22120;&#25554;&#20214;&#36830;&#25509;&#21040; JVM &#21487;&#20197;&#21551;&#21160;&#39134;&#34892;&#35760;&#24405;&#12290;&#39134;&#34892;&#35760;&#24405;&#22120;&#25554;&#20214;&#22312; JVM &#19978;&#21551;&#21160; JFR &#36816;&#34892;&#26102;&#24341;&#25806;&#65292;&#24182;&#21019;&#24314;&#35760;&#24405;&#25991;&#20214;&#12290;</p>
<div class="section">
         <p>&#35201;&#21551;&#21160;&#39134;&#34892;&#35760;&#24405;&#65292;&#35831;&#25191;&#34892;&#20197;&#19979;&#25805;&#20316;&#65306;</p>

      </div>
<!-- class="section" -->
<ol><li class="stepexpand"><span>&#22312; JVM &#27983;&#35272;&#22120;&#20013;&#21491;&#38190;&#21333;&#20987; JVM&#65292;&#24182;&#36873;&#25321;<span class="bold">&#21551;&#21160;&#39134;&#34892;&#35760;&#24405;</span>&#12290;</span></li>
<li class="stepexpand"><span>&#36890;&#36807;&#21333;&#20987;<span class="bold">&#27983;&#35272;</span>&#25353;&#38062;&#36873;&#25321;&#35760;&#24405;&#30340;&#36335;&#24452;&#21644;&#25991;&#20214;&#21517;&#12290;</span></li>
<li class="stepexpand"><span>&#25351;&#23450;&#35760;&#24405;&#30340;&#21517;&#31216;&#12290;</span></li>
<li class="stepexpand"><span>&#36873;&#25321;&#35760;&#24405;&#30340;&#31867;&#22411;&#12290;&#21487;&#20197;&#20351;&#29992;&#20197;&#19979;&#36873;&#39033;&#65306;</span><div>
               <ul style="list-style-type: disc;"><li>
                     <p><span class="bold">&#22266;&#23450;&#26102;&#38388;&#35760;&#24405;</span>&#65306;&#20351;&#29992;<span class="bold">&#35760;&#24405;&#26102;&#38388;</span>&#23383;&#27573;&#20013;&#25351;&#23450;&#30340;&#22266;&#23450;&#25345;&#32493;&#26102;&#38388;&#21019;&#24314;&#35760;&#24405;&#12290;JFR &#23558;&#22312;&#22266;&#23450;&#25345;&#32493;&#26102;&#38388;&#20869;&#25910;&#38598;&#20107;&#20214;&#65292;&#28982;&#21518;&#23558;&#35760;&#24405;&#36716;&#20648;&#21040;&#25351;&#23450;&#25991;&#20214;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#36830;&#32493;&#35760;&#24405;</span>&#65306;&#21019;&#24314;&#36830;&#32493;&#36816;&#34892;&#30340;&#35760;&#24405;&#12290;JFR &#23558;&#25910;&#38598;&#20107;&#20214;&#24182;&#23558;&#25968;&#25454;&#20889;&#20837;&#21040;&#20840;&#23616;&#32531;&#20914;&#21306;&#12290;&#24403;&#20840;&#23616;&#32531;&#20914;&#21306;&#22635;&#28385;&#26102;&#65292;&#23558;&#25918;&#24323;&#26368;&#26089;&#30340;&#25968;&#25454;&#12290;&#27599;&#24403;&#35831;&#27714;&#36716;&#20648;&#26102;&#65292;&#25110;&#32773;&#24403;&#35268;&#21017;&#35302;&#21457;&#36716;&#20648;&#26102;&#65292;&#24403;&#21069;&#20301;&#20110;&#32531;&#20914;&#21306;&#20013;&#30340;&#25968;&#25454;&#37117;&#21487;&#20889;&#20837;&#21040;&#25351;&#23450;&#25991;&#20214;&#12290;&#23545;&#20110;&#27492;&#31867;&#22411;&#30340;&#35760;&#24405;&#65292;&#21487;&#20197;&#20351;&#29992;<span class="bold">&#26368;&#22823;&#22823;&#23567;</span>&#23383;&#27573;&#35774;&#32622;&#35201;&#22312;&#30913;&#30424;&#19978;&#20445;&#30041;&#30340;&#25968;&#25454;&#30340;&#26368;&#22823;&#20801;&#35768;&#22823;&#23567;&#65292;&#24182;&#20351;&#29992;<span class="bold">&#26368;&#22823;&#23384;&#27963;&#26102;&#38388;</span>&#23383;&#27573;&#35774;&#32622;&#20107;&#20214;&#30340;&#26368;&#22823;&#20801;&#35768;&#23384;&#27963;&#26102;&#38388;&#12290;&#36825;&#20123;&#20540;&#26159;&#36817;&#20284;&#20540;&#65292;&#22240;&#20026;&#26159;&#23545;&#23436;&#25972;&#25968;&#25454;&#22359;&#25191;&#34892;&#36716;&#20648;&#12290;</p>

                  </li>
</ul>

            </div></li>
<li class="stepexpand"><span>&#22312;<span class="bold">&#20107;&#20214;&#35774;&#32622;</span>&#19979;&#25289;&#21015;&#34920;&#20013;&#36873;&#25321;&#39134;&#34892;&#35760;&#24405;&#27169;&#26495;&#12290;&#27169;&#26495;&#23450;&#20041;&#35201;&#35760;&#24405;&#30340;&#20107;&#20214;&#12290;&#35201;&#31649;&#29702;&#27169;&#26495;&#65292;&#35831;&#21333;&#20987;<span class="bold">&#27169;&#26495;&#31649;&#29702;&#22120;</span>&#12290;&#26377;&#20851;&#20351;&#29992;&#27169;&#26495;&#30340;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;&#8220;&#31649;&#29702;&#39134;&#34892;&#35760;&#24405;&#27169;&#26495;&#8221;&#12290;</span><div>&#21333;&#20987;<span class="bold">&#23436;&#25104;</span>&#20197;&#24320;&#22987;&#35760;&#24405;&#65292;&#25110;&#32773;&#21333;&#20987;<span class="bold">&#19979;&#19968;&#27493;</span>&#20197;&#20462;&#25913;&#22312;&#25152;&#36873;&#27169;&#26495;&#20013;&#23450;&#20041;&#30340;&#20107;&#20214;&#36873;&#39033;&#12290;</div></li>
<li class="stepexpand"><span>&#65288;&#21487;&#36873;&#65289;&#20462;&#25913;&#25152;&#36873;&#39134;&#34892;&#35760;&#24405;&#27169;&#26495;&#30340;&#20107;&#20214;&#36873;&#39033;&#12290;</span><div>&#21333;&#20987;<span class="bold">&#23436;&#25104;</span>&#20197;&#24320;&#22987;&#35760;&#24405;&#65292;&#25110;&#32773;&#21333;&#20987;<span class="bold">&#19979;&#19968;&#27493;</span>&#20197;&#20462;&#25913;&#22312;&#25152;&#36873;&#27169;&#26495;&#20013;&#23450;&#20041;&#30340;&#20107;&#20214;&#35814;&#32454;&#20449;&#24687;&#12290;</div></li>
<li class="stepexpand"><span>&#65288;&#21487;&#36873;&#65289;&#20462;&#25913;&#25152;&#36873;&#39134;&#34892;&#35760;&#24405;&#27169;&#26495;&#30340;&#20107;&#20214;&#35814;&#32454;&#20449;&#24687;&#12290;&#20107;&#20214;&#35814;&#32454;&#20449;&#24687;&#23450;&#20041;&#26159;&#21542;&#24212;&#22312;&#35760;&#24405;&#20013;&#21253;&#21547;&#20107;&#20214;&#12290;&#23545;&#20110;&#26576;&#20123;&#20107;&#20214;&#65292;&#24744;&#36824;&#21487;&#20197;&#23450;&#20041;&#26159;&#21542;&#24212;&#23558;&#22534;&#26632;&#36319;&#36394;&#38468;&#21152;&#21040;&#20107;&#20214;&#65292;&#25351;&#23450;&#25345;&#32493;&#26102;&#38388;&#38408;&#20540;&#65288;&#36866;&#29992;&#20110;<span class="italic">&#25345;&#32493;&#26102;&#38388;&#20107;&#20214;</span>&#65289;&#21644;&#35831;&#27714;&#26102;&#27573;&#65288;&#36866;&#29992;&#20110;<span class="italic">&#21487;&#35831;&#27714;&#30340;&#20107;&#20214;</span>&#65289;&#12290;</span><div>&#22914;&#26524;&#35201;&#20462;&#25913;&#21069;&#38754;&#27493;&#39588;&#20013;&#35774;&#32622;&#30340;&#20219;&#20309;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;<span class="bold">&#36820;&#22238;</span>&#12290;&#21333;&#20987;<span class="bold">&#23436;&#25104;</span>&#20197;&#24320;&#22987;&#35760;&#24405;&#12290;</div></li>
</ol>
<div class="section">
         <p>&#24403;&#24320;&#22987;&#22266;&#23450;&#26102;&#38388;&#35760;&#24405;&#26102;&#65292;&#20250;&#22312;&#8220;&#36827;&#24230;&#26597;&#30475;&#8221;&#20013;&#26174;&#31034;&#35813;&#35760;&#24405;&#12290;&#35201;&#25171;&#24320;&#8220;&#36827;&#24230;&#26597;&#30475;&#8221;&#65292;&#35831;&#25171;&#24320;<span class="bold">&#31383;&#21475;</span>&#33756;&#21333;&#65292;&#36873;&#25321;<span class="bold">&#26174;&#31034;&#35270;&#22270;</span>&#65292;&#28982;&#21518;&#36873;&#25321;<span class="bold">&#36827;&#24230;&#26597;&#30475;</span>&#12290;</p>

         <p>&#35201;&#26597;&#30475; JVM &#25152;&#26377;&#27491;&#22312;&#36816;&#34892;&#30340;&#35760;&#24405;&#65288;&#21253;&#25324;&#36830;&#32493;&#35760;&#24405;&#65289;&#65292;&#35831;&#22312; JVM &#27983;&#35272;&#22120;&#20013;&#23637;&#24320;&#25152;&#38656;&#36830;&#25509;&#65292;&#28982;&#21518;&#23637;&#24320;<span class="bold">&#39134;&#34892;&#35760;&#24405;&#22120;</span>&#33410;&#28857;&#12290;&#22914;&#26524;&#21491;&#38190;&#21333;&#20987;&#27491;&#22312;&#36816;&#34892;&#30340;&#35760;&#24405;&#65292;&#24744;&#21487;&#20197;&#20351;&#29992;&#19979;&#21015;&#36873;&#39033;&#65306;</p>

         <ul style="list-style-type: disc;"><li>
               <p><span class="bold">&#36716;&#20648;</span>&#65306;&#25171;&#24320;&#8220;&#36716;&#20648;&#35760;&#24405;&#8221;&#31383;&#21475;&#20197;&#21019;&#24314;&#20174;&#20840;&#23616;&#32531;&#20914;&#21306;&#20013;&#30340;&#24403;&#21069;&#20107;&#20214;&#21040;&#35760;&#24405;&#25991;&#20214;&#30340;&#36716;&#20648;&#12290;&#26377;&#20851;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;&#65306;&#36716;&#20648;&#27491;&#22312;&#36816;&#34892;&#30340;&#39134;&#34892;&#35760;&#24405;&#12290;</p>

            </li>
<li>
               <p><span class="bold">&#32534;&#36753;</span>&#65306;&#25171;&#24320;&#19982;&#21551;&#21160;&#39134;&#34892;&#35760;&#24405;&#21521;&#23548;&#30456;&#20284;&#30340;&#32534;&#36753;&#39134;&#34892;&#35760;&#24405;&#21521;&#23548;&#12290;</p>

            </li>
<li>
               <p><span class="bold">&#20572;&#27490;</span>&#65306;&#20572;&#27490;&#35760;&#24405;&#65292;&#20294;&#23558;&#25910;&#38598;&#30340;&#25968;&#25454;&#20445;&#30041;&#22312;&#20840;&#23616;&#32531;&#20914;&#21306;&#20013;&#12290;&#20572;&#27490;&#30340;&#35760;&#24405;&#23558;&#20445;&#30041;&#22312; JVM &#30340;&#35760;&#24405;&#21015;&#34920;&#20013;&#12290;</p>

            </li>
<li>
               <p><span class="bold">&#20851;&#38381;</span>&#65306;&#23558;&#25910;&#38598;&#30340;&#25968;&#25454;&#20174;&#20840;&#23616;&#32531;&#20914;&#21306;&#36716;&#20648;&#21040;&#35760;&#24405;&#25991;&#20214;&#24182;&#20572;&#27490;&#35760;&#24405;&#12290;</p>

            </li>
</ul>

      </div>
<!-- class="section" -->
</div>
</div><!-- class="ind" --><!-- Start Footer -->
<table class="simple oac_no_warn" summary="" cellspacing="0" cellpadding="0" width="100%">
<col width="86%" /><col width="*" /><tr valign="bottom">
<td><a href="http://oss.oracle.com/licenses/upl"><br />
<span class="copyrightlogo">&#29256;&#26435;&#25152;&#26377;&#160;&#169;&#160;2018, Oracle&#160;&#21644;/&#25110;&#20854;&#38468;&#23646;&#20844;&#21496;&#12290;&#160;&#20445;&#30041;&#25152;&#26377;&#26435;&#21033;&#12290;</span></a></td>


<td align="center">
<a href="GUID-953292B2-45D3-4842-9656-DAE88D239BA6.htm">
<img src="./dcommon/gifs/leftnav.gif" alt="&#19978;&#19968;&#39029;" /><br />
<span class="icon">&#19978;&#19968;&#39029;</span>
</a>
</td>
<td align="center">
<a href="GUID-41C663D6-F745-4062-BD32-6F7F2BC001BA.htm">
<img src="./dcommon/gifs/rightnav.gif" alt="&#19979;&#19968;&#39029;" /><br />
<span class="icon">&#19979;&#19968;&#39029;</span>
</a>
</td>
<td> </td>


</tr>
</table>

<!-- class="footer" -->
</body>
</html>