<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!--
   Copyright (c) 2018, Oracle and/or its affiliates. All rights reserved.
   Licensed under the Universal Permissive License v 1.0 as shown at http://oss.oracle.com/licenses/upl.
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="zh-cn" lang="zh-cn">
<head><meta http-equiv="Content-Type" content="text/html; charset=us-ascii" />
<meta name="DC.Type" content="task" />
<meta name="DC.Title" content="&#20351;&#29992;&#35302;&#21457;&#35268;&#21017;" />
<meta name="abstract" content="&#20197;&#28784;&#33394;&#26174;&#31034;&#30340;&#35268;&#21017;&#22312;&#30417;&#35270;&#30340; JVM &#20013;&#19981;&#21487;&#29992;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#20572;&#29992;&#25152;&#26377;&#35268;&#21017;&#12290;&#35201;&#28608;&#27963;&#26576;&#20010;&#35268;&#21017;&#65292;&#35831;&#36873;&#20013;&#35813;&#35268;&#21017;&#26049;&#36793;&#30340;&#22797;&#36873;&#26694;&#12290;" />
<meta name="description" content="&#20197;&#28784;&#33394;&#26174;&#31034;&#30340;&#35268;&#21017;&#22312;&#30417;&#35270;&#30340; JVM &#20013;&#19981;&#21487;&#29992;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#20572;&#29992;&#25152;&#26377;&#35268;&#21017;&#12290;&#35201;&#28608;&#27963;&#26576;&#20010;&#35268;&#21017;&#65292;&#35831;&#36873;&#20013;&#35813;&#35268;&#21017;&#26049;&#36793;&#30340;&#22797;&#36873;&#26694;&#12290;" />
<meta name="DC.Format" content="XHTML" />
<meta name="DC.Identifier" content="GUID-18677545-5152-4688-8C51-4A1151361BB9" />
<meta name="DC.Language" content="zh-CN" />

<meta http-equiv="Content-Style-Type" content="text/css" />
<meta http-equiv="Content-Script-Type" content="text/javascript" />
<title>&#20351;&#29992;&#35302;&#21457;&#35268;&#21017;</title>

<meta name="doctitle" content="&#20351;&#29992;&#35302;&#21457;&#35268;&#21017;&#xA;" />
<meta name="robots" content="noarchive" />
<link rel="copyright" href="http://oss.oracle.com/licenses/upl" title="&#29256;&#26435;&#25152;&#26377;" type="text/html" />

<link rel="contents" href="toc.htm" title="&#30446;&#24405;" type="text/html" />
<link rel="prev" href="GUID-DAB13FDA-9430-4457-BFF3-04F9DC0E3977.htm" title="&#19978;&#19968;&#39029;" type="text/html" />
<link rel="next" href="GUID-D475ABB1-DE41-4A24-8BB8-A058FDDC6645.htm" title="&#19979;&#19968;&#39029;" type="text/html" />
</head>
<body>
<div class="zz-skip-header"><a href="#BEGIN">&#36716;&#33267;&#20027;&#35201;&#20869;&#23481;</a></div>
<table class="simple oac_no_warn" summary="" cellspacing="0" cellpadding="0" width="100%">
<col width="86%" /><col width="*" /><tr valign="bottom">
<td></td>


<td align="center">
<a href="GUID-DAB13FDA-9430-4457-BFF3-04F9DC0E3977.htm">
<img src="./dcommon/gifs/leftnav.gif" alt="&#19978;&#19968;&#39029;" /><br />
<span class="icon">&#19978;&#19968;&#39029;</span>
</a>
</td>
<td align="center">
<a href="GUID-D475ABB1-DE41-4A24-8BB8-A058FDDC6645.htm">
<img src="./dcommon/gifs/rightnav.gif" alt="&#19979;&#19968;&#39029;" /><br />
<span class="icon">&#19979;&#19968;&#39029;</span>
</a>
</td>
<td> </td>


</tr>
</table><div class="ind"><a id="GUID-18677545-5152-4688-8C51-4A1151361BB9" name="GUID-18677545-5152-4688-8C51-4A1151361BB9"></a><!-- End Header -->
<h1 id="JMCOH-GUID-18677545-5152-4688-8C51-4A1151361BB9" class="sect1">&#20351;&#29992;&#35302;&#21457;&#35268;&#21017;</h1>
<div><p>&#20197;&#28784;&#33394;&#26174;&#31034;&#30340;&#35268;&#21017;&#22312;&#30417;&#35270;&#30340; JVM &#20013;&#19981;&#21487;&#29992;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#20572;&#29992;&#25152;&#26377;&#35268;&#21017;&#12290;&#35201;&#28608;&#27963;&#26576;&#20010;&#35268;&#21017;&#65292;&#35831;&#36873;&#20013;&#35813;&#35268;&#21017;&#26049;&#36793;&#30340;&#22797;&#36873;&#26694;&#12290;</p>
<div class="section">
         <p>&#35201;&#28155;&#21152;&#26032;&#35302;&#21457;&#35268;&#21017;&#65292;&#35831;&#25191;&#34892;&#20197;&#19979;&#25805;&#20316;&#65306;</p>

      </div>
<!-- class="section" -->
<ol><li class="stepexpand"><span>&#22312;<span class="bold">&#35302;&#21457;&#35268;&#21017;</span>&#38754;&#26495;&#19978;&#65292;&#21333;&#20987;<span class="bold">&#28155;&#21152;</span>&#12290;</span></li>
<li class="stepexpand"><span>&#22312;<span class="bold">&#28155;&#21152;&#26032;&#35268;&#21017;</span>&#21521;&#23548;&#30340;&#31532;&#19968;&#27493;&#20013;&#65292;&#36873;&#25321;&#29992;&#20110;&#35302;&#21457;&#35268;&#21017;&#30340;&#23646;&#24615;&#12290;&#21333;&#20987;<span class="bold">&#19979;&#19968;&#27493;</span>&#12290;</span></li>
<li class="stepexpand"><span>&#35774;&#32622;&#35302;&#21457;&#35268;&#21017;&#30340;&#26465;&#20214;&#12290;&#27492;&#27493;&#39588;&#21253;&#21547;&#20197;&#19979;&#35774;&#32622;&#65306;</span><div>
               <ul style="list-style-type: disc;"><li>
                     <p><span class="bold">&#26368;&#22823;&#35302;&#21457;&#20540;</span>&#65288;&#23545;&#20110;&#25968;&#20540;&#23646;&#24615;&#65289;&#25110;<span class="bold">&#21305;&#37197;&#23383;&#31526;&#20018;</span>&#65288;&#23545;&#20110;&#38750;&#25968;&#20540;&#23646;&#24615;&#65289;&#65306;&#25351;&#23450;&#29992;&#20110;&#35302;&#21457;&#35268;&#21017;&#30340;&#36873;&#23450;&#23646;&#24615;&#30340;&#26368;&#22823;&#20540;&#25110;&#21305;&#37197;&#23383;&#31526;&#20018;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#25345;&#32493;&#26102;&#38388;</span>&#65306;&#25351;&#23450;&#26465;&#20214;&#24517;&#39035;&#20445;&#25345;&#20026;&#8220;&#30495;&#8221;&#20197;&#35302;&#21457;&#35268;&#21017;&#30340;&#25345;&#32493;&#26102;&#38388;&#65288;&#20197;&#31186;&#20026;&#21333;&#20301;&#65289;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#38480;&#21046;&#26102;&#38388;&#27573;</span>&#65306;&#25351;&#23450;&#21487;&#20197;&#25509;&#19979;&#26469;&#20877;&#27425;&#35302;&#21457;&#35268;&#21017;&#25152;&#35201;&#32463;&#36807;&#30340;&#26368;&#30701;&#26102;&#38388;&#38271;&#24230;&#65288;&#20197;&#31186;&#20026;&#21333;&#20301;&#65289;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#28385;&#36275;&#26465;&#20214;&#26102;&#35302;&#21457;</span>&#65306;&#36873;&#25321;&#26159;&#21542;&#22312;&#28385;&#36275;&#26465;&#20214;&#26102;&#35302;&#21457;&#35268;&#21017;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#35302;&#21457;&#20540;&#35774;&#32622;&#20026; 100&#65292;&#21017;&#22312;&#20540;&#20174;&#23567;&#20110; 100 &#26356;&#25913;&#20026; 100 &#25110;&#26356;&#39640;&#20540;&#26102;&#35302;&#21457;&#35268;&#21017;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#26681;&#25454;&#26465;&#20214;&#24674;&#22797;&#26102;&#35302;&#21457;</span>&#65306;&#36873;&#25321;&#26159;&#21542;&#22312;&#19981;&#20877;&#28385;&#36275;&#26465;&#20214;&#26102;&#35302;&#21457;&#35268;&#21017;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#35302;&#21457;&#20540;&#35774;&#32622;&#20026; 100&#65292;&#21017;&#22312;&#20540;&#20174; 100 &#25110;&#26356;&#39640;&#20540;&#26356;&#25913;&#20026;&#23567;&#20110; 100 &#30340;&#20540;&#26102;&#35302;&#21457;&#35268;&#21017;&#12290;</p>

                  </li>
</ul>

               <p>&#21333;&#20987;<span class="bold">&#19979;&#19968;&#27493;</span>&#12290;</p>

            </div></li>
<li class="stepexpand"><span>&#36873;&#25321;&#24076;&#26395;&#22312;&#35268;&#21017;&#35302;&#21457;&#26102;&#21457;&#29983;&#30340;&#25805;&#20316;&#12290;&#26681;&#25454;&#25805;&#20316;&#65292;&#21487;&#33021;&#38656;&#35201;&#25552;&#20379;&#20854;&#20182;&#25968;&#25454;&#12290;&#21487;&#29992;&#30340;&#25805;&#20316;&#21253;&#25324;&#65306;</span><div>
               <ul style="list-style-type: disc;"><li>
                     <p><span class="bold">&#24212;&#29992;&#31243;&#24207;&#39044;&#35686;</span>&#65306;&#22312; JDK Mission Control &#20013;&#26174;&#31034;&#39044;&#35686;&#23545;&#35805;&#26694;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#25511;&#21046;&#21488;&#36755;&#20986;</span>&#65306;&#23558;&#36890;&#30693;&#21457;&#36865;&#21040;&#21551;&#21160; JMX &#25511;&#21046;&#21488;&#30340;&#25511;&#21046;&#21488;&#65288;&#21629;&#20196;&#25552;&#31034;&#65289;&#30340;&#26631;&#20934;&#36755;&#20986; (stdout)&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#36716;&#20648;&#39134;&#34892;&#35760;&#24405;</span>&#65306;&#23558;&#26368;&#21518;&#25351;&#23450;&#26102;&#27573;&#65288;&#20197;&#31186;&#20026;&#21333;&#20301;&#65289;&#30340;&#39134;&#34892;&#35760;&#24405;&#20013;&#21487;&#29992;&#30340;&#20840;&#37096;&#25968;&#25454;&#36716;&#20648;&#21040; JFR &#25991;&#20214;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">HPROF &#36716;&#20648;</span>&#65306;&#21551;&#21160;&#21040;&#25351;&#23450; HPROF &#25991;&#20214;&#30340;&#20869;&#23384;&#36716;&#20648;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#35843;&#29992;&#35786;&#26029;&#21629;&#20196;</span>&#65306;&#35843;&#29992;&#25351;&#23450;&#30340;&#35786;&#26029;&#21629;&#20196;&#65292;&#36890;&#36807;&#38468;&#21152;&#25110;&#35206;&#30422;&#32467;&#26524;&#23558;&#36755;&#20986;&#35760;&#24405;&#21040;&#25351;&#23450;&#30340;&#26085;&#24535;&#25991;&#20214;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#35760;&#24405;&#21040;&#25991;&#20214;</span>&#65306;&#23558;&#36890;&#30693;&#20889;&#20837;&#21040;&#25351;&#23450;&#30340;&#26085;&#24535;&#25991;&#20214;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#21457;&#36865;&#30005;&#23376;&#37038;&#20214;</span>&#65306;&#36890;&#36807;&#30005;&#23376;&#37038;&#20214;&#21457;&#36865;&#36890;&#30693;&#12290;&#21487;&#20197;&#37197;&#32622; SMTP &#26381;&#21153;&#22120;&#22320;&#22336;&#21644;&#31471;&#21475;&#12289;&#30005;&#23376;&#37038;&#20214;&#30340;&#25910;&#20214;&#20154;&#21644;&#21457;&#20214;&#20154;&#24182;&#25552;&#20379; SSL &#36523;&#20221;&#35777;&#26126;&#65288;&#22914;&#26524;&#38656;&#35201;&#23433;&#20840;&#36830;&#25509;&#65289;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#21551;&#21160;&#36830;&#32493;&#39134;&#34892;&#35760;&#24405;</span>&#65306;&#21551;&#21160;&#36830;&#32493;&#39134;&#34892;&#35760;&#24405;&#12290;</p>

                  </li>
<li>
                     <p><span class="bold">&#21551;&#21160;&#38480;&#26102;&#39134;&#34892;&#35760;&#24405;</span>&#65306;&#21551;&#21160;&#39134;&#34892;&#35760;&#24405;&#65292;&#22312;&#25351;&#23450;&#30340;&#26102;&#27573;&#65288;&#20197;&#31186;&#20026;&#21333;&#20301;&#65289;&#20043;&#21518;&#23558;&#32467;&#26524;&#36716;&#20648;&#21040; JFR &#25991;&#20214;&#20013;&#12290;</p>

                  </li>
</ul>

               <p>&#21333;&#20987;<span class="bold">&#19979;&#19968;&#27493;</span>&#20197;&#32487;&#32493;&#65292;&#25110;&#32773;&#21333;&#20987;<span class="bold">&#23436;&#25104;</span>&#20197;&#25353;&#21407;&#26679;&#28155;&#21152;&#35268;&#21017;&#12290;</p>

            </div></li>
<li class="stepexpand"><span>&#65288;&#21487;&#36873;&#65289;&#22914;&#26524;&#24076;&#26395;&#35268;&#21017;&#20165;&#22312;&#29305;&#23450;&#26085;&#26399;&#12289;&#27599;&#21608;&#30340;&#26143;&#26399;&#20960;&#25110;&#32773;&#27599;&#22825;&#30340;&#26102;&#38388;&#28608;&#27963;&#65292;&#21017;&#36873;&#25321;&#26102;&#38388;&#32422;&#26463;&#26465;&#20214;&#12290;&#21333;&#20987;<span class="bold">&#19979;&#19968;&#27493;</span>&#12290;</span></li>
<li class="stepexpand"><span>&#65288;&#21487;&#36873;&#65289;&#36873;&#25321;&#35268;&#21017;&#24212;&#35813;&#23646;&#20110;&#30340;&#32452;&#25110;&#32773;&#25351;&#23450;&#26032;&#32452;&#12290;&#25351;&#23450;&#35268;&#21017;&#30340;&#21517;&#31216;&#21644;&#35814;&#32454;&#30340;&#35828;&#26126;&#12290;</span><div>
               <p>&#21487;&#20197;&#36820;&#22238;&#21521;&#23548;&#20013;&#20219;&#24847;&#20197;&#21069;&#30340;&#27493;&#39588;&#20197;&#20462;&#25913;&#20219;&#24847;&#35774;&#32622;&#12290;&#21333;&#20987;<span class="bold">&#23436;&#25104;</span>&#21487;&#23558;&#35268;&#21017;&#28155;&#21152;&#21040;&#21015;&#34920;&#20013;&#12290;</p>

            </div></li>
</ol>
<div class="section">
         <p>&#35201;&#32534;&#36753;&#35268;&#21017;&#65292;&#35831;&#22312;<span class="bold">&#35302;&#21457;&#35268;&#21017;</span>&#38754;&#26495;&#20013;&#36873;&#25321;&#35813;&#35268;&#21017;&#12290;&#21491;&#20391;&#30340;<span class="bold">&#35268;&#21017;&#35814;&#32454;&#20449;&#24687;</span>&#38754;&#26495;&#26174;&#31034;&#19977;&#20010;&#23376;&#36873;&#39033;&#21345;&#65292;&#20854;&#20013;&#25552;&#20379;&#35302;&#21457;&#35268;&#21017;&#30340;&#23646;&#24615;&#21644;&#20540;&#12289;&#35268;&#21017;&#25152;&#35302;&#21457;&#30340;&#25805;&#20316;&#65292;&#20197;&#21450;&#24076;&#26395;&#20160;&#20040;&#26102;&#38388;&#28608;&#27963;&#35268;&#21017;&#30340;&#26102;&#38388;&#32422;&#26463;&#26465;&#20214;&#12290;</p>

         <p>&#35201;&#37325;&#21629;&#21517;&#35268;&#21017;&#65292;&#35831;&#22312;<span class="bold">&#35302;&#21457;&#35268;&#21017;</span>&#38754;&#26495;&#19978;&#36873;&#25321;&#35813;&#35268;&#21017;&#65292;&#28982;&#21518;&#21333;&#20987;<span class="bold">&#37325;&#21629;&#21517;</span>&#12290;&#25509;&#19979;&#26469;&#20026;&#35268;&#21017;&#25552;&#20379;&#26032;&#21517;&#31216;&#65292;&#28982;&#21518;&#21333;&#20987;<span class="bold">&#30830;&#23450;</span>&#12290;</p>

         <p>&#22914;&#26524;&#19981;&#24076;&#26395;&#35302;&#21457;&#35268;&#21017;&#65292;&#21017;&#21487;&#20197;&#22312;<span class="bold">&#35302;&#21457;&#35268;&#21017;</span>&#38754;&#26495;&#20013;&#21462;&#28040;&#36873;&#20013;&#35268;&#21017;&#26049;&#36793;&#30340;&#22797;&#36873;&#26694;&#26469;&#20572;&#29992;&#35813;&#35268;&#21017;&#12290;&#19981;&#36807;&#65292;&#22914;&#26524;&#24744;&#30830;&#23450;&#19981;&#20250;&#20877;&#27425;&#20351;&#29992;&#35813;&#35268;&#21017;&#65292;&#21017;&#21487;&#20197;&#36873;&#25321;&#35813;&#35268;&#21017;&#65292;&#28982;&#21518;&#21333;&#20987;<span class="bold">&#21024;&#38500;</span>&#20197;&#23558;&#20854;&#20174;&#21015;&#34920;&#20013;&#24443;&#24213;&#21024;&#38500;&#12290;</p>

         <p>&#35201;&#23558;&#19968;&#32452;&#35268;&#21017;&#23548;&#20986;&#21040; XML &#25991;&#20214;&#65292;&#35831;&#22312;<span class="bold">&#35302;&#21457;&#35268;&#21017;</span>&#38754;&#26495;&#20013;&#21333;&#20987;<span class="bold">&#23548;&#20986;</span>&#12290;&#25509;&#19979;&#26469;&#36873;&#25321;&#35201;&#23548;&#20986;&#30340;&#35268;&#21017;&#65292;&#25351;&#23450;&#25991;&#20214;&#21517;&#65292;&#28982;&#21518;&#21333;&#20987;<span class="bold">&#30830;&#23450;</span>&#12290;&#35201;&#20174; XML &#25991;&#20214;&#23548;&#20837;&#19968;&#32452;&#35268;&#21017;&#65292;&#35831;&#22312;<span class="bold">&#35302;&#21457;&#35268;&#21017;</span>&#38754;&#26495;&#20013;&#21333;&#20987;<span class="bold">&#23548;&#20837;</span>&#65292;&#36873;&#25321;&#25991;&#20214;&#65292;&#28982;&#21518;&#21333;&#20987;<span class="bold">&#30830;&#23450;</span>&#12290;</p>

         <p>&#35201;&#37325;&#32622;&#22238;&#40664;&#35748;&#30340;&#35268;&#21017;&#38598;&#65292;&#35831;&#22312;<span class="bold">&#35302;&#21457;&#35268;&#21017;</span>&#38754;&#26495;&#20013;&#21333;&#20987;<span class="bold">&#37325;&#32622;</span>&#24182;&#36827;&#34892;&#30830;&#35748;&#12290;&#36825;&#23558;&#35206;&#30422;&#25152;&#26377;&#35268;&#21017;&#24182;&#20351;&#29992;&#40664;&#35748;&#38598;&#26367;&#25442;&#23427;&#20204;&#12290;</p>

      </div>
<!-- class="section" -->
</div>
</div><!-- class="ind" --><!-- Start Footer -->
<table class="simple oac_no_warn" summary="" cellspacing="0" cellpadding="0" width="100%">
<col width="86%" /><col width="*" /><tr valign="bottom">
<td><a href="http://oss.oracle.com/licenses/upl"><br />
<span class="copyrightlogo">&#29256;&#26435;&#25152;&#26377;&#160;&#169;&#160;2018, Oracle&#160;&#21644;/&#25110;&#20854;&#38468;&#23646;&#20844;&#21496;&#12290;&#160;&#20445;&#30041;&#25152;&#26377;&#26435;&#21033;&#12290;</span></a></td>


<td align="center">
<a href="GUID-DAB13FDA-9430-4457-BFF3-04F9DC0E3977.htm">
<img src="./dcommon/gifs/leftnav.gif" alt="&#19978;&#19968;&#39029;" /><br />
<span class="icon">&#19978;&#19968;&#39029;</span>
</a>
</td>
<td align="center">
<a href="GUID-D475ABB1-DE41-4A24-8BB8-A058FDDC6645.htm">
<img src="./dcommon/gifs/rightnav.gif" alt="&#19979;&#19968;&#39029;" /><br />
<span class="icon">&#19979;&#19968;&#39029;</span>
</a>
</td>
<td> </td>


</tr>
</table>

<!-- class="footer" -->
</body>
</html>