#
#  Copyright (c) 2018, 2025, Oracle and/or its affiliates. All rights reserved.
#
#  DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.
#
#  The contents of this file are subject to the terms of either the Universal Permissive License 
#  v 1.0 as shown at https://oss.oracle.com/licenses/upl
#   
#  or the following license:
#   
#  Redistribution and use in source and binary forms, with or without modification, are permitted
#  provided that the following conditions are met:
#   
#  1. Redistributions of source code must retain the above copyright notice, this list of conditions
#  and the following disclaimer.
#   
#  2. Redistributions in binary form must reproduce the above copyright notice, this list of
#  conditions and the following disclaimer in the documentation and/or other materials provided with
#  the distribution.
#   
#  3. Neither the name of the copyright holder nor the names of its contributors may be used to
#  endorse or promote products derived from this software without specific prior written permission.
#
#  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR
#  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND
#  FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
#  CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
#  DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
#  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
#  WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY
#  WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
#
Preference_SHORT_RECORDING=\u8A18\u9332\u4E0B\u9650
Preference_SHORT_RECORDING_LONG=\u30EB\u30FC\u30EB\u304C\u6A5F\u80FD\u3059\u308B\u3046\u3048\u3067\u6709\u7528\u3068\u8003\u3048\u3089\u308C\u308B\u6700\u4F4E\u9650\u306E\u8A18\u9332\u306E\u9577\u3055\u3002

AllocationByClassRule_RULE_NAME=\u5272\u308A\u5F53\u3066\u3089\u308C\u305F\u30AF\u30E9\u30B9
# {mostAllocatedType} is a class name
AllocationByClassRule_TEXT_MESSAGE=\u6700\u3082\u5272\u308A\u5F53\u3066\u3089\u308C\u3066\u3044\u308B\u578B\u306F\u3001\u304A\u305D\u3089\u304F''{mostAllocatedType}''\u3067\u3001\u6B21\u306B\u3088\u3063\u3066\u6700\u3082\u983B\u7E41\u306B\u5272\u5F53\u3066\u3089\u308C\u3066\u3044\u307E\u3059: {allocationFrames}
AllocationByThreadRule_RULE_NAME=\u5272\u5F53\u3066\u30B9\u30EC\u30C3\u30C9
# {mostAllocatingThread} is a thread name
AllocationByThreadRule_TEXT_MESSAGE=\u6700\u3082\u591A\u304F\u306E\u5272\u5F53\u3066\u3092\u5B9F\u884C\u3057\u3066\u3044\u308B\u306E\u306F\u3001\u304A\u305D\u3089\u304F\u30B9\u30EC\u30C3\u30C9''{mostAllocatingThread}''\u306E\u6B21\u306E\u7B87\u6240\u3067\u3059: {allocationFrames}
AllocationRuleFactory_TEXT_CLASS_INFO_LONG=\u983B\u7E41\u306B\u5272\u308A\u5F53\u3066\u3089\u308C\u308B\u578B\u306F\u3001\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u524A\u6E1B\u3092\u8A66\u884C\u3059\u308B\u969B\u306E\u30B9\u30BF\u30FC\u30C8\u5730\u70B9\u3068\u3057\u3066\u6700\u9069\u3067\u3059\u3002\u6700\u3082\u983B\u51FA\u3059\u308B\u578B\u3092\u5272\u308A\u5F53\u3066\u3066\u3044\u308B\u7B87\u6240\u3092\u8ABF\u3079\u3001\u591A\u6570\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u540C\u3058\u547C\u51FA\u3057\u30D1\u30B9\u306B\u6CBF\u3063\u3066\u4F5C\u6210\u3055\u308C\u3066\u3044\u308B\u304B\u3069\u3046\u304B\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u6700\u3082\u983B\u7E41\u306B\u5229\u7528\u3055\u308C\u308B\u30D1\u30B9\u306E\u547C\u51FA\u3057\u3092\u6E1B\u3089\u3059\u3053\u3068\u3067\u3001\u4F5C\u6210\u3055\u308C\u308B\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u6570\u3092\u524A\u6E1B\u3059\u308B\u3088\u3046\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
AllocationRuleFactory_TEXT_THREAD_INFO_LONG=\u540C\u3058\u30B9\u30EC\u30C3\u30C9\u306B\u3088\u3063\u3066\u5B9F\u884C\u3055\u308C\u305F\u591A\u6570\u306E\u5272\u5F53\u3066\u306F\u3001\u30DE\u30EB\u30C1\u30B9\u30EC\u30C3\u30C9\u30FB\u30D7\u30ED\u30B0\u30E9\u30E0\u306E\u554F\u984C\u3092\u793A\u3057\u3066\u3044\u308B\u304B\u3082\u3057\u308C\u307E\u305B\u3093\u3002\u6700\u3082\u5272\u5F53\u3066\u7387\u306E\u9AD8\u3044\u30B9\u30EC\u30C3\u30C9\u306E\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u5272\u5F53\u3066\u7387\u306E\u6291\u5236\u307E\u305F\u306F\u30A2\u30AF\u30C6\u30A3\u30D6\u30FB\u30B9\u30EC\u30C3\u30C9\u9593\u3067\u306E\u5747\u8861\u5316\u304C\u53EF\u80FD\u304B\u3069\u3046\u304B\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ApplicationHaltsRule_HALTS_INFO_LIMIT=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u60C5\u5831\u5236\u9650
ApplicationHaltsRule_HALTS_INFO_LIMIT_DESC=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u306B\u304A\u3051\u308B\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u3068\u5B9F\u884C\u6642\u9593\u306E\u6BD4\u7387
ApplicationHaltsRule_HALTS_WARNING_LIMIT=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u8B66\u544A\u5236\u9650
ApplicationHaltsRule_HALTS_WARNING_LIMIT_DESC=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u306B\u304A\u3051\u308B\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u3068\u5B9F\u884C\u6642\u9593\u306E\u6BD4\u7387
ApplicationHaltsRule_HALTS_WINDOW_SIZE=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u306E\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
ApplicationHaltsRule_HALTS_WINDOW_SIZE_DESC=\u30EB\u30FC\u30EB\u306E\u8A55\u4FA1\u6642\u306B\u4F7F\u7528\u3055\u308C\u308B\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
# {0} is a concatenated string of event type ids
ApplicationHaltsRule_EXTRA_EVENT_TYPES=\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u3092\u6709\u52B9\u5316\u3059\u308B\u3068\u3001\u3053\u306E\u30EB\u30FC\u30EB\u306E\u7CBE\u5EA6\u304C\u5411\u4E0A\u3057\u307E\u3059: {0}
ApplicationHaltsRule_RULE_NAME=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62
ApplicationHaltsRule_RULE_TEXT=\u505C\u6B62\u306B\u3088\u308A\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u52B9\u7387\u306B\u5F71\u97FF\u304C\u3042\u308A\u307E\u3057\u305F
# {applicationHaltsRatio} is a percentage, {applicationsHaltsWindow} is a timerange, {nonGcApplicationHaltsRatio} is a percentage
ApplicationHaltsRule_RULE_TEXT_LONG={applicationsHaltsWindow}\u306E\u9593\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u3068\u5B9F\u884C\u6642\u9593\u306E\u6700\u3082\u9AD8\u3044\u6BD4\u7387\u306F{applicationHaltsRatio}\u3067\u3057\u305F\u3002\u305D\u306E\u505C\u6B62\u6642\u9593\u306E{nonGcApplicationHaltsRatio}\u306FGC\u4EE5\u5916\u306E\u7406\u7531\u304C\u539F\u56E0\u3067\u3057\u305F\u3002\u8A18\u9332\u5168\u4F53\u306B\u304A\u3051\u308B\u505C\u6B62\u7387\u306F{totalApplicationHaltsRatio}\u3067\u3057\u305F\u3002\u505C\u6B62\u6642\u9593\u306E\u5408\u8A08\u306E{totalNonGcApplicationHaltsRatio}\u306F\u3001GC\u4EE5\u5916\u306E\u7406\u7531\u304C\u539F\u56E0\u3067\u3057\u305F\u3002
ApplicationHaltsRule_RULE_TEXT_RECOMMENDATION=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u306E\u539F\u56E0\u306F\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3067\u3042\u308B\u3053\u3068\u304C\u591A\u3044\u3067\u3059\u304C\u3001\u904E\u5EA6\u306E\u30B9\u30EC\u30C3\u30C9\u30FB\u30C0\u30F3\u30D7\u3084\u30D2\u30FC\u30D7\u30FB\u30C0\u30F3\u30D7\u304C\u539F\u56E0\u306E\u5834\u5408\u3082\u3042\u308A\u307E\u3059\u3002VM\u64CD\u4F5C\u306E\u60C5\u5831\u3068\u3001\u53EF\u80FD\u306A\u5834\u5408\u306F\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u56FA\u6709\u306E\u60C5\u5831\u3092\u8ABF\u67FB\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ApplicationHaltsRule_RULE_TEXT_OK=\u505C\u6B62\u306B\u3088\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u52B9\u7387\u3078\u306E\u5F71\u97FF\u306F\u5927\u304D\u304F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
AutoboxingRule_RULE_NAME=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304B\u3089\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3078\u306E\u5909\u63DB
AutoboxingRule_AUTOBOXING_RATIO_INFO_LIMIT=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304B\u3089\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3078\u306E\u5909\u63DB\u306E\u5272\u5F53\u3066\u7387\u60C5\u5831\u5236\u9650
AutoboxingRule_AUTOBOXING_RATIO_INFO_LIMIT_DESC=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304B\u3089\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3078\u306E\u5909\u63DB\u306B\u3088\u308A\u751F\u3058\u305F\u5272\u5F53\u3066\u3068\u3001\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u5408\u8A08\u5272\u5F53\u3066\u3092\u6BD4\u8F03\u3057\u305F\u3068\u304D\u306E\u6BD4\u7387\u3002
AutoboxingRule_AUTOBOXING_RATIO_WARNING_LIMIT=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304B\u3089\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3078\u306E\u5909\u63DB\u306E\u5272\u5F53\u3066\u7387\u8B66\u544A\u5236\u9650
AutoboxingRule_AUTOBOXING_RATIO_WARNING_LIMIT_DESC=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304B\u3089\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3078\u306E\u5909\u63DB\u306B\u3088\u308A\u751F\u3058\u305F\u5272\u5F53\u3066\u3068\u3001\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u5408\u8A08\u5272\u5F53\u3066\u3092\u6BD4\u8F03\u3057\u305F\u3068\u304D\u306E\u6BD4\u7387\u3002
AutoboxingRule_RESULT_NO_AUTOBOXING=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u578B\u304B\u3089\u3001\u5BFE\u5FDC\u3059\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u578B\u3078\u306E\u5909\u63DB\u306B\u3088\u308A\u751F\u3058\u305F\u5272\u5F53\u3066\u306F\u3042\u308A\u307E\u305B\u3093\u3002
# {largestAllocatedType} is a type name
AutoboxingRule_RESULT_MOST_AUTOBOXED_TYPE=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304C\u5909\u63DB\u3055\u308C\u305F\u6700\u3082\u983B\u7E41\u306A\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u578B\u306F''{largestAllocatedType}''\u3067\u3059\u3002
# {largestAllocatedType} is a type name, {largestAllocatedByType} is a size in bytes, {secondFrameMostAllocated} is a method reference string
AutoboxingRule_RESULT_MOST_AUTOBOXED_TYPE_LONG=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304C\u5909\u63DB\u3055\u308C\u305F\u6700\u3082\u983B\u7E41\u306A\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u578B\u306F''{largestAllocatedType}''\u3067\u3001{largestAllocatedByType}\u304C\u5272\u308A\u5F53\u3066\u3089\u308C\u307E\u3057\u305F\u3002\u6700\u3082\u983B\u7E41\u306A\u30B3\u30FC\u30EB\u30FB\u30B5\u30A4\u30C8\u306F''{secondFrameMostAllocated}''\u3067\u3059\u3002
AutoboxingRule_RESULT_AUTOBOXING_RATIO=\u5408\u8A08\u5272\u5F53\u3066({boxedAllocationSize})\u306E{boxedAllocationRatio}\u306F\u3001\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u578B\u304B\u3089\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u578B\u3078\u306E\u5909\u63DB\u306B\u3088\u308A\u751F\u3058\u307E\u3057\u305F\u3002
AutoboxingRule_RESULT_LONG=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304B\u3089\u5BFE\u5FDC\u3059\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u578B\u3078\u306E\u5909\u63DB\u306F\u3001\u660E\u793A\u7684\u306B\u884C\u308F\u308C\u308B\u3053\u3068\u3082\u3042\u308A\u307E\u3059\u304C\u3001Autoboxing\u306B\u3088\u308A\u884C\u308F\u308C\u308B\u5834\u5408\u3082\u3042\u308A\u307E\u3059\u3002\u5408\u8A08\u5272\u5F53\u3066\u306E\u5927\u90E8\u5206\u304C\u305D\u306E\u3088\u3046\u306A\u5909\u63DB\u306B\u3088\u308A\u751F\u3058\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30BD\u30FC\u30B9\u30FB\u30B3\u30FC\u30C9\u3092\u5909\u66F4\u3057\u3066\u3001\u305D\u306E\u52D5\u4F5C\u3092\u56DE\u907F\u3059\u308B\u3053\u3068\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u5272\u5F53\u3066\u306E\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u53C2\u7167\u3057\u3001\u30B3\u30FC\u30C9\u306E\u3069\u306E\u90E8\u5206\u3092\u5909\u66F4\u3059\u308B\u304B\u3092\u5224\u65AD\u3057\u307E\u3059\u3002\u3053\u306E\u30EB\u30FC\u30EB\u3067\u306F\u3001\u5BFE\u5FDC\u3059\u308B\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u304C\u3042\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u578B8\u3064\u306E\u3046\u3061\u3001\u3044\u305A\u308C\u304B\u306EvalueOf\u30E1\u30BD\u30C3\u30C9\u3078\u306E\u547C\u51FA\u3057\u304C\u691C\u51FA\u3055\u308C\u307E\u3059\u3002
BiasedLockingRevocationRule_CONFIG_FILTERED_CLASSES=\u30D5\u30A3\u30EB\u30BF\u3055\u308C\u305F\u30AF\u30E9\u30B9
BiasedLockingRevocationRule_CONFIG_FILTERED_CLASSES_LONG=\u30EC\u30DD\u30FC\u30C8\u3057\u306A\u3044\u30AF\u30E9\u30B9\u540D\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u306E\u30EA\u30B9\u30C8
BiasedLockingRevocationRule_CONFIG_WARNING_LIMIT=\u53D6\u6D88\u3057\u8B66\u544A\u5236\u9650
BiasedLockingRevocationRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u3092\u958B\u59CB\u3059\u308B\u53D6\u6D88\u3057\u306E\u6570
BiasedLockingRevocationRule_NAME=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u53D6\u6D88\u3057
BiasedLockingRevocationRule_TEXT_OK=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306B\u95A2\u308F\u308B\u3053\u3068\u3067\u7121\u52B9\u5316\u3055\u308C\u305F\u30AF\u30E9\u30B9\u306F\u3042\u308A\u307E\u305B\u3093
BiasedLockingRevocationRule_TEXT_REVOKED_CLASSES_FOUND=\u5B8C\u5168\u306B\u53D6\u308A\u6D88\u3055\u308C\u305F\u30AF\u30E9\u30B9\u304C\u3042\u308A\u307E\u3059\u3002
BiasedLockingRevocationRule_TEXT_REVOKED_CLASSES_FOUND_LONG=\u6B21\u306E\u30AF\u30E9\u30B9\u306F\u3001\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306E\u4F7F\u7528\u304C\u7121\u52B9\u5316\u3055\u308C\u307E\u3057\u305F: {revokedClasses}
BiasedLockingRevocationRule_TEXT_REVOKE_LIMIT_CLASSES_FOUND=\u30AF\u30E9\u30B9\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u8A2D\u5B9A\u3057\u305F\u5236\u9650\u3092\u8D85\u3048\u3066\u53D6\u308A\u6D88\u3055\u308C\u307E\u3057\u305F\u3002
# {revocationClasses} is the user configured revocation limit
BiasedLockingRevocationRule_TEXT_REVOKE_LIMIT_CLASSES_FOUND_LONG=\u30AF\u30E9\u30B9\u306E\u6B21\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u3053\u306E\u30EB\u30FC\u30EB\u306B\u8A2D\u5B9A\u3057\u305F\u5236\u9650\u3092\u8D85\u3048\u3066\u53D6\u308A\u6D88\u3055\u308C\u307E\u3057\u305F(\u7121\u52B9\u5316\u3055\u308C\u3066\u3044\u308B\u30AF\u30E9\u30B9\u306F\u542B\u307F\u307E\u305B\u3093): {revocationClasses}
# {filteredTypes} is the classes that were filtered out from the result.
BiasedLockingRevocationRule_TEXT_EPILOGUE=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306F\u3001\u7AF6\u5408\u3057\u306A\u3044\u30ED\u30C3\u30AF\u306E\u30B3\u30B9\u30C8\u3092\u307B\u307C\u30ED\u30C3\u30AF\u306E\u306A\u3044\u72B6\u614B\u306E\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306B\u307E\u3067\u4F4E\u6E1B\u3059\u308B\u305F\u3081\u306BJVM\u3067\u4F7F\u7528\u3055\u308C\u3066\u3044\u308B\u6280\u8853\u3067\u3059\u3002\u30B9\u30EC\u30C3\u30C9\u304C\u3001\u30ED\u30C3\u30AF\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306B\u305D\u306E\u30B9\u30EC\u30C3\u30C9\u81EA\u8EAB\u306B\u5BFE\u3059\u308B\u30D0\u30A4\u30A2\u30B9\u3092\u304B\u3051\u308B\u3068\u3001\u305D\u306E\u30B9\u30EC\u30C3\u30C9\u306B\u3088\u308B\u5F8C\u7D9A\u306E\u30ED\u30C3\u30AF\u306E\u8CA0\u8377\u304C\u975E\u5E38\u306B\u5C11\u306A\u304F\u306A\u308A\u307E\u3059\u3002\u4ED6\u306E\u30B9\u30EC\u30C3\u30C9\u304C\u4F7F\u7528\u4E2D\u306E\u30ED\u30C3\u30AF\u304C\u958B\u59CB\u3055\u308C\u308B\u3068\u3001\u305D\u306E\u30D0\u30A4\u30A2\u30B9\u306F\u53D6\u308A\u6D88\u3055\u308C\u308B\u304B\u3001\u3082\u3046\u4E00\u65B9\u306E\u30B9\u30EC\u30C3\u30C9\u306B\u5BFE\u3057\u3066\u518D\u5EA6\u30D0\u30A4\u30A2\u30B9\u304C\u304B\u3051\u3089\u308C\u307E\u3059\u3002\u3042\u308B\u3044\u306F\u3001JVM\u306E\u305D\u308C\u4EE5\u964D\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u3067\u518D\u5EA6\u30D0\u30A4\u30A2\u30B9\u304C\u304B\u3051\u3089\u308C\u306A\u3044\u3088\u3046\u53D6\u308A\u6D88\u3055\u308C\u307E\u3059\u3002\u53D6\u308A\u6D88\u3055\u308C\u305F\u30AF\u30E9\u30B9\u304C\u591A\u6570\u3042\u3063\u3066\u3082\u554F\u984C\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u304C\u3001\u6700\u9069\u5316\u3084\u30C1\u30E5\u30FC\u30CB\u30F3\u30B0\u3001\u8A2D\u8A08\u306E\u6539\u5584\u3092\u884C\u3046\u597D\u6A5F\u3067\u306F\u3042\u308A\u307E\u3059\u3002\u305F\u3068\u3048\u3070\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u8D77\u52D5\u6642\u306B\u7AF6\u5408\u304C\u591A\u6570\u3042\u308B\u3068\u3001\u53D6\u6D88\u3057\u306E\u30B3\u30B9\u30C8\u304C\u751A\u5927\u306B\u306A\u308B\u305F\u3081\u3001''-XX:BiasedLockingStartupDelay=<time in ms>''\u30D5\u30E9\u30B0\u3092\u4F7F\u7528\u3057\u3066\u3001\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306E\u6709\u52B9\u5316\u3092\u9045\u3089\u305B\u308B\u3053\u3068\u304C\u8003\u3048\u3089\u308C\u307E\u3059\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u7AF6\u5408\u30ED\u30C3\u30AF\u306B\u975E\u5E38\u306B\u4F9D\u5B58\u3057\u3066\u3044\u3066\u3001\u304B\u3064\u518D\u8A2D\u8A08\u3067\u304D\u306A\u3044\u5834\u5408\u306F\u3001\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u5168\u4F53\u306E\u7121\u52B9\u5316(''-XX:-UseBiasedLocking'')\u304C\u6709\u76CA\u3067\u3059\u3002\u30D9\u30F3\u30C1\u30DE\u30FC\u30AF\u30FB\u30C6\u30B9\u30C8\u3092\u884C\u3046\u5834\u5408\u306F\u3001''-XX:BiasedLockingStartupDelay''\u3092\u30BC\u30ED\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u6B21\u306E\u30AF\u30E9\u30B9\u306F\u9664\u5916\u3055\u308C\u3066\u3044\u307E\u3057\u305F: {filteredTypes}
BiasedLockingRevocationPauseRule_CONFIG_WARNING_LIMIT=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u8B66\u544A\u5236\u9650\u6642\u9593
BiasedLockingRevocationPauseRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306E\u53D6\u6D88\u3057\u306B\u8CBB\u3084\u3055\u308C\u305F\u5408\u8A08\u6642\u9593
BiasedLockingRevocationPauseRule_RULE_NAME=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u53D6\u6D88\u3057\u306E\u4E00\u6642\u4F11\u6B62
BiasedLockingRevocationPauseRule_TEXT_INFO_LONG=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306F\u3001\u7AF6\u5408\u3057\u306A\u3044\u30ED\u30C3\u30AF\u306B\u5BFE\u3059\u308B\u6700\u9069\u5316\u3067\u3059\u3002\u30ED\u30C3\u30AF\u304C\u7AF6\u5408\u72B6\u614B\u306B\u306A\u308B\u3068\u3001\u3053\u306E\u6700\u9069\u5316\u306F\u53D6\u308A\u6D88\u3055\u308C\u306A\u3051\u308C\u3070\u306A\u3089\u305A\u3001\u305D\u308C\u304C\u4ECA\u5EA6\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u505C\u6B62\u3092\u5F15\u304D\u8D77\u3053\u3057\u307E\u3059\u3002 \u3053\u308C\u3092\u56DE\u907F\u3059\u308B\u306B\u306F\u3001\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u3092\u30AA\u30D5\u306B\u3059\u308B\u304B('-XX:-UseBiasedLocking')\u3001\u3053\u308C\u304C\u8D77\u52D5\u6642\u306B\u767A\u751F\u3059\u308B\u5834\u5408\u306F\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306E\u4F7F\u7528\u3092\u9045\u5EF6\u3057\u307E\u3059('-XX:BiasedLockingStartupDelay')\u3002
# {revocationTime} is a time period
BiasedLockingRevocationPauseRule_TEXT_MESSAGE=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u3001\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306E\u53D6\u6D88\u3057\u306B\u8CBB\u3084\u3057\u305F\u5408\u8A08\u6642\u9593{revocationTime}\u306E\u9593\u3001\u505C\u6B62\u3057\u3066\u3044\u307E\u3057\u305F\u3002
BiasedLockingRevocationPauseRule_TEXT_OK=\u30D0\u30A4\u30A2\u30B9\u30FB\u30ED\u30C3\u30AF\u306E\u53D6\u6D88\u3057\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
BufferLostRuleFactory_CONFIG_WARN_LIMIT=\u30D0\u30C3\u30D5\u30A1\u6D88\u5931\u5236\u9650
BufferLostRuleFactory_CONFIG_WARN_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u6D88\u5931\u30D0\u30C3\u30D5\u30A1\u30FB\u30A4\u30D9\u30F3\u30C8\u306E\u6570
BufferLostRuleFactory_RULE_NAME=\u6D88\u5931\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u30FB\u30D0\u30C3\u30D5\u30A1
BufferLostRuleFactory_RESULT_DROPPED_COUNT_NAME=\u30C9\u30ED\u30C3\u30D7\u3055\u308C\u305F\u30D0\u30C3\u30D5\u30A1
BufferLostRuleFactory_RESULT_DROPPED_COUNT_DESCRIPTION=\u30C9\u30ED\u30C3\u30D7\u3055\u308C\u305F\u30D0\u30C3\u30D5\u30A1\u306E\u6570
BufferLostRuleFactory_RESULT_DROPPED_SIZE_NAME=\u30C9\u30ED\u30C3\u30D7\u3055\u308C\u305F\u30D0\u30C3\u30D5\u30A1\u306E\u30B5\u30A4\u30BA
BufferLostRuleFactory_RESULT_DROPPED_SIZE_DESCRIPTION=\u30C9\u30ED\u30C3\u30D7\u3055\u308C\u305F\u30D0\u30C3\u30D5\u30A1\u306E\u30B5\u30A4\u30BA\u3002
BufferLostRuleFactory_RESULT_FIRST_DROPPED_BUFFER_TIME_NAME=\u6700\u521D\u306B\u30D0\u30C3\u30D5\u30A1\u304C\u30C9\u30ED\u30C3\u30D7\u3055\u308C\u305F\u6642\u523B
BufferLostRuleFactory_RESULT_FIRST_DROPPED_BUFFER_TIME_DESCRIPTION=\u6700\u521D\u306B\u30D0\u30C3\u30D5\u30A1\u304C\u30C9\u30ED\u30C3\u30D7\u3055\u308C\u305F\u6642\u523B\u3002
BufferLostRuleFactory_RESULT_SUMMARY_OK=\u3053\u306E\u8A18\u9332\u4E2D\u306B\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u30FB\u30D0\u30C3\u30D5\u30A1\u306E\u6D88\u5931\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
# {droppedCount} is a number, {droppedSize} is a size in bytes
BufferLostRuleFactory_RESULT_SUMMARY=\u5408\u8A08\u3067{droppedSize}\u306E\u5927\u304D\u3055\u306E{droppedCount}\u500B\u306E\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u30FB\u30A4\u30D9\u30F3\u30C8\u30FB\u30D0\u30C3\u30D5\u30A1\u304C\u6D88\u5931\u3057\u307E\u3057\u305F\u3002
# {droppedCount} is a number, {droppedSize} is a size in bytes, {firstDroppedBufferTime} is a time stamp
BufferLostRuleFactory_RESULT_EXPLANATION={droppedCount}\u500B\u306E\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u30FB\u30A4\u30D9\u30F3\u30C8\u30FB\u30D0\u30C3\u30D5\u30A1\u304C\u6D88\u5931\u3057\u307E\u3057\u305F\u3002\u6D88\u5931\u3057\u305F\u30C7\u30FC\u30BF\u306E\u5408\u8A08\u30B5\u30A4\u30BA\u306F{droppedSize}\u3067\u3001\u6700\u521D\u306E\u30D0\u30C3\u30D5\u30A1\u6D88\u5931\u306F{firstDroppedBufferTime}\u306B\u767A\u751F\u3057\u307E\u3057\u305F\u3002\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u306B\u7570\u5E38\u306B\u9AD8\u3044\u8CA0\u8377\u304C\u304B\u304B\u308B\u3068\u3001\u30A4\u30D9\u30F3\u30C8\u3092\u542B\u3080\u30D0\u30C3\u30D5\u30A1\u306F\u30C9\u30ED\u30C3\u30D7\u3055\u308C\u307E\u3059\u3002
BufferLostRuleFactory_RESULT_SOLUTION=\u3053\u308C\u3092\u9632\u3050\u306B\u306F\u3001\u8A18\u9332\u3055\u308C\u308B\u30A4\u30D9\u30F3\u30C8\u306E\u6570\u3092\u6E1B\u3089\u3057\u3066\u304F\u3060\u3055\u3044(\u7279\u306B\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u306E\u3046\u3061\u3001\u30A4\u30D9\u30F3\u30C8\u30EC\u30FC\u30C8\u306E\u9AD8\u3044\u3082\u306E\u3084\u30DA\u30A4\u30ED\u30FC\u30C9\u306E\u5927\u304D\u306A\u3082\u306E)\u3002
ClassLeakingRule_CONFIG_WARNING_LIMIT=\u8B66\u544A\u5236\u9650
ClassLeakingRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u3092\u767A\u884C\u3059\u308B\u305F\u3081\u306E\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u56DE\u6570\u3002
ClassLeakingRule_NAME=\u30AF\u30E9\u30B9\u306E\u30EA\u30FC\u30AF
ClassLeakingRule_TEXT_OK=\u5236\u9650\u3092\u8D85\u3048\u3066\u30ED\u30FC\u30C9\u3055\u308C\u305F\u540C\u4E00\u540D\u306E\u30AF\u30E9\u30B9\u306F\u3042\u308A\u307E\u305B\u3093\u3002
# {mostLoadedClass} is a java class, {mostLoadedClassTimes} is a number
ClassLeakingRule_RESULT_SUMMARY={mostLoadedClass}\u306F\u3001\u30A2\u30F3\u30ED\u30FC\u30C9\u3055\u308C\u308B\u3053\u3068\u304C\u306A\u3044\u307E\u307E\u3001{mostLoadedClassTimes}\u56DE\u30ED\u30FC\u30C9\u3055\u308C\u307E\u3057\u305F\u3002
# {loadedClasses} is a list of classes with an associated number
ClassLeakingRule_RESULT_EXPLANATION=\u3044\u304F\u3064\u304B\u306E\u30AF\u30E9\u30B9\u304C\u8907\u6570\u56DE\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u3055\u308C\u305F\u56DE\u6570\u3068\u305D\u306E\u30A2\u30F3\u30ED\u30FC\u30C9\u3055\u308C\u305F\u56DE\u6570\u306E\u5DEE\u304C\u3001\u30E6\u30FC\u30B6\u304C\u6307\u5B9A\u3057\u305F\u5236\u9650\u3092\u8D85\u3048\u3066\u3044\u307E\u3057\u305F\u3002\u3053\u308C\u81EA\u4F53\u306F\u554F\u984C\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u304C\u3001\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u306E\u30EA\u30FC\u30AF\u304C\u306A\u3044\u3088\u3046\u3001\u3053\u308C\u3089\u306E\u30AF\u30E9\u30B9\u304C\u8907\u6570\u56DE\u30ED\u30FC\u30C9\u3055\u308C\u308B\u3053\u3068\u3092\u671F\u5F85\u3057\u3066\u3044\u308B\u304B\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u6B21\u306E\u30AF\u30E9\u30B9\u306B\u6F5C\u5728\u7684\u306A\u554F\u984C\u304C\u3042\u308B\u3068\u691C\u51FA\u3055\u308C\u307E\u3057\u305F: {loadedClasses}
ClassLeakingRule_RESULT_LOADED_CLASSES_NAME=\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9
ClassLeakingRule_RESULT_LOADED_CLASSES_DESCRIPTION=\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9\u3068\u305D\u308C\u305E\u308C\u306E\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u3055\u308C\u305F\u56DE\u6570
ClassLeakingRule_RESULT_MOST_LOADED_CLASS_NAME=\u6700\u3082\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9
ClassLeakingRule_RESULT_MOST_LOADED_CLASS_DESCRIPTION=\u30A2\u30F3\u30ED\u30FC\u30C9\u56DE\u6570\u3068\u6BD4\u3079\u3066\u6700\u3082\u591A\u304F\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9\u3002
ClassLeakingRule_RESULT_MOST_LOADED_CLASS_LOADS_NAME=\u6700\u3082\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9
ClassLeakingRule_RESULT_MOST_LOADED_CLASS_LOADS_DESCRIPTION='\u6700\u3082\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9'\u304C\u30ED\u30FC\u30C9\u3055\u308C\u305F\u56DE\u6570\u3002
ClassLoadingRule_CONFIG_DURATION_LIMIT=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C9\u671F\u9593\u5236\u9650
ClassLoadingRule_CONFIG_DURATION_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30AF\u30E9\u30B9\u30ED\u30FC\u30C9\u671F\u9593
ClassLoadingRule_CONFIG_RATIO_LIMIT=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C9\u7387\u5236\u9650
ClassLoadingRule_CONFIG_RATIO_LIMIT_LONG=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C9\u3067\u8CBB\u3084\u3055\u308C\u305F\u6642\u9593\u3068\u8A18\u9332\u306E\u5408\u8A08\u671F\u9593\u306E\u9593\u306E\u6700\u5C0F\u6BD4\u7387
ClassLoadingRule_RESULT_LONGEST_LOAD_NAME=\u6700\u9577\u30AF\u30E9\u30B9\u30ED\u30FC\u30C9
ClassLoadingRule_RESULT_LONGEST_LOAD_DESCRIPTION=\u5358\u4E00\u306E\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u304B\u304B\u3063\u305F\u691C\u51FA\u3055\u308C\u305F\u6700\u9577\u306E\u6642\u9593\u3002
ClassLoadingRule_RESULT_TOTAL_LOAD_COUNT_NAME=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C9\u56DE\u6570\u306E\u5408\u8A08
ClassLoadingRule_RESULT_TOTAL_LOAD_COUNT_DESCRIPTION=\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9\u306E\u56DE\u6570\u306E\u5408\u8A08\u3002
ClassLoadingRule_RESULT_TOTAL_LOAD_TIME_NAME=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C9\u6642\u9593\u306E\u5408\u8A08
ClassLoadingRule_RESULT_TOTAL_LOAD_TIME_DESCRIPTION=\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u304B\u304B\u3063\u305F\u6642\u9593\u306E\u5408\u8A08\u3002
# {totalClassLoadTime} is a time, {totalClassLoadCount} is a number
ClassLoadingRule_RESULT_SUMMARY=\u3053\u306E\u8A18\u9332\u4E2D\u3001{totalClassLoadCount}\u500B\u306E\u65B0\u898F\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B{totalClassLoadTime}\u304B\u304B\u308A\u307E\u3057\u305F\u3002
# {longestClassLoad} is a time
ClassLoadingRule_RESULT_EXPLANATION=\u6700\u9577\u306E\u30AF\u30E9\u30B9\u30FB\u30ED\u30FC\u30C9\u30FB\u30A4\u30D9\u30F3\u30C8\u306F{longestClassLoad}\u304B\u304B\u308A\u307E\u3057\u305F\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30A6\u30A9\u30FC\u30E0\u30A2\u30C3\u30D7\u30FB\u30D5\u30A7\u30FC\u30BA\u4E2D\u306B\u8A18\u9332\u304C\u767A\u751F\u3057\u305F\u5834\u5408\u3001\u3053\u308C\u306F\u60F3\u5B9A\u5185\u3067\u3059\u3002\u305D\u3046\u3067\u306F\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u30AF\u30E9\u30B9\u304C\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u308B\u7406\u7531\u3092\u78BA\u8A8D\u3059\u308B\u3053\u3068\u3092\u304A\u85A6\u3081\u3057\u307E\u3059\u3002
ClassLoadingRuleFactory_RULE_NAME=\u30AF\u30E9\u30B9\u30FB\u30ED\u30FC\u30C9\u30FB\u30D7\u30EC\u30C3\u30B7\u30E3
ClassLoadingRuleFactory_RULE_TEXT_OK=\u3053\u306E\u8A18\u9332\u4E2D\u306E\u65B0\u898F\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u306F\u9577\u6642\u9593\u304B\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
ClassLoadingRuleFactory_TEXT_INFO=\u3053\u306E\u8A18\u9332\u4E2D\u3001{totalClassLoadCount}\u500B\u306E\u65B0\u898F\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B{totalClassLoadTime}\u304B\u304B\u308A\u307E\u3057\u305F\u3002
ClassLoadingRuleFactory_TEXT_INFO_LONG=\u3053\u306E\u8A18\u9332\u4E2D\u3001{totalClassLoadCount}\u500B\u306E\u65B0\u898F\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B{totalClassLoadTime}\u304B\u304B\u308A\u307E\u3057\u305F\u3002\u6700\u9577\u306E\u30AF\u30E9\u30B9\u30FB\u30ED\u30FC\u30C9\u30FB\u30A4\u30D9\u30F3\u30C8\u306F{longestClassLoad}\u304B\u304B\u308A\u307E\u3057\u305F\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30A6\u30A9\u30FC\u30E0\u30A2\u30C3\u30D7\u30FB\u30D5\u30A7\u30FC\u30BA\u4E2D\u306B\u8A18\u9332\u304C\u767A\u751F\u3057\u305F\u5834\u5408\u3001\u3053\u308C\u306F\u60F3\u5B9A\u5185\u3067\u3059\u3002\u305D\u3046\u3067\u306F\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u30AF\u30E9\u30B9\u304C\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u308B\u7406\u7531\u3092\u78BA\u8A8D\u3059\u308B\u3053\u3068\u3092\u304A\u85A6\u3081\u3057\u307E\u3059\u3002
CodeCacheRuleFactory_DEFAULT_LONG_DESCRIPTION=\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u3044\u3063\u3071\u3044\u306E\u5834\u5408\u306F\u3001JVM\u304C\u65B0\u898F\u30E1\u30BD\u30C3\u30C9\u306E\u30B3\u30F3\u30D1\u30A4\u30EB\u3092\u505C\u6B62\u3057\u3001\u30B3\u30FC\u30C9\u306E\u5B9F\u884C\u304C\u5FC5\u8981\u4EE5\u4E0A\u306B\u9045\u304F\u306A\u308A\u307E\u3059\u3002\u3053\u308C\u3092\u56DE\u907F\u3059\u308B\u306B\u306F\u3001\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30B5\u30A4\u30BA\u3092\u5897\u3084\u3059('-XX:ReservedCodeCacheSize')\u304B\u3001\u30B3\u30F3\u30D1\u30A4\u30EB\u3057\u304D\u3044\u5024\u3092\u5897\u3084\u3057\u3066('-XX:CompileThreshold')\u304F\u3060\u3055\u3044\u3002
CodeCacheRuleFactory_JDK8_TEXT_WARN=\u8A18\u9332\u4E2D\u306B\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u7A7A\u304D\u304C\u7D04{codeCacheFreeRatio}\u3067\u3057\u305F\u3002\u3053\u308C\u304C\u554F\u984C\u306B\u306A\u3063\u305F\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
CodeCacheRuleFactory_RULE_NAME=\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5
CodeCacheRuleFactory_BLOG_REFERENCE=\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u8A73\u7D30\u306F\u3001[\u3053\u306E\u30D6\u30ED\u30B0\u306E\u6295\u7A3F](https://blogs.oracle.com/poonam/why-do-i-get-message-codecache-is-full-compiler-has-been-disabled)\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
CodeCacheRuleFactory_SIZE_INFO_LIMIT=\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u5360\u6709\u7387\u60C5\u5831\u5236\u9650
CodeCacheRuleFactory_SIZE_INFO_LIMIT_DESC=\u5360\u6709\u7387\u304C\u3053\u306E\u5236\u9650\u3092\u8D85\u3048\u308B\u3068\u3001\u30EB\u30FC\u30EB\u306B\u3088\u3063\u3066\u60C5\u5831\u306E\u7D50\u679C\u304C\u8FD4\u3055\u308C\u307E\u3059
CodeCacheRuleFactory_SIZE_WARN_LIMIT=\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u5360\u6709\u7387\u8B66\u544A\u5236\u9650
CodeCacheRuleFactory_SIZE_WARN_LIMIT_DESC=\u5360\u6709\u7387\u304C\u3053\u306E\u5236\u9650\u3092\u8D85\u3048\u308B\u3068\u3001\u30EB\u30FC\u30EB\u306B\u3088\u3063\u3066\u8B66\u544A\u306E\u7D50\u679C\u304C\u623B\u3055\u308C\u307E\u3059
CodeCacheRuleFactory_TEXT_OK=\u8A18\u9332\u5185\u3067\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u554F\u984C\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
CodeCacheRuleFactory_TEXT_WARN=\u3053\u306E\u8A18\u9332\u4E2D\u306B\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u4E00\u676F\u306B\u306A\u308A\u307E\u3057\u305F\u3002
CodeCacheRuleFactory_TEXT_WARN_LONG=\u3053\u308C\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30B3\u30FC\u30C9\u304C\u5927\u91CF\u3067\u3042\u308B\u304B\u3001\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u5C0F\u3055\u3059\u304E\u308B\u5834\u5408\u306B\u767A\u751F\u3057\u307E\u3059\u3002\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u3044\u3063\u3071\u3044\u306E\u5834\u5408\u306F\u3001JVM\u304C\u65B0\u898F\u30E1\u30BD\u30C3\u30C9\u306E\u30B3\u30F3\u30D1\u30A4\u30EB\u3092\u505C\u6B62\u3057\u3001\u30B3\u30FC\u30C9\u306E\u5B9F\u884C\u304C\u5FC5\u8981\u4EE5\u4E0A\u306B\u9045\u304F\u306A\u308A\u307E\u3059\u3002'-XX:ReservedCodeCacheSize'\u3092\u4F7F\u7528\u3057\u3066\u3001'-XX:ReservedCodeCacheSize=128M'\u306E\u3088\u3046\u306B\u3001\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30B5\u30A4\u30BA\u3092\u5897\u3084\u3057\u3066\u304F\u3060\u3055\u3044\u3002
CodeCacheRuleFactory_WARN_LONG_DESCRIPTION=\u3053\u308C\u306B\u3088\u308A\u3001\u30B3\u30FC\u30C9\u30FB\u30AD\u30E3\u30C3\u30B7\u30E5\u304C\u30B9\u30A4\u30FC\u30D7\u3055\u308C\u308B\u983B\u5EA6\u304C\u9AD8\u307E\u308A\u3001\u5360\u6709\u7387\u304C\u9AD8\u3051\u308C\u3070\u30B9\u30A4\u30FC\u30D7\u3082\u983B\u7E41\u306B\u884C\u308F\u308C\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002
CodeCacheRuleFactory_WARN_SEGMENTED_HEAP_SHORT_DESCRIPTION=\u8A18\u9332\u4E2D\u306B{codeHeaps}\u30B3\u30FC\u30C9\u30FB\u30D2\u30FC\u30D7\u304C50%\u3092\u8D85\u3048\u308B\u5360\u6709\u7387\u306B\u9054\u3057\u307E\u3057\u305F\u3002
CodeCacheRuleFactory_WARN_SEGMENTED_HEAPS_SHORT_DESCRIPTION=\u8A18\u9332\u4E2D\u306B{codeHeaps}\u30B3\u30FC\u30C9\u30FB\u30D2\u30FC\u30D7\u304C50%\u3092\u8D85\u3048\u308B\u5360\u6709\u7387\u306B\u9054\u3057\u307E\u3057\u305F\u3002
CompareCpuRule_RULE_NAME=\u7AF6\u5408\u3057\u3066\u3044\u308BCPU\u4F7F\u7528\u7387
CompareCpuRule_TEXT_INFO_LONG=\u30DE\u30B7\u30F3\u304C\u9AD8\u3044\u8CA0\u8377\u306B\u3042\u308B\u4E2D\u3001\u540C\u3058\u30B3\u30F3\u30D4\u30E5\u30FC\u30BF\u306ECPU\u3084\u4ED6\u306E\u30EA\u30BD\u30FC\u30B9\u3092\u4F7F\u7528\u3059\u308B\u30D7\u30ED\u30BB\u30B9\u304C\u4ED6\u306B\u3082\u3042\u308B\u5834\u5408\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30FB\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306B\u5F71\u97FF\u304C\u51FA\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u5178\u578B\u7684\u306B\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u3092\u884C\u3044\u305F\u3044\u5834\u5408\u3001\u307E\u305F\u306F\u3088\u308A\u9AD8\u3044\u30B9\u30EB\u30FC\u30D7\u30C3\u30C8\u3092\u5F97\u305F\u3044\u5834\u5408\u306F\u3001\u30DE\u30B7\u30F3\u3067\u5B9F\u884C\u4E2D\u306E\u30EA\u30BD\u30FC\u30B9\u6D88\u8CBB\u306E\u6FC0\u3057\u3044\u4ED6\u306E\u30D7\u30ED\u30BB\u30B9\u3092\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3057\u3066\u304F\u3060\u3055\u3044\u3002
CompareCpuRule_TEXT_TOO_FEW_SAMPLES=\u7D50\u679C\u306E\u8A08\u7B97\u306B\u4F7F\u7528\u3067\u304D\u308B\u30B5\u30F3\u30D7\u30EB\u304C\u4E0D\u8DB3\u3057\u3066\u3044\u307E\u3059\u3002
# {avgCpuLoadWindow} is a time range, {avgCpuLoad} is a percentage
CompareCpuRule_TEXT_MESSAGE={avgCpuLoadWindow}\u306E\u9593\u306E{avgCpuLoad}\u3068\u3044\u3046\u5E73\u5747CPU\u8CA0\u8377\u306F\u3001\u4ED6\u306E\u30D7\u30ED\u30BB\u30B9\u304C\u539F\u56E0\u3067\u3057\u305F\u3002
CompareCpuRule_INFO_LIMIT=\u7AF6\u5408\u3057\u3066\u3044\u308BCPU\u4F7F\u7528\u7387\u60C5\u5831\u5236\u9650
CompareCpuRule_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u3001\u4ED6\u306E\u30D7\u30ED\u30BB\u30B9\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308BCPU\u91CF\u306B\u5168\u4F53\u306ECPU\u4F7F\u7528\u91CF\u3092\u639B\u3051\u305F\u3082\u306E
CompareCpuRule_WARNING_LIMIT=\u7AF6\u5408\u3057\u3066\u3044\u308BCPU\u4F7F\u7528\u7387\u8B66\u544A\u5236\u9650
CompareCpuRule_WARNING_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u3001\u4ED6\u306E\u30D7\u30ED\u30BB\u30B9\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308BCPU\u91CF\u306B\u5168\u4F53\u306ECPU\u4F7F\u7528\u91CF\u3092\u639B\u3051\u305F\u3082\u306E
CompressedOopsRuleFactory_RULE_NAME=\u5727\u7E2EOops
CompressedOopsRuleFactory_TEXT_INFO=Java\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA\u304C32GB\u3092\u4E0B\u56DE\u308A\u3001\u5727\u7E2EOops\u304C\u30AA\u30D5\u306B\u3055\u308C\u3066\u3044\u307E\u3059\u3002
CompressedOopsRuleFactory_TEXT_INFO_LONG=\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA\u304C32GB\u6D88\u8CBB\u30E1\u30E2\u30EA\u30FC\u3092\u4E0B\u56DE\u308A\u3001\u4E0D\u8981\u306A\u30AD\u30E3\u30C3\u30B7\u30E5\u30FB\u30D7\u30EC\u30C3\u30B7\u30E3\u3092\u3082\u305F\u3089\u3059\u5834\u5408\u306F\u3001\u5727\u7E2E\u3055\u308C\u305F\u901A\u5E38\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30DD\u30A4\u30F3\u30BF\u3092\u4F7F\u7528\u3057\u307E\u305B\u3093\u3002\u3053\u306E\u6A5F\u80FD\u3092\u6709\u52B9\u306B\u3059\u308B\u306B\u306F\u3001JVM\u5F15\u6570'-XX:+UseCompressedOops'\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
CompressedOopsRuleFactory_TEXT_OK=\u5727\u7E2EOops\u306E\u8A2D\u5B9A\u306FOK\u3067\u3057\u305F\u3002
ConcurrentFailedRuleFactory_TEXT_WARN=\u7279\u5B9A\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u4E2D\u306B\u4E26\u884C\u30E2\u30FC\u30C9\u306E\u5931\u6557\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
ConcurrentFailedRuleFactory_TEXT_WARN_LONG=\u4E26\u884C\u30E2\u30FC\u30C9\u306E\u5931\u6557\u306F\u3001\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u304CJava\u30D7\u30ED\u30B0\u30E9\u30E0\u306E\u51E6\u7406\u306B\u8FFD\u3044\u3064\u3044\u3066\u3044\u306A\u3044\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002[-XX:InitiatingHeapOccupancyPercent](http://www.oracle.com/technetwork/articles/java/vmoptions-jsp-140102.html)\u306E\u5024\u3092\u4E0B\u3052\u308B\u3053\u3068\u3092\u8A66\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ContextSwitchRule_AGGR_MAX_BLOCKS=\u6700\u5927\u30D6\u30ED\u30C3\u30AF\u6570
ContextSwitchRule_CONFIG_WARNING_LIMIT=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5207\u66FF\u3048\u7387\u8B66\u544A\u5236\u9650
ContextSwitchRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5207\u66FF\u3048\u7387(\u5207\u66FF\u3048/\u79D2)
ContextSwitchRuleFactory_RULE_NAME=\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5207\u66FF\u3048
ContextSwitchRuleFactory_TEXT_INFO=\u30D7\u30ED\u30B0\u30E9\u30E0\u306F\u8A18\u9332\u4E2D\u306B\u591A\u6570\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5207\u66FF\u3048\u3092\u5F15\u304D\u8D77\u3053\u3057\u307E\u3059\u3002
ContextSwitchRuleFactory_TEXT_INFO_LONG=\u30D7\u30ED\u30B0\u30E9\u30E0\u30FB\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u983B\u7E41\u306B\u5207\u308A\u66FF\u308F\u3063\u3066\u591A\u6570\u306E\u30B9\u30EC\u30C3\u30C9\u304C\u540C\u3058\u30E2\u30CB\u30BF\u30FC\u4E0A\u3067\u5F85\u6A5F\u3057\u3066\u3044\u307E\u3057\u305F\u3002\u4F7F\u7528\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u6570\u306E\u524A\u6E1B\u3092\u691C\u8A0E\u3059\u308B\u304B\u3001\u4ED6\u306E\u624B\u6CD5\u306B\u3088\u3063\u3066\u30ED\u30C3\u30AF\u7AF6\u5408\u3092\u4F4E\u6E1B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ContextSwitchRuleFactory_TEXT_OK=\u30D7\u30ED\u30B0\u30E9\u30E0\u306F\u8A18\u9332\u4E2D\u306B\u904E\u5EA6\u306E\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u5207\u66FF\u3048\u3092\u884C\u3044\u307E\u305B\u3093\u3067\u3057\u305F\u3002
DMSIncidentRule_AGGR_INCIDENTS_COUNT=DMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8
DMSIncidentRule_AGGR_INCIDENTS_COUNT_DESC=DMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8\u306E\u6570
DMSIncidentRule_CONFIG_WARNING_LIMIT=DMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8\u8B66\u544A\u5236\u9650
DMSIncidentRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308BDMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8\u306E\u6570
DMSIncidentRuleFactory_RULE_NAME=DMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8
DMSIncidentRuleFactory_TEXT_OK=DMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8\u304C\u8A18\u9332\u3067\u5831\u544A\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
DMSIncidentRuleFactory_TEXT_WARN=\u5831\u544A\u3055\u308C\u305FDMS\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8\u304C\u3042\u308A\u307E\u3057\u305F\u3002
# {dmsIncidentCount} is a number
DMSIncidentRuleFactory_TEXT_WARN_LONG={dmsIncidentCount}\u500B\u306E\u5831\u544A\u3055\u308C\u305FDMS(\u30C0\u30A4\u30CA\u30DF\u30C3\u30AF\u30FB\u30E2\u30CB\u30BF\u30EA\u30F3\u30B0\u30FB\u30B5\u30FC\u30D3\u30B9)\u30A4\u30F3\u30B7\u30C7\u30F3\u30C8\u304C\u3042\u308A\u307E\u3059\u3002
DeprecatedGcRuleFactory_TEXT_WARN_PERMGEN_LONG=Java\u30E6\u30FC\u30B6\u30FC\u306F\u30AF\u30E9\u30B9\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF\u306A\u3069\u306B\u4E88\u7D04\u3059\u308B\u30E1\u30E2\u30EA\u30FC\u91CF\u3092\u524D\u3082\u3063\u3066\u77E5\u308B\u5FC5\u8981\u304C\u306A\u3044\u305F\u3081\u3001PermGen\u306FJDK 8\u3067\u524A\u9664\u3055\u308C\u307E\u3057\u305F\u3002JRockit\u304A\u3088\u3073J9 JVM\u3067\u306E\u5834\u5408\u3068\u540C\u69D8\u3001\u30CD\u30A4\u30C6\u30A3\u30D6\u30FB\u30E1\u30E2\u30EA\u30FC\u304C\u73FE\u5728\u30AF\u30E9\u30B9\u30FB\u30E1\u30BF\u30C7\u30FC\u30BF\u306B\u4F7F\u7528\u3055\u308C\u3001\u5FC5\u8981\u306B\u5FDC\u3058\u3066\u52D5\u7684\u306B\u62E1\u5927\u3057\u307E\u3059\u3002java.lang.OutOfMemoryError: PermGen\u306E\u7B49\u4FA1\u6A5F\u80FD\u306F\u3055\u3089\u306B\u547C\u51FA\u3057\u304C\u96E3\u3057\u304F\u306A\u308A\u307E\u3059\u3002\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u30FB\u30E1\u30E2\u30EA\u30FC\u306E\u518D\u5229\u7528\u306E\u8A66\u884C\u3092\u958B\u59CB\u3059\u308B\u6642\u671F\u306B\u5F71\u97FF\u3092\u53CA\u307C\u3059\u305F\u3081\u3001[MaxMetaspaceSize\u30D5\u30E9\u30B0](https://docs.oracle.com/javase/8/docs/technotes/tools/unix/java.html)\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
DumpReason_RULE_NAME=\u30C0\u30F3\u30D7\u306E\u4F8B\u5916\u7684\u306A\u7406\u7531
DumpReasonRule_TEXT_OK=\u3053\u306E\u8A18\u9332\u306F\u3001\u4F8B\u5916\u7684\u306A\u7406\u7531\u3067\u30C0\u30F3\u30D7\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
DumpReasonRule_TEXT_INFO=\u3053\u306E\u8A18\u9332\u306F\u3001\u4F8B\u5916\u7684\u306A\u7406\u7531\u3067\u30C0\u30F3\u30D7\u3055\u308C\u307E\u3057\u305F\u3002
DumpReasonRule_TEXT_LONG_CRASH=JVM\u306E\u30AF\u30E9\u30C3\u30B7\u30E5\u304C\u539F\u56E0\u3067\u3001\u8A18\u9332\u304C\u30C0\u30F3\u30D7\u3055\u308C\u307E\u3057\u305F\u3002\u8A18\u9332\u306E\u6700\u5F8C\u306B\u3001\u4E00\u90E8\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u542B\u307E\u308C\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
DumpReasonRule_TEXT_LONG_OOM=\u30E1\u30E2\u30EA\u30FC\u4E0D\u8DB3\u304C\u539F\u56E0\u3067\u3001\u8A18\u9332\u304C\u30C0\u30F3\u30D7\u3055\u308C\u307E\u3057\u305F\u3002\u8A18\u9332\u306E\u6700\u5F8C\u306B\u3001\u4E00\u90E8\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u542B\u307E\u308C\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
DumpReasonRule_TEXT_LONG_COREDUMP=\u8A18\u9332\u306F\u30B3\u30A2\u30FB\u30C0\u30F3\u30D7\u304B\u3089\u62BD\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
DumpReasonRule_TEXT_INFO_UNKNOWN=\u3053\u306E\u8A18\u9332\u306F\u3001\u4F8B\u5916\u7684\u306A\u7406\u7531\u3067\u306F\u306A\u304F\u3001\u4E0D\u660E\u306A\u7406\u7531\u3067\u30C0\u30F3\u30D7\u3055\u308C\u307E\u3057\u305F\u3002
DumpReasonRule_TEXT_LONG_UNKNOWN=\u8A18\u9332\u306F\u6B21\u306E\u7406\u7531\u3067\u30C0\u30F3\u30D7\u3055\u308C\u307E\u3057\u305F: {dumpReason}\u3002
DumpReasonRule_CRASH_SCORE=\u30AF\u30E9\u30C3\u30B7\u30E5\u30FB\u30B9\u30B3\u30A2
DumpReasonRule_CRASH_SCORE_LONG=\u30AF\u30E9\u30C3\u30B7\u30E5\u304C\u539F\u56E0\u3067\u30C0\u30F3\u30D7\u3055\u308C\u305F\u8A18\u9332\u306E\u30B9\u30B3\u30A2
DumpReasonRule_OOM_SCORE=OOM\u30B9\u30B3\u30A2
DumpReasonRule_OOM_SCORE_LONG=\u30E1\u30E2\u30EA\u30FC\u4E0D\u8DB3\u304C\u539F\u56E0\u3067\u30C0\u30F3\u30D7\u3055\u308C\u305F\u8A18\u9332\u306E\u30B9\u30B3\u30A2
DumpReasonRule_COREDUMP_SCORE=\u30B3\u30A2\u30FB\u30C0\u30F3\u30D7\u30FB\u30B9\u30B3\u30A2
DumpReasonRule_COREDUMP_SCORE_LONG=\u30B3\u30A2\u30FB\u30C0\u30F3\u30D7\u304B\u3089\u62BD\u51FA\u3055\u308C\u305F\u8A18\u9332\u306E\u30B9\u30B3\u30A2
DuplicateFlagsRuleFactory_RULE_NAME=\u30D5\u30E9\u30B0\u306E\u91CD\u8907
DuplicateFlagsRule_RESULT_DUPLICATED_FLAGS_NAME=\u91CD\u8907\u3057\u305F\u30D5\u30E9\u30B0
DuplicateFlagsRule_RESULT_DUPLICATED_FLAGS_DESCRIPTION=\u91CD\u8907\u3057\u305FJVM\u30D5\u30E9\u30B0\u306E\u30EA\u30B9\u30C8\u3092\u542B\u3080\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3002
DuplicateFlagsRule_RESULT_DUPLICATED_FLAGS_COUNT_NAME=\u91CD\u8907\u3057\u305F\u30D5\u30E9\u30B0\u306E\u5408\u8A08\u6570
DuplicateFlagsRule_RESULT_DUPLICATED_FLAGS_COUNT_DESCRIPTION=\u691C\u51FA\u3055\u308C\u305F\u91CD\u8907\u3057\u305F\u30D5\u30E9\u30B0\u306E\u5408\u8A08\u6570\u3002
# {totalDuplicatedFlags} is a number
DuplicateFlagsRule_RESULT_SUMMARY={totalDuplicatedFlags}\u500B\u306E\u91CD\u8907\u3057\u305F\u30D5\u30E9\u30B0\u304C\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u3002
# {duplicateFlags} is a list of duplicated JVM flags
DuplicateFlagsRule_RESULT_EXPLANATION=JVM\u30D5\u30E9\u30B0\u306E\u91CD\u8907\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u8D77\u52D5\u306B\u4F7F\u308F\u308C\u308B\u30B9\u30AF\u30EA\u30D7\u30C8\u304C\u6BB5\u91CD\u306D\u306B\u306A\u3063\u3066\u3044\u308B\u3053\u3068\u306B\u8D77\u56E0\u3057\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u30D5\u30E9\u30B0\u306E\u91CD\u8907\u306F\u3001\u3069\u308C\u304B\u4E00\u3064\u306E\u30B9\u30AF\u30EA\u30D7\u30C8\u306E\u3069\u308C\u304B\u4E00\u3064\u306E\u30D5\u30E9\u30B0\u3092\u5909\u66F4\u3057\u3066\u3082\u610F\u56F3\u3057\u305F\u52B9\u679C\u304C\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u5371\u967A\u3067\u3059\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u306B\u95A2\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u3067\u306F\u7279\u306B\u5371\u967A\u3067\u3059\u3002\u6B21\u306E\u30D5\u30E9\u30B0\u304C\u91CD\u8907\u3057\u3066\u3044\u307E\u3057\u305F: {duplicateFlags}
DuplicateFlagsRule_RESULT_SOLUTION=\u30D5\u30E9\u30B0\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u3059\u3079\u3066\u306E\u7B87\u6240\u3092\u898B\u3064\u3051\u3001\u3069\u308C\u304B\u4E00\u3064\u3060\u3051\u3092\u4FDD\u6301\u3059\u308B\u3088\u3046\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
DuplicateFlagsRule_RESULT_SUMMARY_OK=\u30B3\u30DE\u30F3\u30C9\u884C\u306BJVM\u30D5\u30E9\u30B0\u306E\u91CD\u8907\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
ErrorRule_CONFIG_INFO_LIMIT=\u30A8\u30E9\u30FC\u7387\u60C5\u5831\u5236\u9650
ErrorRule_CONFIG_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A1\u5206\u5F53\u305F\u308A\u306E\u30A8\u30E9\u30FC\u30FB\u30A4\u30D9\u30F3\u30C8\u6570
ErrorRule_CONFIG_WARN_LIMIT=\u30A8\u30E9\u30FC\u7387\u8B66\u544A\u5236\u9650
ErrorRule_CONFIG_WARN_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A1\u5206\u5F53\u305F\u308A\u306E\u30A8\u30E9\u30FC\u30FB\u30A4\u30D9\u30F3\u30C8\u6570
ErrorRule_CONFIG_EXCLUDED_ERRORS=\u9664\u5916\u3055\u308C\u305F\u30A8\u30E9\u30FC\u30FB\u30AF\u30E9\u30B9
ErrorRule_CONFIG_EXCLUDED_ERRORS_LONG=\u9664\u5916\u3059\u308B\u30A8\u30E9\u30FC\u30FB\u30AF\u30E9\u30B9\u3092\u8AAC\u660E\u3059\u308B\u6B63\u898F\u8868\u73FE\u3002\u4F8B: (com.sun.el.parser.ELParser\\$LookaheadSuccess|java.lang.NoSuchMethodError)
ErrorRule_CONFIG_WINDOW_SIZE=\u30B9\u30E9\u30A4\u30C7\u30A3\u30F3\u30B0\u30FB\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
ErrorRule_CONFIG_WINDOW_SIZE_LONG=1\u5206\u5F53\u305F\u308A\u306E\u30A8\u30E9\u30FC\u304C\u591A\u3044\u671F\u9593\u3092\u7279\u5B9A\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30E9\u30A4\u30C7\u30A3\u30F3\u30B0\u30FB\u30A6\u30A3\u30F3\u30C9\u30A6\u306E\u30B5\u30A4\u30BA\u3002
ErrorRule_RULE_NAME=\u30B9\u30ED\u30FC\u3055\u308C\u305F\u30A8\u30E9\u30FC
ErrorRule_TEXT_OK=\u30D7\u30ED\u30B0\u30E9\u30E0\u306F\u30A8\u30E9\u30FC\u3092\u751F\u6210\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
# {errorRate} is a number, {errorWindow} is a time range
ErrorRule_TEXT_WARN=\u30D7\u30ED\u30B0\u30E9\u30E0\u306F{errorWindow}\u306E\u9593\u306B1\u5206\u5F53\u305F\u308A\u5E73\u5747{errorRate}\u4EF6\u306E\u30A8\u30E9\u30FC\u3092\u751F\u6210\u3057\u307E\u3057\u305F\u3002
# {errorCount} is a number, {mostCommonError} is an error class name, {mostCommonErrorCount} is a number
ErrorRule_TEXT_WARN_LONG=\u5408\u8A08\u3067{errorCount}\u4EF6\u306E\u30A8\u30E9\u30FC\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3057\u305F\u3002\u6700\u3082\u983B\u7E41\u306A\u30A8\u30E9\u30FC\u306F''{mostCommonError}''\u3067\u3001\u3053\u308C\u306F{mostCommonErrorCount}\u56DE\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3057\u305F\u3002\u30B9\u30ED\u30FC\u3055\u308C\u305F\u30A8\u30E9\u30FC\u3092\u8ABF\u67FB\u3057\u3001\u56DE\u907F\u3067\u304D\u308B\u304B\u3069\u3046\u304B\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u30A8\u30E9\u30FC\u306F\u3001\u30B3\u30FC\u30C9\u306E\u5B9F\u884C\u3067\u4F55\u304B\u304C\u4E0A\u624B\u304F\u3044\u304B\u306A\u304B\u3063\u305F\u3053\u3068\u3092\u793A\u3057\u3066\u304A\u308A\u3001\u30D5\u30ED\u30FC\u5236\u5FA1\u306B\u306F\u6C7A\u3057\u3066\u4F7F\u7528\u3057\u3066\u306F\u306A\u308A\u307E\u305B\u3093\u3002
# {error.exclude.regexp} is a regexp exclude string, {excludedErrors} is a number
ErrorRule_TEXT_WARN_EXCLUDED_INFO=\u6B21\u306E\u6B63\u898F\u8868\u73FE\u306F\u3001\u3053\u306E\u30EB\u30FC\u30EB\u304B\u3089{excludedErrors}\u4EF6\u306E\u30A8\u30E9\u30FC\u3092\u9664\u5916\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F: ''{error.exclude.regexp}''\u3002
ExceptionRule_CONFIG_INFO_LIMIT=\u4F8B\u5916\u7387\u60C5\u5831\u5236\u9650
ExceptionRule_CONFIG_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A1\u79D2\u5F53\u305F\u308A\u306B\u30B9\u30ED\u30FC\u3055\u308C\u308B\u4F8B\u5916\u306E\u6570
ExceptionRule_CONFIG_WARN_LIMIT=\u4F8B\u5916\u7387\u8B66\u544A\u5236\u9650
ExceptionRule_CONFIG_WARN_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A1\u79D2\u5F53\u305F\u308A\u306B\u30B9\u30ED\u30FC\u3055\u308C\u308B\u4F8B\u5916\u306E\u6570
ExceptionRule_RULE_NAME=\u30B9\u30ED\u30FC\u3055\u308C\u305F\u4F8B\u5916
ExceptionRule_TEXT_INFO_LONG=\u4F8B\u5916\u306E\u30B9\u30ED\u30FC\u306F\u3001\u901A\u5E38\u306E\u30B3\u30FC\u30C9\u3092\u5B9F\u884C\u3059\u308B\u3088\u308A\u8CA0\u8377\u304C\u5927\u304D\u3044\u305F\u3081\u3001\u4F7F\u7528\u3059\u308B\u306E\u306F\u4F8B\u5916\u7684\u306A\u72B6\u6CC1\u306E\u307F\u306B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u30B9\u30ED\u30FC\u3055\u308C\u305F\u4F8B\u5916\u3092\u8ABF\u67FB\u3057\u3001\u4F8B\u5916\u4EE5\u5916\u306E\u30D5\u30ED\u30FC\u5236\u5FA1\u3067\u56DE\u907F\u3067\u304D\u308B\u3082\u306E\u304C\u306A\u3044\u304B\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
# {exceptionsWindow} is a time range, {exceptionsRate} is a number
ExceptionRule_TEXT_MESSAGE={exceptionsWindow}\u306E\u9593\u306B\u3001\u30D7\u30ED\u30B0\u30E9\u30E0\u306F1\u79D2\u5F53\u305F\u308A{exceptionsRate}\u4EF6\u306E\u4F8B\u5916\u3092\u751F\u6210\u3057\u307E\u3057\u305F\u3002
FatalErrorRule_RULE_NAME=\u81F4\u547D\u7684\u30A8\u30E9\u30FC
FatalErrorRule_TEXT_OK=JVM\u306F\u6B63\u5E38\u306B\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3055\u308C\u307E\u3057\u305F\u3002
FatalErrorRule_TEXT_INFO=\u30C7\u30FC\u30E2\u30F3\u4EE5\u5916\u306EJava\u30B9\u30EC\u30C3\u30C9\u304C\u6B8B\u3063\u3066\u3044\u306A\u3044\u305F\u3081\u3001JVM\u306F\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3055\u308C\u307E\u3057\u305F\u3002
FatalErrorRule_TEXT_WARN=JVM\u306F\u81F4\u547D\u7684\u30A8\u30E9\u30FC\u306E\u305F\u3081\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3055\u308C\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u3001\u30D7\u30ED\u30B0\u30E9\u30E0\u304C\u6B63\u5E38\u306B\u7D42\u4E86\u3057\u306A\u304B\u3063\u305F\u305F\u3081\u3001\u8ABF\u67FB\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u3066\u3044\u307E\u3059\u3002
FasttimeRule_TEXT_WARN=\u3053\u306E\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u306F\u3001\u590F\u6642\u9593\u63DB\u7B97\u306E\u30D0\u30B0\u3068\u3068\u3082\u306BJVM\u3067\u4F5C\u6210\u3055\u308C\u307E\u3057\u305F\u3002
FasttimeRule_TEXT_WARN_LONG=\u3053\u306E\u8A18\u9332\u306E\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u306F\u4FE1\u983C\u6027\u304C\u306A\u304F\u3001\u5B9F\u969B\u306E\u30C7\u30FC\u30BF\u3092\u9069\u5207\u306B\u8868\u3057\u3066\u3044\u306A\u3044\u304B\u3001JMC\u306E\u554F\u984C\u3092\u5F15\u304D\u8D77\u3053\u3059\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u306E\u554F\u984C\u3092\u89E3\u6C7A\u3059\u308B\u306B\u306F\u3001Java 7u60\u4EE5\u4E0A\u306B\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u3057\u3066\u304F\u3060\u3055\u3044\u3002
FewSampledThreadsRule_AGGR_SAMPLES_PER_THREAD=\u30B9\u30EC\u30C3\u30C9\u5F53\u305F\u308A\u306E\u30B5\u30F3\u30D7\u30EB\u6570
FewSampledThreadsRule_AGGR_SAMPLES_PER_THREAD_DESC=\u30B9\u30EC\u30C3\u30C9\u5F53\u305F\u308A\u306E\u30B5\u30F3\u30D7\u30EB\u6570
# {jvmUsage} is a percentage, {maxWindow} a timerange
FewSampledThreadsRule_APPLICATION_IDLE=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u306E\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002{maxWindow}\u306E\u9593\u3001JVM CPU\u306E\u4F7F\u7528\u7387\u306F{jvmUsage}\u3067\u3057\u305F\u3002
FewSampledThreadsRule_APPLICATION_IDLE_LONG=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u5F85\u6A5F\u6642\u9593\u304C\u539F\u56E0\u306E\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u305D\u306E\u4ED6\u306E\u30EB\u30FC\u30EB\u306E\u60C5\u5831\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u307E\u305F\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u4F55\u3082\u5B9F\u884C\u3057\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u3082\u3042\u308A\u307E\u3059\u3002
FewSampledThreadsRule_CPU_WINDOW_SIZE=CPU\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
FewSampledThreadsRule_CPU_WINDOW_SIZE_LONG=CPU\u4F7F\u7528\u7387\u306E\u8A08\u7B97\u306B\u4F7F\u7528\u3055\u308C\u308B\u30B9\u30E9\u30A4\u30C7\u30A3\u30F3\u30B0\u30FB\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA\u3002
FewSampledThreadsRule_MIN_CPU_RATIO=CPU\u6700\u5C0F\u4F7F\u7528\u7387
FewSampledThreadsRule_MIN_CPU_RATIO_LONG=\u3053\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u3067\u3042\u308B\u3068\u307F\u306A\u3059CPU\u6700\u5C0F\u4F7F\u7528\u7387\u3002
FewSampledThreadsRule_MIN_SAMPLE_COUNT=\u6700\u5C0F\u5408\u8A08\u30B5\u30F3\u30D7\u30EB\u6570
FewSampledThreadsRule_MIN_SAMPLE_COUNT_LONG=\u3053\u306E\u30EB\u30FC\u30EB\u304C\u9069\u7528\u3055\u308C\u308B\u3001\u8A18\u9332\u6642\u306E\u6700\u5C0F\u30B5\u30F3\u30D7\u30EB\u6570\u3002
FewSampledThreadsRule_MIN_SAMPLE_COUNT_PER_THREAD=\u30B9\u30EC\u30C3\u30C9\u5F53\u305F\u308A\u306E\u6700\u5C0F\u30B5\u30F3\u30D7\u30EB\u6570
FewSampledThreadsRule_MIN_SAMPLE_COUNT_PER_THREAD_LONG=\u30B9\u30EC\u30C3\u30C9\u304C\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3055\u308C\u305F\u3068\u307F\u306A\u3059\u3001\u30B9\u30EC\u30C3\u30C9\u5185\u306E\u6700\u5C0F\u30B5\u30F3\u30D7\u30EB\u6570\u3002
FewSampledThreadsRule_SAMPLED_THREADS_RATIO_WARNING_LIMIT=\u30B5\u30F3\u30D7\u30EB\u30EA\u30F3\u30B0\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u7387\u5236\u9650
FewSampledThreadsRule_SAMPLED_THREADS_RATIO_WARNING_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u30B5\u30F3\u30D7\u30EB\u5316\u30B9\u30EC\u30C3\u30C9\u3068\u30CF\u30FC\u30C9\u30A6\u30A7\u30A2\u30FB\u30B9\u30EC\u30C3\u30C9\u9593\u306E\u6BD4\u7387\u3002
FewSampledThreadsRule_TEXT_OK=\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u306E\u91CF\u306B\u554F\u984C\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
FewSampledThreadsRule_TEXT_OK_LONG=\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u306F\u30CF\u30FC\u30C9\u30A6\u30A7\u30A2\u30FB\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u3092\u8D85\u3048\u3066\u3044\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u3053\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067\u306F\u3001\u4F7F\u7528\u53EF\u80FD\u306A\u30CF\u30FC\u30C9\u30A6\u30A7\u30A2\u306E\u4E26\u5217\u5EA6\u304C\u5341\u5206\u3067\u3042\u308B\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002
# {totalSamples} and {min.sample.count} are numbers
FewSampledThreadsRule_TEXT_NOT_ENOUGH_SAMPLES=\u8A18\u9332\u5185\u306E\u30E1\u30BD\u30C3\u30C9\u30FB\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u30FB\u30B5\u30F3\u30D7\u30EB\u304C{totalSamples}\u500B\u3057\u304B\u3042\u308A\u307E\u305B\u3093\u3002\u3053\u306E\u30EB\u30FC\u30EB\u304C\u6A5F\u80FD\u3059\u308B\u306B\u306F\u3001\u5C11\u306A\u304F\u3068\u3082{min.sample.count}\u500B\u306E\u30B5\u30F3\u30D7\u30EB\u304C\u5FC5\u8981\u3067\u3059\u3002
FewSampledThreadsRule_RULE_NAME=\u30D1\u30E9\u30EC\u30EB\u30FB\u30B9\u30EC\u30C3\u30C9
FewSampledThreadsRule_TEXT_INFO=\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u304C\u3001\u30CF\u30FC\u30C9\u30A6\u30A7\u30A2\u30FB\u30B9\u30EC\u30C3\u30C9(\u30B3\u30A2)\u306E\u5408\u8A08\u6570\u3092\u4E0B\u56DE\u3063\u3066\u3044\u307E\u3059\u3002
# {threadsWithEnoughSamples} is a count, {min.sample.count.per.thread} is a count, {hwThreads} is a count
FewSampledThreadsRule_TEXT_INFO_LONG=\u5C11\u306A\u304F\u3068\u3082{threadsWithEnoughSamples}\u500B\u306E\u30E1\u30BD\u30C3\u30C9\u30FB\u30B5\u30F3\u30D7\u30EB\u3092\u542B\u3080\u30B9\u30EC\u30C3\u30C9\u304C{min.sample.count.per.thread}\u500B\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u304C\u3001\u30DE\u30B7\u30F3\u306B\u306F{hwThreads}\u500B\u306E\u30CF\u30FC\u30C9\u30A6\u30A7\u30A2\u30FB\u30B9\u30EC\u30C3\u30C9(\u30B3\u30A2)\u304C\u3042\u308A\u307E\u3059\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u3088\u308A\u9AD8\u3044\u4E26\u5217\u30EC\u30D9\u30EB\u306B\u3088\u308A\u6069\u6075\u3092\u53D7\u3051\u308B\u304B\u3082\u3057\u308C\u307E\u305B\u3093\u3002\u3053\u306E\u539F\u56E0\u306F\u3001\u30B9\u30EC\u30C3\u30C9\u306B\u304A\u3051\u308BJava\u30B3\u30FC\u30C9\u306E\u5B9F\u884C\u4EE5\u5916\u306E\u52D5\u4F5C(\u30CD\u30A4\u30C6\u30A3\u30D6\u30FB\u30B3\u30FC\u30C9\u306E\u5B9F\u884C\u307E\u305F\u306FJVM\u5185\u90E8\u3067\u306E\u6642\u9593\u7D4C\u904E\u306A\u3069)\u3067\u3042\u308B\u53EF\u80FD\u6027\u3082\u3042\u308A\u307E\u3059\u3002
FileReadRule_CONFIG_WARNING_LIMIT=\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u671F\u9593\u8B66\u544A\u5236\u9650
FileReadRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u671F\u9593
FileReadRuleFactory_RULE_NAME=\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u30D4\u30FC\u30AF\u671F\u9593
# {longestReadTime} is a time period
FileReadRuleFactory_TEXT_OK=\u3053\u306E\u8A18\u9332\u5185\u306B\u3001\u9577\u671F\u306E\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u4E00\u6642\u4F11\u6B62\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F(\u6700\u9577\u306F{longestReadTime}\u3067\u3057\u305F)\u3002
FileReadRuleFactory_TEXT_NO_EVENTS=\u3053\u306E\u8A18\u9332\u306B\u306F\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u30A4\u30D9\u30F3\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
# {longestReadTime} is a time period
FileReadRuleFactory_TEXT_WARN=\u3053\u306E\u8A18\u9332\u306B\u306F\u3001\u9577\u671F\u306E\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u4E00\u6642\u4F11\u6B62\u304C\u3042\u308A\u307E\u3059(\u6700\u9577\u306F{longestReadTime}\u3067\u3059)\u3002
# {longestReadTime} is a time period, {longestReadPath} is a file path, {longestReadAmount} is a size in bytes
FileReadRuleFactory_TEXT_WARN_LONG=\u8A18\u9332\u3055\u308C\u305F\u6700\u9577\u306E\u30D5\u30A1\u30A4\u30EB\u8AAD\u53D6\u308A\u3067\u306F\u3001{longestReadPath}\u304B\u3089\u306E{longestReadAmount}\u306E\u8AAD\u53D6\u308A\u306B{longestReadTime}\u304B\u304B\u308A\u307E\u3057\u305F\u3002\u8A18\u9332\u3055\u308C\u305FIO\u306E\u5E73\u5747\u6642\u9593: {averageFileRead}\u3002\u8A18\u9332\u3055\u308C\u305FIO\u306E\u5408\u8A08\u6642\u9593: {totalFileRead}\u3002\u30D5\u30A1\u30A4\u30EB{longestReadPath}\u306B\u3064\u3044\u3066\u8A18\u9332\u3055\u308C\u305FIO\u306E\u5408\u8A08\u6642\u9593: {totalReadForLongest}\u3002
FileWriteRule_CONFIG_WARNING_LIMIT=\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u671F\u9593\u8B66\u544A\u5236\u9650
FileWriteRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u671F\u9593
FileWriteRuleFactory_RULE_NAME=\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u30D4\u30FC\u30AF\u671F\u9593
# {longestWriteTime} is a time period
FileWriteRuleFactory_TEXT_OK=\u3053\u306E\u8A18\u9332\u5185\u306B\u3001\u9577\u671F\u306E\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u4E00\u6642\u4F11\u6B62\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F(\u6700\u9577\u306F{longestWriteTime}\u3067\u3057\u305F)\u3002
FileWriteRuleFactory_TEXT_NO_EVENTS=\u3053\u306E\u8A18\u9332\u306B\u306F\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u30A4\u30D9\u30F3\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
# {longestWriteTime} is a time period
FileWriteRuleFactory_TEXT_WARN=\u3053\u306E\u8A18\u9332\u306B\u306F\u3001\u9577\u671F\u306E\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u4E00\u6642\u4F11\u6B62\u304C\u3042\u308A\u307E\u3059(\u6700\u9577\u306F{longestWriteTime}\u3067\u3059)\u3002
# {longestWriteTime} is a time period, {longestWritePath} is a file path, {longestWriteAmount} is a size in bytes
FileWriteRuleFactory_TEXT_WARN_LONG=\u8A18\u9332\u3055\u308C\u305F\u6700\u9577\u306E\u30D5\u30A1\u30A4\u30EB\u66F8\u8FBC\u307F\u3067\u306F\u3001{longestWritePath}\u3078\u306E{longestWriteAmount}\u306E\u66F8\u8FBC\u307F\u306B{longestWriteTime}\u304B\u304B\u308A\u307E\u3057\u305F\u3002\u8A18\u9332\u3055\u308C\u305FIO\u306E\u5E73\u5747\u6642\u9593: {averageFileWrite}\u3002\u8A18\u9332\u3055\u308C\u305FIO\u306E\u5408\u8A08\u6642\u9593: {totalFileWrite}\u3002\u30D5\u30A1\u30A4\u30EB{longestWritePath}\u306B\u3064\u3044\u3066\u8A18\u9332\u3055\u308C\u305FIO\u306E\u5408\u8A08\u6642\u9593: {totalWriteForLongest}\u3002
FlightRecordingSupportRule_RULE_NAME=\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u30B5\u30DD\u30FC\u30C8
FlightRecordingSupportRule_TEXT_OK=\u3053\u306E\u8A18\u9332\u306B\u4F7F\u7528\u3055\u308C\u305FJVM\u30D0\u30FC\u30B8\u30E7\u30F3\u306B\u306F\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u306E\u30D5\u30EB\u30FB\u30B5\u30DD\u30FC\u30C8\u304C\u3042\u308A\u307E\u3059\u3002
FlightRecordingSupportRule_EA_TEXT_WARN_SHORT=\u8A18\u9332\u306F\u521D\u671F\u30A2\u30AF\u30BB\u30B9\u30FB\u30D3\u30EB\u30C9\u3067\u884C\u308F\u308C\u3066\u3044\u307E\u3059\u3002
FlightRecordingSupportRule_EA_TEXT_WARN_LONG=\u3053\u306E\u8A18\u9332\u306FJRE ({jdkVersion})\u306E\u521D\u671F\u30A2\u30AF\u30BB\u30B9\u30FB\u30D3\u30EB\u30C9\u3067\u884C\u308F\u308C\u3066\u3044\u307E\u3059\u3002\u81EA\u52D5\u5206\u6790\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u306A\u3044\u305F\u3081\u3001\u8A18\u9332\u3092\u5206\u6790\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
FlightRecordingSupportRule_NO_JVM_VERSION_EVENTS_TEXT=JVM\u30D0\u30FC\u30B8\u30E7\u30F3\u60C5\u5831\u304C\u8A18\u9332\u3055\u308C\u305FVM\u60C5\u5831\u30A4\u30D9\u30F3\u30C8\u304C\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u3053\u306E\u30EB\u30FC\u30EB\u3092\u4F7F\u7528\u3059\u308B\u306B\u306F\u3001JVM\u60C5\u5831\u30A4\u30D9\u30F3\u30C8\u3092\u30AA\u30F3\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
FlightRecordingSupportRule_UNSUPPORTED_TEXT_WARN_SHORT=\u8A18\u9332\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u306A\u3044JRE\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u884C\u308F\u308C\u3066\u3044\u307E\u3059\u3002
FlightRecordingSupportRule_UNSUPPORTED_TEXT_WARN_LONG=\u3053\u306E\u8A18\u9332\u306F\u3001JDK Flight Recorder\u304CHotSpot\u3067\u5B8C\u5168\u306B\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u524D\u306EJRE\u30D0\u30FC\u30B8\u30E7\u30F3{jdkVersion}\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u3067\u884C\u308F\u308C\u3066\u3044\u307E\u3059\u30027u40\u3088\u308A\u524D\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u306F\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u306B\u3064\u3044\u3066\u90E8\u5206\u7684\u30B5\u30DD\u30FC\u30C8\u3057\u304B\u3042\u308A\u307E\u305B\u3093\u3002\u81EA\u52D5\u5206\u6790\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u306A\u3044\u305F\u3081\u3001\u3053\u306E\u8A18\u9332\u3092\u5206\u6790\u3057\u3088\u3046\u3068\u3059\u308B\u3068\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
JfrPeriodicEventsFixRule_RULE_NAME=JFR\u5B9A\u671F\u30A4\u30D9\u30F3\u30C8\u306E\u4FEE\u6B63
JfrPeriodicEventsFixRule_TEXT_OK=\u5229\u7528\u4E2D\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u306EJava\u306F\u3001\u5B9A\u671F\u30A4\u30D9\u30F3\u30C8\u306B\u95A2\u3059\u308B\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306E\u554F\u984C\u306E\u5F71\u97FF\u3092\u53D7\u3051\u307E\u305B\u3093\u3002
JfrPeriodicEventsFixRule_NO_JVM_VERSION_EVENTS_TEXT=JVM\u30D0\u30FC\u30B8\u30E7\u30F3\u60C5\u5831\u3092\u542B\u3080VM\u60C5\u5831\u30A4\u30D9\u30F3\u30C8\u306E\u8A18\u9332\u304C\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u3053\u306E\u30EB\u30FC\u30EB\u3092\u4F7F\u7528\u3059\u308B\u306B\u306FJVM\u60C5\u5831\u30A4\u30D9\u30F3\u30C8\u3092\u6709\u52B9\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
JfrPeriodicEventsFixRule_TEXT_WARN_SHORT=\u5229\u7528\u4E2D\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u306EOpenJDK 8\u306F\u3001\u91CD\u8981\u306A\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u4FEE\u6B63\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002
# {jdkVersion} is a string
JfrPeriodicEventsFixRule_TEXT_WARN_LONG=\u5229\u7528\u4E2D\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u306EOpenJDK({jdkVersion})\u306B\u306F\u3001\u91CD\u8981\u306A\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u4FEE\u6B63\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002\u30D0\u30FC\u30B8\u30E7\u30F38u302\u4EE5\u964D\u306B\u30A2\u30C3\u30D7\u30B0\u30EC\u30FC\u30C9\u3059\u308B\u3068\u3001\u5834\u5408\u306B\u3088\u3063\u3066\u306F\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u304C\u8457\u3057\u304F\u6539\u5584\u3055\u308C\u307E\u3059\u3002\u8A73\u7D30\u306B\u3064\u3044\u3066\u306F\u3001JDK-8266723\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u5225\u306E\u9078\u629E\u80A2\u3068\u3057\u3066\u306F\u3001NativeExecutionSample\u30A4\u30D9\u30F3\u30C8\u306A\u3069\u306E\u4E0D\u8981\u306A\u5B9A\u671F\u30A4\u30D9\u30F3\u30C8\u3092\u7121\u52B9\u5316\u3059\u308B\u3053\u3068\u3082\u3067\u304D\u307E\u3059\u3002

FullGcRule_RULE_NAME=G1/CMS\u306E\u5B8C\u5168\u306A\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3
FullGcRule_OTHER_COLLECTOR_IN_USE=\u3053\u306E\u30EB\u30FC\u30EB\u306F\u3001CMS\u304A\u3088\u3073G1\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u306B\u5BFE\u3057\u3066\u306E\u307F\u6709\u52B9\u3067\u3059\u304C\u3001\u3053\u306EJVM\u3067\u306F\u3069\u3061\u3089\u3082\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
FullGcRule_FULL_GC_OCCURRED_TITLE=\u30D5\u30EBGC\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
FullGcRule_FULL_GC_OCCURRED_DESC=\u3053\u306E\u8A18\u9332\u4E2D\u306B\u3001\u5C11\u306A\u304F\u3068\u3082\u4E00\u5EA6\u3001Stop-The-World\u578B\u306E\u30D5\u30EB\u30FB\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002CMS\u304A\u3088\u3073G1\u30B3\u30EC\u30AF\u30BF\u3067\u306F\u3001\u30D5\u30EBGC\u30A4\u30D9\u30F3\u30C8\u306F\u3001\u5F37\u529B\u306A\u30DE\u30A4\u30CA\u30B9\u306E\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u30FB\u30A4\u30F3\u30C7\u30A3\u30B1\u30FC\u30BF\u3067\u3059\u3002\u30C1\u30E5\u30FC\u30CB\u30F3\u30B0\u53EF\u80FD\u306AGC\u30D1\u30E9\u30E1\u30FC\u30BF\u3092\u4F7F\u7528\u3059\u308B\u3068\u3001\u30B3\u30EC\u30AF\u30BF\u3092\u4E26\u884C\u30E2\u30FC\u30C9\u3067\u52D5\u4F5C\u3055\u305B\u308B\u3053\u3068\u304C\u3067\u304D\u3001Stop-The-World\u578B\u306E\u4E00\u6642\u4F11\u6B62\u3092\u56DE\u907F\u3057\u305F\u308A\u3001GC\u3084\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u3092\u5411\u4E0A\u3055\u305B\u305F\u308A\u3059\u308B\u3053\u3068\u304C\u53EF\u80FD\u306B\u306A\u308A\u307E\u3059\u3002
FullGcRule_NO_FULL_GC_OCCURRED=Stop-the-World\u578B\u306E\u30D5\u30EBGC\u30A4\u30D9\u30F3\u30C8\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002

GarbageCollectionInfo_RULE_NAME=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u60C5\u5831
GcFreedRatioRule_RULE_NAME=GC\u89E3\u653E\u7387
GcFreedRatioRule_GC_FREED_RATIO_INFO_LIMIT=\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u30FB\u30B5\u30A4\u30BA\u60C5\u5831\u5236\u9650\u3068\u6BD4\u8F03\u3057\u305F\u30011\u79D2\u5F53\u305F\u308A\u306B\u89E3\u653E\u3055\u308C\u305F\u30E1\u30E2\u30EA\u30FC
GcFreedRatioRule_GC_FREED_RATIO_INFO_LIMIT_DESC=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306B\u3088\u308A1\u79D2\u5F53\u305F\u308A\u306B\u89E3\u653E\u3055\u308C\u305F\u30E1\u30E2\u30EA\u30FC\u306E\u91CF\u3068\u3001\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u3092\u6BD4\u8F03\u3057\u305F\u3068\u304D\u306E\u6BD4\u7387\u3002
GcFreedRatioRule_WINDOW_SIZE=\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
GcFreedRatioRule_WINDOW_SIZE_DESC=\u30EB\u30FC\u30EB\u306E\u8A55\u4FA1\u6642\u306B\u4F7F\u7528\u3059\u308B\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA\u3002
GcFreedRatioRule_FEW_GCS_LIMIT=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u5236\u9650\u304C\u5C11\u306A\u3059\u304E\u307E\u3059
GcFreedRatioRule_FEW_GCS_LIMIT_DESC=\u30EB\u30FC\u30EB\u306E\u8A08\u7B97\u306B\u95A2\u9023\u6027\u3092\u6301\u305F\u305B\u308B\u305F\u3081\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u6700\u5C0F\u6570\u3002
# {heapSummarys} is a count, # {few.gcs.limit} is a count
GcFreedRatioRule_RESULT_FEW_GCS=\u691C\u51FA\u3055\u308C\u305F\u30D2\u30FC\u30D7\u30FB\u30B5\u30DE\u30EA\u30FC\u30FB\u30A4\u30D9\u30F3\u30C8\u304C{heapSummarys}\u4EF6\u306E\u307F\u3067\u3057\u305F\u3002\u95A2\u9023\u6027\u306E\u3042\u308B\u7D50\u679C\u3092\u8A08\u7B97\u3059\u308B\u305F\u3081\u306B\u3001\u3053\u306E\u30EB\u30FC\u30EB\u306B\u306F\u3001\u5C11\u306A\u304F\u3068\u3082{few.gcs.limit}\u4EF6\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u5FC5\u8981\u3067\u3059\u3002\u8A18\u9332\u4E2D\u306B\u3001\u308F\u305A\u304B\u306A\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3057\u304B\u767A\u751F\u3057\u306A\u304B\u3063\u305F\u3088\u3046\u3067\u3059\u3002\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u304C\u5C11\u306A\u3044\u306E\u306F\u3001\u4E00\u822C\u7684\u306B\u3088\u3044\u5146\u5019\u3067\u3059\u3002
GcFreedRatioRule_RESULT_OK=\u3053\u308C\u306F\u9069\u5EA6\u306A\u91CF\u3067\u3059\u3002
GcFreedRatioRule_RESULT_NOT_OK=\u3053\u308C\u306F\u904E\u5270\u306A\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
# {gcFreedRatio} is a number
GcFreedRatioRule_RESULT_SHORT_DESCRIPTION=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306B\u3088\u308A1\u79D2\u5F53\u305F\u308A\u306B\u89E3\u653E\u3055\u308C\u305F\u30E1\u30E2\u30EA\u30FC\u3068\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u306E\u6BD4\u7387\u306F{gcFreedRatio}\u3067\u3059\u3002
# {gcFreedPerSecond} is a memory amount, {gcWindoow} is a timerange, {averageLiveset} is a memory amount
GcFreedRatioRule_RESULT_LONG_DESCRIPTION={gcWindoow}\u306E\u9593\u3001\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306B\u3088\u308A1\u79D2\u5F53\u305F\u308A{gcFreedPerSecond}\u304C\u89E3\u653E\u3055\u308C\u307E\u3057\u305F\u3002\u5E73\u5747\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u306F\u3001{averageLiveset}\u3067\u3057\u305F\u3002
GcFreedRatioRule_RESULT_MORE_INFO=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u3067\u5927\u91CF\u306E\u30E1\u30E2\u30EA\u30FC\u3092\u89E3\u653E\u3067\u304D\u308B\u5834\u5408\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u3088\u308A\u3001\u5B58\u7D9A\u6642\u9593\u306E\u77ED\u3044\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u591A\u6570\u5272\u308A\u5F53\u3066\u3089\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u5272\u5F53\u3066\u306E\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u8ABF\u67FB\u3057\u3066\u3001\u5927\u90E8\u5206\u306E\u5272\u5F53\u3066\u306E\u539F\u56E0\u3068\u306A\u3063\u3066\u3044\u308B\u30B3\u30FC\u30C9\u30FB\u30D1\u30B9\u3092\u63A2\u3057\u3001\u305D\u3057\u3066\u305D\u308C\u3089\u3092\u524A\u6E1B\u3067\u304D\u306A\u3044\u304B\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
GcPauseRatioRule_INFO_LIMIT=GC\u4E00\u6642\u4F11\u6B62\u7387\u60C5\u5831\u5236\u9650
GcPauseRatioRule_INFO_LIMIT_DESC=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u306B\u304A\u3051\u308B\u3001GC\u4E00\u6642\u4F11\u6B62\u3068\u5B9F\u884C\u6642\u9593\u306E\u6BD4\u7387
GcPauseRatioRule_WARNING_LIMIT=GC\u4E00\u6642\u4F11\u6B62\u7387\u8B66\u544A\u5236\u9650
GcPauseRatioRule_WARNING_LIMIT_DESC=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u306A\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u306B\u304A\u3051\u308B\u3001GC\u4E00\u6642\u4F11\u6B62\u3068\u5B9F\u884C\u6642\u9593\u306E\u6BD4\u7387
GcPauseRatioRule_WINDOW_SIZE=GC\u4E00\u6642\u4F11\u6B62\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
GcPauseRatioRule_WINDOW_SIZE_DESC=\u30EB\u30FC\u30EB\u306E\u8A55\u4FA1\u6642\u306B\u4F7F\u7528\u3055\u308C\u308B\u6642\u9593\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
GcPauseRatioRule_RULE_NAME=GC\u306E\u4F11\u6B62
GcPauseRatioRule_RULE_TEXT=GC\u4E00\u6642\u4F11\u6B62\u306B\u3088\u308A\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u52B9\u7387\u306B\u5F71\u97FF\u304C\u3042\u308A\u307E\u3057\u305F\u3002
# {gcPauseRatioWindow} is a percentage, {gcPauseWindow} is a timerange, {gcPauseRatio} is a percentage
GcPauseRatioRule_RULE_TEXT_LONG={gcPauseWindow}\u306E\u9593\u3001\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u4E00\u6642\u4F11\u6B62\u3068\u5B9F\u884C\u6642\u9593\u306E\u6700\u3082\u9AD8\u3044\u6BD4\u7387\u306F{gcPauseRatioWindow}\u3067\u3057\u305F\u3002\u8A18\u9332\u5168\u4F53\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u4E00\u6642\u4F11\u6B62\u7387\u306F\u3001{gcPauseRatio}\u3067\u3057\u305F\u3002
GcPauseRatioRule_RULE_TEXT_RECOMMENDATION=\u4E00\u6642\u4F11\u6B62\u56DE\u6570\u306F\u3001\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA\u306E\u5897\u52A0\u3084\u3001\u5272\u5F53\u3066\u524A\u6E1B\u306E\u8A66\u884C\u306B\u3088\u3063\u3066\u6E1B\u3089\u305B\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
GcPauseRatioRule_RULE_TEXT_OK=GC\u4E00\u6642\u4F11\u6B62\u306B\u3088\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u52B9\u7387\u3078\u306E\u5F71\u97FF\u306F\u5927\u304D\u304F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002

GcLockerRule_CONFIG_WARNING_LIMIT=GC\u30ED\u30C3\u30AB\u30FC\u7387\u5236\u9650
GcLockerRule_CONFIG_WARNING_LIMIT_LONG=GC\u30ED\u30C3\u30AB\u30FC\u304C\u539F\u56E0\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u6570\u3068\u5408\u8A08\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u9593\u306E\u8B66\u544A\u5236\u9650\u7387
GcLockerRule_TEXT_NA=GC\u60C5\u5831\u30A4\u30D9\u30F3\u30C8\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
GcLockerRuleFactory_RULE_NAME=GC\u30ED\u30C3\u30AB\u30FC\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u305FGC
# {gcLockerRatio} is a percentage
GcLockerRuleFactory_TEXT_INFO=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E{gcLockerRatio}\u304CGC\u30ED\u30C3\u30AB\u30FC\u306E\u5F71\u97FF\u306B\u3088\u308B\u3082\u306E\u3067\u3057\u305F\u3002
GcLockerRuleFactory_TEXT_INFO_LONG=GC\u30ED\u30C3\u30AB\u30FC\u306E\u5F71\u97FF\u306B\u3088\u308B\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306F\u3001\u30E9\u30F3\u30BF\u30A4\u30E0\u304C(\u304A\u305D\u3089\u304F)\u6587\u5B57\u5217\u6216\u3044\u306F\u914D\u5217\u3078\u306E\u76F4\u63A5\u30A2\u30AF\u30BB\u30B9\u3092\u5F97\u308B\u305F\u3081\u306B(JNI Get*Critical\u3092\u4F7F\u7528\u3059\u308B)JNI\u30B3\u30FC\u30C9\u3092\u5B9F\u884C\u3057\u305F\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002\u3044\u304F\u3064\u304B\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u306F\u3001\u51E6\u7406\u3092\u7D9A\u884C\u3059\u308B\u524D\u306B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u958B\u653E\u3092\u5FC5\u8981\u3068\u3057\u307E\u3059\u3002\u3053\u308C\u304C\u5927\u304D\u306A\u554F\u984C\u3068\u306A\u308B\u5834\u5408\u306F\u3001\u3053\u306E\u6319\u52D5\u3092\u5FC5\u8981\u3068\u3059\u308B(JNI)\u30B3\u30FC\u30C9\u3078\u306E\u4F9D\u5B58\u3092\u907F\u3051\u308B\u304B\u3001\u3053\u308C\u3092\u3088\u308A\u4E01\u5BE7\u306B\u5BFE\u51E6\u3059\u308B(\u4F8B\u3048\u3070\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u56FA\u5B9A\u3057\u305F\u308A\u3001\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u5B58\u5728\u3059\u308B\u30E1\u30E2\u30EA\u9818\u57DF\u3092\u56FA\u5B9A\u3057\u305F\u308A\u3059\u308B)\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3078\u5909\u66F4\u3057\u3066\u304F\u3060\u3055\u3044\u3002
GcLockerRuleFactory_TEXT_OK=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306BGC\u30ED\u30C3\u30AB\u30FC\u306E\u5F71\u97FF\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
GcStallRule_RULE_NAME=GC\u505C\u6B62
GcStallRule_TEXT_OK=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u304C\u30EF\u30FC\u30AF\u30ED\u30FC\u30C9\u3092\u7DAD\u6301\u3067\u304D\u306A\u304B\u3063\u305F\u3068\u3044\u3046\u6307\u6A19\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F
General_CONFIG_CLASS_LIMIT=\u30AF\u30E9\u30B9\u5236\u9650
General_CONFIG_CLASS_LIMIT_LONG=\u30EC\u30DD\u30FC\u30C8\u3059\u308B\u8B66\u544A\u5236\u9650\u3092\u8D85\u3048\u3066\u3044\u308B\u30AF\u30E9\u30B9\u306E\u6700\u5927\u6570\u3002
General_NO_STACK_TRACE_AVAILABLE=<\u4F7F\u7528\u53EF\u80FD\u306A\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u306F\u3042\u308A\u307E\u305B\u3093>
General_RULE_REQUIRES_EVENTS_FROM_ONE_OF_MANY=\u3053\u306E\u30EB\u30FC\u30EB\u3067\u306F\u3001\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u306E\u3044\u305A\u308C\u304B\u304B\u3089\u30A4\u30D9\u30F3\u30C8\u3092\u4F7F\u7528\u3067\u304D\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059: {0}\u3002
General_TEXT_COULD_NOT_DETERMINE_JAVA_VERSION=Java\u30D0\u30FC\u30B8\u30E7\u30F3\u3092\u7279\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
General_UNKNOWN_ADDRESS=<\u4E0D\u660E\u306A\u30A2\u30C9\u30EC\u30B9>
General_UNKNOWN_FILE_NAME=<\u4E0D\u660E\u306A\u30D5\u30A1\u30A4\u30EB>
HeapContentRule_AGGR_CLASS_SCORE=\u30AF\u30E9\u30B9\u30FB\u30B9\u30B3\u30A2
HeapContentRuleFactory_RULE_NAME=\u30D2\u30FC\u30D7\u306E\u5185\u5BB9
HeapContentRuleFactory_TEXT_INFO=\u307B\u3068\u3093\u3069\u306E\u30D2\u30FC\u30D7\u306F\u5C11\u6570\u306E\u30AF\u30E9\u30B9\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F\u3002
HeapContentRuleFactory_TEXT_INFO_LONG=\u30D2\u30FC\u30D7\u4F7F\u7528\u91CF\u3092\u524A\u6E1B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u5834\u5408\u306F\u3001\u3053\u3053\u304B\u3089\u958B\u59CB\u3059\u308B\u3053\u3068\u3092\u304A\u85A6\u3081\u3057\u307E\u3059\u3002
HeapContentRuleFactory_TEXT_OK=\u30D2\u30FC\u30D7\u306E\u5185\u5BB9\u306B\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
HeapInspectionGcRuleFactory_RULE_NAME=\u30D2\u30FC\u30D7\u691C\u67FB\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u305FGC
HeapDumpRule_RULE_NAME=\u30D2\u30FC\u30D7\u30FB\u30C0\u30F3\u30D7
HeapDumpRule_TEXT_INFO={heapDumps}\u56DE\u306E\u30D2\u30FC\u30D7\u30FB\u30C0\u30F3\u30D7\u304C\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002
HeapDumpRule_TEXT_OK=\u30D2\u30FC\u30D7\u30FB\u30C0\u30F3\u30D7\u306F\u5B9F\u884C\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
# {0} is a number
HeapInspectionGcRuleFactory_TEXT_INFO=JVM\u306F{objectCountGCs}\u56DE\u306E\u30D2\u30FC\u30D7\u691C\u67FB\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3092\u5B9F\u884C\u3057\u307E\u3057\u305F\u3002
HeapInspectionGcRuleFactory_TEXT_INFO_LONG=\u30D2\u30FC\u30D7\u691C\u67FB\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5B9F\u884C\u306F\u4E00\u822C\u7684\u306B\u9577\u3044\u6642\u9593\u3092\u8981\u3059\u308B\u305F\u3081\u3001\u554F\u984C\u3068\u306A\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
HeapInspectionGcRuleFactory_TEXT_INFO_LONG_JFR=\u3053\u308C\u3089\u306E\u691C\u67FB\u306E\u4E00\u90E8\u306F'\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u6570' JFR\u30A4\u30D9\u30F3\u30C8\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u3001\u305D\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u6709\u52B9\u306A\u3059\u3079\u3066\u306E\u8A18\u9332\u306E\u6700\u521D\u304A\u3088\u3073\u6700\u5F8C\u3067\u30D5\u30EB\u30FB\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3092\u30C8\u30EA\u30AC\u30FC\u3057\u307E\u3059\u3002\u5FC5\u8981\u306A\u3068\u304D\u306E\u307F\u8A18\u9332\u304C\u4F5C\u6210\u3055\u308C\u308B\u5834\u5408\u3084\u3001\u3042\u307E\u308A\u983B\u7E41\u306B\u4F5C\u6210\u3055\u308C\u306A\u3044\u5834\u5408\u3001\u7D50\u679C\u3068\u3057\u3066\u751F\u3058\u308B\u4E00\u6642\u4F11\u6B62\u306F\u901A\u5E38\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u52D5\u4F5C\u306B\u542B\u307E\u308C\u306A\u3044\u305F\u3081\u3001\u3053\u308C\u3089\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306F\u3001\u554F\u984C\u306B\u306A\u3089\u306A\u3044\u306E\u304C\u4E00\u822C\u7684\u3067\u3059\u3002\u81EA\u52D5\u30B9\u30AF\u30EA\u30D7\u30C8\u306A\u3069\u3067\u8A18\u9332\u304C\u983B\u7E41\u306B\u53CE\u96C6\u3055\u308C\u308B\u5834\u5408\u3001\u307E\u305F\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u4E00\u6642\u4F11\u6B62\u306E\u5F71\u97FF\u3092\u53D7\u3051\u308B\u5834\u5408\u306F\u3001\u554F\u984C\u306B\u306A\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u305D\u306E\u5834\u5408\u306F\u3001'\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u6570'\u30A4\u30D9\u30F3\u30C8\u306E\u7121\u52B9\u5316\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
HeapInspectionGcRuleFactory_TEXT_OK=JVM\u306F\u30D2\u30FC\u30D7\u691C\u67FB\u306EGC\u3092\u5B9F\u884C\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
HeapInspectionGcRuleFactory_TEXT_OK_LONG=\u5B9F\u884C\u306F\u4E00\u822C\u7684\u306B\u9577\u6642\u9593\u3092\u8981\u3059\u308B\u305F\u3081\u3001\u3053\u308C\u306F\u9069\u5207\u3067\u3059\u3002
HeapInspectionRule_CONFIG_WARNING_LIMIT=\u30D2\u30FC\u30D7\u691C\u67FBGC\u5236\u9650
HeapInspectionRule_CONFIG_WARNING_LIMIT_LONG=\u30D2\u30FC\u30D7\u691C\u67FB\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u6570\u3068\u5408\u8A08\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u9593\u306E\u8B66\u544A\u5236\u9650\u7387
HighGcRuleFactory_RULE_NAME=GC\u30D7\u30EC\u30C3\u30B7\u30E3
# {pauseTime} is a percentage, {pauseCluster} is a time range
HighGcRuleFactory_TEXT_INFO=JVM\u306F{pauseCluster}\u306E\u9593\u306E{pauseTime}\u306E\u9593\u3001\u4E00\u6642\u4F11\u6B62\u3057\u307E\u3057\u305F\u3002
HighGcRuleFactory_TEXT_INFO_LONG=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5B9F\u884C\u306B\u8CBB\u3084\u3055\u308C\u308B\u6642\u9593\u306F\u3001\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA\u306E\u5897\u52A0\u3084\u3001\u5272\u5F53\u3066\u524A\u6E1B\u306E\u8A66\u884C\u306B\u3088\u3063\u3066\u524A\u6E1B\u3067\u304D\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
HighGcRuleFactory_TEXT_OK=\u30E9\u30F3\u30BF\u30A4\u30E0\u3067\u306F\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5B9F\u884C\u306B\u591A\u304F\u306E\u6642\u9593\u306F\u8CBB\u3084\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
HighJvmCpuRule_AGGR_MAX_ENDTIME=\u6700\u5927\u7D42\u4E86\u6642\u9593
HighJvmCpuRule_AGGR_MIN_ENDTIME=\u6700\u5C0F\u7D42\u4E86\u6642\u9593
HighJvmCpuRule_CONFIG_CPU_INFO_LIMIT=JVM CPU\u4F7F\u7528\u7387\u60C5\u5831\u5236\u9650
HighJvmCpuRule_CONFIG_CPU_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u3001JVM\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308BCPU\u91CF
HighJvmCpuRule_CONFIG_MIN_CPU_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u6700\u5C0FCPU\u8CA0\u8377\u671F\u9593
HighJvmCpuRule_CONFIG_MIN_CPULOAD=\u6700\u5C0FCPU\u8CA0\u8377\u671F\u9593
HighJvmCpuRule_CONFIG_SAMPLE_LIMIT=\u6B20\u843D\u30B5\u30F3\u30D7\u30EB\u5236\u9650
HighJvmCpuRule_CONFIG_SAMPLE_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u6700\u5C0F\u6B20\u843D\u30B5\u30F3\u30D7\u30EB
HighJvmCpuRule_FEW_SAMPLES=\u3053\u306E\u8A18\u9332\u306B\u306F\u3001CPU\u8CA0\u8377\u304C\u9AD8\u3044\u5834\u5408\u3067\u3082\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u30FB\u30B5\u30F3\u30D7\u30EB\u304C\u307B\u3068\u3093\u3069\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002
HighJvmCpuRule_FEW_SAMPLES_LONG=\u3053\u306E\u3088\u3046\u306B\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u30FB\u30C7\u30FC\u30BF\u306F\u95A2\u9023\u3057\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u5927\u91CF\u306EJNI\u30B3\u30FC\u30C9\u3092\u5B9F\u884C\u3057\u3066\u3044\u308B\u3001\u307E\u305F\u306FJVM\u304CGC\u3001\u30AF\u30E9\u30B9\u30FB\u30ED\u30FC\u30C7\u30A3\u30F3\u30B0\u3001JIT\u30B3\u30F3\u30D1\u30A4\u30EB\u306A\u3069\u306B\u9577\u6642\u9593\u3092\u8CBB\u3084\u3057\u3066\u3044\u308B\u3053\u3068\u304C\u539F\u56E0\u3067\u3042\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
HighJvmCpuRule_LONG_CPU_LOAD_PERIOD=\u3053\u306E\u8A18\u9332\u306B\u306F\u3001'CPU\u8CA0\u8377'\u30A4\u30D9\u30F3\u30C8\u306B\u5BFE\u3059\u308B\u9AD8\u3044\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u671F\u9593\u304C\u3042\u308A\u307E\u3059\u3002
# {0} is a time period
HighJvmCpuRule_LONG_CPU_LOAD_PERIOD_LONG=''CPU\u8CA0\u8377''\u30A4\u30D9\u30F3\u30C8\u306E\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u671F\u9593\u304C{0}\u306B\u8A2D\u5B9A\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u3053\u308C\u306F\u9AD8\u3059\u304E\u3066CPU\u8CA0\u8377\u95A2\u9023\u306E\u30EB\u30FC\u30EB\u304C\u6A5F\u80FD\u3057\u307E\u305B\u3093\u3002
HighJvmCpuRule_RULE_NAME=\u9AD8\u3044JVM CPU\u8CA0\u8377
HighJvmCpuRule_TEXT_OK=JVM\u304C\u3001CPU\u8CA0\u8377\u3092\u9AD8\u304F\u3059\u308B\u3053\u3068\u306F\u306A\u3044\u3088\u3046\u3067\u3059\u3002
HighJvmCpuRule_TEXT_WARN=JVM\u306F\u5927\u91CF\u306ECPU\u3092\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002
HotMethodsRuleFactory_NOT_ENOUGH_SAMPLES=\u30B9\u30B3\u30A2\u3092\u8A08\u7B97\u3059\u308B\u306E\u306B\u5341\u5206\u306A\u5B9F\u884C\u30B5\u30F3\u30D7\u30EB\u3092\u62BD\u51FA\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u8CA0\u8377\u3092\u5897\u3084\u3059\u304B\u3001\u30B5\u30F3\u30D7\u30EB\u671F\u9593\u3092\u77ED\u304F\u3059\u308B\u304B\u3001\u8A18\u9332\u6642\u9593\u3092\u9577\u304F\u3059\u308B\u3053\u3068\u3067\u3001\u3088\u308A\u591A\u304F\u306E\u30B5\u30F3\u30D7\u30EB\u306E\u751F\u6210\u3092\u8A66\u884C\u3057\u3066\u304F\u3060\u3055\u3044\u3002
# {mostInterestingMethod} is a method name, {ratioOfAllPossibleSamples} is a percentage, {mostInterestingWindow} is a duration of time, {ratioOfSamples} is a percentage
HotMethodsRuleFactory_TEXT_INFO=\u6700\u3082\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3055\u308C\u305F\u30E1\u30BD\u30C3\u30C9\u306F{mostInterestingMethod}\u3067\u3001{mostInterestingWindow}\u306E\u9593\u306B\u60F3\u5B9A\u3055\u308C\u308B\u6700\u5927\u306E\u30B5\u30F3\u30D7\u30EB\u306E{ratioOfAllPossibleSamples}\u3067\u3001\u5B9F\u969B\u306E\u30B5\u30F3\u30D7\u30EB\u306E{ratioOfSamples}\u3067\u3057\u305F\u3002
# {interestingMethods} is a list of method profiling results, {mostInterestingStackTrace} is the hottest stack trace
HotMethodsRuleFactory_TEXT_INFO_LONG=\u6B21\u306E\u30E1\u30BD\u30C3\u30C9\u306F\u3001\u6700\u3082CPU\u3092\u4F7F\u7528\u3057\u307E\u3057\u305F: {interestingMethods}\n\u6700\u3082\u983B\u7E41\u306A\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u6B21\u306B\u793A\u3057\u307E\u3059: {mostInterestingStackTrace}
HotMethodsRuleFactory_TEXT_SOLUTION=\u305D\u308C\u3089\u306E\u30B3\u30FC\u30C9\u306E\u6700\u9069\u5316\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
HotMethodsRuleFactory_TEXT_OK=\u6700\u9069\u5316\u3067\u7279\u306B\u52B9\u679C\u304C\u73FE\u308C\u308B\u30E1\u30BD\u30C3\u30C9\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
IgnoreUnrecognizedVMOptionsRuleFactory_TEXT_INFO=JVM\u306F\u8A8D\u8B58\u3055\u308C\u306A\u3044VM\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u7121\u8996\u3057\u307E\u3057\u305F\u3002
IgnoreUnrecognizedVMOptionsRuleFactory_TEXT_INFO_LONG=\u8A8D\u8B58\u3055\u308C\u306A\u3044VM\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u7121\u8996\u3057\u305FJVM\u3067\u8A18\u9332\u304C\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u3001\u7121\u52B9\u306AVM\u30D5\u30E9\u30B0\u306E\u5B58\u5728\u306E\u78BA\u8A8D\u304C\u884C\u308F\u308C\u306A\u304B\u3063\u305F\u3053\u3068\u3092\u610F\u5473\u3057\u307E\u3059\u3002\u3064\u307E\u308A\u3001\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u3068\u601D\u3063\u3066\u3044\u3066\u3082\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044VM\u52D5\u4F5C\u304C\u5B58\u5728\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u5B9F\u884C\u4E2D\u306EVM\u3067\u305D\u308C\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u3053\u3068\u3001\u307E\u305F\u306F\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30B9\u30DA\u30EB\u304C\u9593\u9055\u3063\u3066\u3044\u308B\u3053\u3068\u304C\u539F\u56E0\u3068\u8003\u3048\u3089\u308C\u307E\u3059\u3002\u5FC5\u8981\u306A\u5834\u5408\u3092\u9664\u304D\u3001'-XX:+IgnoreUnrecognizedVMOptions'\u30B3\u30DE\u30F3\u30C9\u884C\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u4F7F\u7528\u3057\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002
# {0} is an object type with a field name, {1} is a number, {2} is another object type with a field name
IncreasingLiveSetRule_LOADED_CLASSES_PERCENT=\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9
IncreasingLiveSetRule_LOADED_CLASSES_PERCENT_DESC=\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9\u306E\u30D1\u30FC\u30BB\u30F3\u30C6\u30FC\u30B8\u3002\u30A6\u30A9\u30FC\u30E0\u30A2\u30C3\u30D7\u30FB\u30D5\u30A7\u30FC\u30BA\u304C\u5B8C\u4E86\u3057\u305F\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002\u30EB\u30FC\u30EB\u3067\u306F\u3001\u3053\u306E\u91CF\u306E\u30AF\u30E9\u30B9\u304C\u30ED\u30FC\u30C9\u3055\u308C\u308B\u524D\u306B\u884C\u308F\u308C\u305F\u5272\u5F53\u3066\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
IncreasingLiveSetRule_TEXT_INFO_BALANCED=\u305D\u306E\u4ED6\u306E\u30AF\u30E9\u30B9\u3088\u308A\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u3066\u3044\u308B\u3068\u601D\u308F\u308C\u308B\u7279\u5B9A\u306E\u30AF\u30E9\u30B9\u306F\u3042\u308A\u307E\u305B\u3093\u3002
IncreasingLiveSetRule_TEXT_INFO_LONG='GC\u30EB\u30FC\u30C8\u3078\u306E\u30C8\u30EC\u30FC\u30B9\u30FB\u30D1\u30B9'\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u6709\u52B9\u5316\u3057\u3066\u30C0\u30F3\u30D7\u3092\u5B9F\u884C\u3059\u308B\u3068\u3001\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30FC\u30AF\u306E\u53EF\u80FD\u6027\u3092\u3088\u308A\u8A73\u7D30\u306B\u5206\u6790\u3067\u304D\u307E\u3059\u3002
# {postWarmupTime} is a timestamp
IncreasingLiveSetRule_TEXT_INFO_NO_CANDIDATES=\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30FC\u30AF\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u3053\u308C\u306F\u3001\u60F3\u5B9A\u3055\u308C\u308B\u3059\u3079\u3066\u306E\u5019\u88DC\u304C\u8A2D\u5B9A\u3055\u308C\u305F\u3057\u304D\u3044\u5024\u3092\u4E0B\u56DE\u3063\u3066\u3044\u308B\u3053\u3068\u306B\u3088\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u307E\u305F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u3088\u308A\u5B58\u7D9A\u671F\u9593\u306E\u9577\u3044\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u5927\u91CF\u306B\u5272\u308A\u5F53\u3066\u3089\u308C\u308B\u3053\u3068\u306F\u3053\u308C\u4EE5\u964D\u306A\u3044\u3068\u30EB\u30FC\u30EB\u304C\u60F3\u5B9A\u3057\u305F{postWarmupTime}\u3088\u308A\u5F8C\u306B\u3001\u5B58\u7D9A\u6642\u9593\u306E\u9577\u3044\u5272\u5F53\u3066\u304C\u767A\u751F\u3057\u305F\u3053\u3068\u306B\u3088\u308B\u507D\u967D\u6027\u306E\u53EF\u80FD\u6027\u3082\u3042\u308A\u307E\u3059\u3002
IncreasingLiveSetRule_TEXT_INFO_UNBALANCED=\u305D\u306E\u4ED6\u306E\u30AF\u30E9\u30B9\u3088\u308A\u30EA\u30FC\u30AF\u304C\u767A\u751F\u3057\u3066\u3044\u308B\u3068\u601D\u308F\u308C\u308B\u30AF\u30E9\u30B9\u304C\u8907\u6570\u3042\u308A\u307E\u3059\u3002
IncreasingLiveSetRule_TEXT_OK=\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30FC\u30AF\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
IncreasingLiveSetRule_RELEVANCE_THRESHOLD=\u30EA\u30FC\u30AF\u5019\u88DC\u95A2\u9023\u6027\u3057\u304D\u3044\u5024
IncreasingLiveSetRule_RELEVANCE_THRESHOLD_DESC=\u30E9\u30A4\u30D6\u30FB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30FC\u30AF\u3068\u307F\u306A\u3059\u304B\u3069\u3046\u304B\u306E\u5224\u65AD\u306B\u4F7F\u7528\u3059\u308B\u8A08\u7B97\u6E08\u306E\u95A2\u9023\u6027\u3057\u304D\u3044\u5024\u3002
IncreasingLiveSetRule_YOUNG_COLLECTION_THRESHOLD=\u82E5\u3044\u4E16\u4EE3\u306E\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u3057\u304D\u3044\u5024
IncreasingLiveSetRule_YOUNG_COLLECTION_THRESHOLD_DESC=\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u306E\u50BE\u5411\u3092\u8A55\u4FA1\u3059\u308B\u305F\u3081\u306B\u5FC5\u8981\u306A\u82E5\u3044\u4E16\u4EE3\u306E\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u6700\u5C0F\u56DE\u6570\u3002
IncreasingLiveSetRule_ELLIPSIS=...
# {leakCandidateCount} is a number, {leakCandidates} is a list
IncreasingLiveSetRule_LEAK_CANDIDATES=\u53C2\u7167\u30C4\u30EA\u30FC\u306E\u5206\u6790\u3067\u3001{leakCandidateCount}\u4EF6\u306E\u306E\u30EA\u30FC\u30AF\u5019\u88DC\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002\u4E3B\u306A\u5019\u88DC\u306F{leakCandidate}\u3067\u3059\u3002\n\u6B21\u306E\u30C1\u30A7\u30FC\u30F3\u306B\u3088\u3063\u3066\u53C2\u7167\u3055\u308C\u3066\u3044\u307E\u3059: {referenceChain}\n 
IncreasingLiveSetRuleFactory_RULE_NAME=\u30D2\u30FC\u30D7\u306E\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u50BE\u5411
# {livesetIncrease} is a number denoted in Mebibytes per second
IncreasingLiveSetRuleFactory_TEXT_INFO=\u30D2\u30FC\u30D7\u306E\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u304C\u3001\u8A18\u9332\u4E2D\u306B1\u79D2\u5F53\u305F\u308A\u7D04{livesetIncrease}\u306E\u30B9\u30D4\u30FC\u30C9\u3067\u5897\u52A0\u3057\u3066\u3044\u307E\u3059\u3002
IncreasingLiveSetRuleFactory_TEXT_INFO_LONG=\u3053\u308C\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30FC\u30AF\u306B\u3088\u308B\u3082\u306E\u304B\u3001JVM\u304C\u6700\u8FD1\u8D77\u52D5\u3055\u308C\u305F\u5834\u5408\u306F\u3001\u77ED\u671F\u306E\u8A18\u9332\u306E\u30A2\u30FC\u30C6\u30A3\u30D5\u30A1\u30AF\u30C8\u3067\u3042\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u8A18\u9332\u306F\u3001JVM\u306E\u8D77\u52D5\u304B\u3089{timeAfterJvmStart}\u5F8C\u306B\u958B\u59CB\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u53EF\u80FD\u306A\u5834\u5408\u306F\u3001''\u53E4\u3044\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30FB\u30B5\u30F3\u30D7\u30EB''\u30A4\u30D9\u30F3\u30C8\u3092\u4F7F\u7528\u3059\u308B\u3068\u3001\u60C5\u5831\u3092\u3055\u3089\u306B\u53CE\u96C6\u3067\u304D\u307E\u3059\u3002
IncreasingMetaspaceLiveSetRuleFactory_RULE_NAME=\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u306E\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u50BE\u5411
IncreasingMetaspaceLiveSetRuleFactory_TEXT_INFO=\u30AF\u30E9\u30B9\u30FB\u30C7\u30FC\u30BF\u306F\u8A18\u9332\u4E2D\u306B\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u5185\u3067\u7D99\u7D9A\u7684\u306B\u5897\u52A0\u3057\u3066\u3044\u308B\u3088\u3046\u306B\u898B\u3048\u307E\u3059\u3002
IncreasingMetaspaceLiveSetRuleFactory_TEXT_INFO_LONG=\u3053\u306E\u52D5\u4F5C\u306F\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u306E\u30E1\u30E2\u30EA\u30FC\u30FB\u30EA\u30FC\u30AF\u3092\u793A\u3059\u5834\u5408\u304C\u3042\u308A\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067\u5FC5\u8981\u306B\u5FDC\u3058\u3066\u30AF\u30E9\u30B9\u3092\u30A2\u30F3\u30ED\u30FC\u30C9\u3057\u3066\u3044\u306A\u3044\u3053\u3068\u304C\u539F\u56E0\u3068\u306A\u308A\u5F97\u307E\u3059\u3002
IncreasingMetaspaceLiveSetRuleFactory_TEXT_OK=\u30AF\u30E9\u30B9\u30FB\u30C7\u30FC\u30BF\u306F\u8A18\u9332\u4E2D\u306B\u5897\u52A0\u3057\u3066\u3044\u308B\u3088\u3046\u306B\u898B\u3048\u307E\u305B\u3093\u3002
JavaBlocking_RULE_NAME=Java\u30D6\u30ED\u30C3\u30AD\u30F3\u30B0
JavaBlockingRule_AGGR_BALANCE_BY_INSTANCE=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3054\u3068
JavaBlockingRule_AGGR_BALANCE_BY_THREAD=\u30B9\u30EC\u30C3\u30C9\u5225
JavaBlockingRule_CONFIG_EXCLUDED_THREADS=Java\u304C\u9664\u5916\u3055\u308C\u305F\u30B9\u30EC\u30C3\u30C9\u540D\u3092\u30D6\u30ED\u30C3\u30AF\u3057\u307E\u3057\u305F
JavaBlockingRule_CONFIG_EXCLUDED_THREADS_LONG=\u9664\u5916\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u540D\u3092\u8AAC\u660E\u3059\u308B\u6B63\u898F\u8868\u73FE\u3002\u4F8B: '(.*weblogic\\.socket\\.Muxer.*|MyExcludedThreadName)'
# {thread.exclude.regexp} is a regexp exclude string
JavaBlockingRule_TEXT_EXCLUDED_THREADS=\u6B21\u306E\u6B63\u898F\u8868\u73FE\u306F\u3001\u3053\u306E\u30EB\u30FC\u30EB\u304B\u3089\u30B9\u30EC\u30C3\u30C9\u3092\u9664\u5916\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F: ''{thread.exclude.regexp}''
# {totalBlockedTime} is a time period
JavaBlockingRule_TEXT_INFO=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u5185\u306E\u30B9\u30EC\u30C3\u30C9\u306F\u3001\u5408\u8A08\u3067{totalBlockedTime}\u306B\u308F\u305F\u308A\u30ED\u30C3\u30AF\u3067\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u307E\u3057\u305F\u3002
JavaBlockingRule_TEXT_MESSAGE=\u30ED\u30C3\u30AF\u7AF6\u5408\u306B\u3088\u308B\u904E\u5270\u306A\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
# {mostBlockedClass} is a class name, {mostBlockedCount} is a number, {mostBlockedTime} is a time period
JavaBlockingRule_TEXT_MOST_BLOCKED_CLASS=\u6700\u3082\u30D6\u30ED\u30C3\u30AD\u30F3\u30B0\u3057\u3066\u3044\u305F\u30E2\u30CB\u30BF\u30FC\u30FB\u30AF\u30E9\u30B9\u306F''{mostBlockedClass}''\u3067\u3001\u5408\u8A08\u3067{mostBlockedTime}\u306E\u9593\u306B{mostBlockedCount}\u56DE\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u307E\u3057\u305F\u3002
# {mostBlockedThread} is a thread name, {mostBlockedCount} is a number, {mostBlockedTime} is a time period
JavaBlockingRule_TEXT_MOST_BLOCKED_THREAD=\u6700\u3082\u30D6\u30ED\u30C3\u30AD\u30F3\u30B0\u3057\u3066\u3044\u305F\u30B9\u30EC\u30C3\u30C9\u306F''{mostBlockedThread}''\u3067\u3001\u5408\u8A08\u3067{mostBlockedTime}\u306E\u9593\u306B{mostBlockedCount}\u56DE\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u307E\u3057\u305F\u3002
JavaBlockingRule_TEXT_OK=\u30ED\u30C3\u30AF\u7AF6\u5408\u306B\u3088\u308B\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
LongGcPauseRuleFactory_RULE_NAME=GC\u4E00\u6642\u4F11\u6B62\u30D4\u30FC\u30AF\u671F\u9593
# {longestPause} is a time period
LongGcPauseRuleFactory_TEXT_INFO=\u6700\u9577\u306EGC\u4E00\u6642\u4F11\u6B62\u306F{longestPause}\u3067\u3057\u305F\u3002
LongGcPauseRuleFactory_TEXT_INFO_G1=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u4E00\u6642\u4F11\u6B62\u3092\u6E1B\u3089\u3059\u305F\u3081\u306B\u69CB\u7BC9\u3055\u308C\u305FG1\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u3092\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002G1\u3092\u6709\u52B9\u5316\u3059\u308B\u306B\u306F\u3001\u30B3\u30DE\u30F3\u30C9\u884C\u306B'-XX:+UseG1GC'\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
# {liveset} is a size in bytes, {heapSize} is a size in bytes
LongGcPauseRuleFactory_TEXT_INFO_MX=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u3001\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8{liveset}\u3001\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA{heapSize}\u3067\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA\u3092\u5C0F\u3055\u304F\u3059\u308B\u3068\u3001\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u4E00\u6642\u4F11\u6B62\u6642\u9593\u304C\u77ED\u304F\u306A\u308A\u307E\u3059\u3002
LongGcPauseRuleFactory_TEXT_INFO_REFERENCES=\u53C2\u7167\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u51E6\u7406\u304C\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u4E00\u6642\u4F11\u6B62\u306E\u304B\u306A\u308A\u306E\u90E8\u5206\u3092\u5360\u3081\u3066\u3044\u307E\u3059\u3002\u53C2\u7167\u91CF\u3092\u524A\u6E1B\u3059\u308B\u304B\u3001'-XX:+ParallelRefProcEnabled'\u3092\u4F7F\u7528\u3057\u3066\u4E26\u5217\u53C2\u7167\u51E6\u7406\u3092\u6709\u52B9\u5316\u3059\u308B\u3053\u3068\u3067\u3001\u3053\u308C\u3092\u6E1B\u5C11\u3055\u305B\u3089\u308C\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
LongGcPauseRuleFactory_TEXT_OK=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u9577\u671F\u306EGC\u4E00\u6642\u4F11\u6B62\u6642\u9593\u306E\u539F\u56E0\u306B\u306A\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
LongGcPauseRule_CONFIG_INFO_LIMIT=GC\u4E00\u6642\u4F11\u6B62\u8B66\u544A\u5236\u9650
LongGcPauseRule_CONFIG_INFO_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308BGC\u4E00\u6642\u4F11\u6B62\u6642\u9593
LowOnPhysicalMemoryFactory_RULE_NAME=\u7A7A\u304D\u7269\u7406\u30E1\u30E2\u30EA\u30FC
# {usedMemoryRatio} is a percentage
LowOnPhysicalMemoryFactory_TEXT_INFO=\u4F7F\u7528\u3055\u308C\u305F\u30E1\u30E2\u30EA\u30FC\u306E\u6700\u5927\u91CF\u306F\u3001\u4F7F\u7528\u53EF\u80FD\u306A\u7269\u7406\u30E1\u30E2\u30EA\u30FC\u306E{usedMemoryRatio}\u3067\u3057\u305F\u3002
# {maxUsedMemory} is a size in bytes, {usedMemoryRatio} is a percentage, {totalMemory} is a size in bytes
LowOnPhysicalMemoryFactory_TEXT_INFO_LONG=\u4F7F\u7528\u3055\u308C\u305F\u30E1\u30E2\u30EA\u30FC\u306E\u6700\u5927\u91CF\u306F{maxUsedMemory}\u3067\u3057\u305F\u3002\u3053\u308C\u306F\u3001\u4F7F\u7528\u53EF\u80FD\u306A\u7269\u7406\u30E1\u30E2\u30EA\u30FC{totalMemory}\u306E{usedMemoryRatio}\u3067\u3057\u305F\u3002\u7A7A\u304D\u30E1\u30E2\u30EA\u30FC\u304C\u307B\u3068\u3093\u3069\u306A\u3044\u3068\u30B9\u30EF\u30C3\u30D7\u304C\u767A\u751F\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u3001\u3053\u308C\u306F\u5927\u304D\u306A\u8CA0\u62C5\u3068\u306A\u308A\u307E\u3059\u3002\u3053\u308C\u3092\u56DE\u907F\u3059\u308B\u306B\u306F\u3001\u30E1\u30E2\u30EA\u30FC\u4F7F\u7528\u91CF\u3092\u524A\u6E1B\u3059\u308B\u304B\u3001\u4F7F\u7528\u53EF\u80FD\u306A\u30E1\u30E2\u30EA\u30FC\u91CF\u3092\u5897\u52A0\u3055\u305B\u3066\u304F\u3060\u3055\u3044\u3002
LowOnPhysicalMemoryFactory_TEXT_OK=\u30B7\u30B9\u30C6\u30E0\u306F\u3053\u306E\u8A18\u9332\u4E2D\u306B\u4F4E\u3044\u7269\u7406\u30E1\u30E2\u30EA\u30FC\u3067\u5B9F\u884C\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
LuceneVersionRule_LONG_DESCRIPTION_LUCENE=\u53E4\u3044\u30D0\u30FC\u30B8\u30E7\u30F3\u306EApache Lucene\u306F\u3001\u4E0D\u5FC5\u8981\u306B\u30AF\u30A8\u30EA\u30D1\u30FC\u30B5\u30FC\u3054\u3068\u306B\u65B0\u3057\u3044LookaheadSuccess\u30A8\u30E9\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u3063\u3066\u3001\u30B9\u30BF\u30C3\u30AF\u306E\u62E1\u5F35\u306E\u305F\u3081\u306B\u8FFD\u52A0\u306E\u64CD\u4F5C\u304C\u767A\u751F\u3057\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u3092\u6E1B\u901F\u3055\u305B\u307E\u3059\u3002\u3053\u306E\u554F\u984C\u306F\u3001Lucene 7.1.0\u3067\u4FEE\u6B63\u3055\u308C\u3066\u3044\u307E\u3059\u3002
LuceneVersionRule_LONG_DESCRIPTION_ES=\u53E4\u3044\u30D0\u30FC\u30B8\u30E7\u30F3\u306EElastic Search\u306F\u3001\u53E4\u3044\u30D0\u30FC\u30B8\u30E7\u30F3\u306EApache Lucene\u3092\u4F7F\u7528\u3057\u3066\u304A\u308A\u3001\u305D\u308C\u306F\u4E0D\u5FC5\u8981\u306B\u30AF\u30A8\u30EA\u30D1\u30FC\u30B5\u30FC\u3054\u3068\u306B\u65B0\u3057\u3044LookaheadSuccess\u30A8\u30E9\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u3063\u3066\u3001\u30B9\u30BF\u30C3\u30AF\u306E\u62E1\u5F35\u306E\u305F\u3081\u306B\u8FFD\u52A0\u306E\u64CD\u4F5C\u304C\u767A\u751F\u3057\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u3092\u6E1B\u901F\u3055\u305B\u307E\u3059\u3002\u3053\u306E\u554F\u984C\u306F\u3001ElasticSearch 6.2.0\u3067\u4FEE\u6B63\u3055\u308C\u3066\u3044\u307E\u3059\u3002
LuceneVersionRule_LONG_DESCRIPTION_SOLR=\u53E4\u3044\u30D0\u30FC\u30B8\u30E7\u30F3\u306EApache Solr\u306F\u3001\u53E4\u3044\u30D0\u30FC\u30B8\u30E7\u30F3\u306EApache Lucene\u3092\u4F7F\u7528\u3057\u3066\u304A\u308A\u3001\u305D\u308C\u306F\u4E0D\u5FC5\u8981\u306B\u30AF\u30A8\u30EA\u30D1\u30FC\u30B5\u30FC\u3054\u3068\u306B\u65B0\u3057\u3044LookaheadSuccess\u30A8\u30E9\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002\u3053\u308C\u306B\u3088\u3063\u3066\u3001\u30B9\u30BF\u30C3\u30AF\u306E\u62E1\u5F35\u306E\u305F\u3081\u306B\u8FFD\u52A0\u306E\u64CD\u4F5C\u304C\u767A\u751F\u3057\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u3092\u6E1B\u901F\u3055\u305B\u307E\u3059\u3002\u3053\u306E\u554F\u984C\u306F\u3001Apache Solr 7.1.0\u3067\u4FEE\u6B63\u3055\u308C\u3066\u3044\u307E\u3059\u3002
LuceneVersionRule_SHORT_DESCRIPTION_LUCENE=\u30AA\u30FC\u30D0\u30FC\u30D8\u30C3\u30C9\u3092\u524A\u6E1B\u3059\u308B\u305F\u3081\u306B\u3001Apache Lucene\u30927.1.0\u4EE5\u4E0A\u306B\u66F4\u65B0\u3059\u308B\u3053\u3068\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
LuceneVersionRule_SHORT_DESCRIPTION_ES=\u30AA\u30FC\u30D0\u30FC\u30D8\u30C3\u30C9\u3092\u524A\u6E1B\u3059\u308B\u305F\u3081\u306B\u3001ElasticSearch\u30926.2.0\u4EE5\u4E0A\u306B\u66F4\u65B0\u3059\u308B\u3053\u3068\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
LuceneVersionRule_SHORT_DESCRIPTION_SOLR=\u30AA\u30FC\u30D0\u30FC\u30D8\u30C3\u30C9\u3092\u524A\u6E1B\u3059\u308B\u305F\u3081\u306B\u3001Apache Solr\u30927.1.0\u4EE5\u4E0A\u306B\u66F4\u65B0\u3059\u308B\u3053\u3068\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
LuceneVersionRule_OK_TEXT_LUCENE=Apache Lucene\u306B\u95A2\u3059\u308B\u554F\u984C\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
LuceneVersionRule_OK_TEXT_ES=ElasticSearch\u306B\u95A2\u3059\u308B\u554F\u984C\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
LuceneVersionRule_OK_TEXT_SOLR=Apache Solr\u306B\u95A2\u3059\u308B\u554F\u984C\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
LuceneVersionRule_NA_TEXT=Apache Lucene\u306E\u4F7F\u7528\u3092\u691C\u77E5\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
LuceneVersionRule_RULE_NAME=Lucene\u306E\u30D0\u30FC\u30B8\u30E7\u30F3
ManagementAgentRule_TEXT_INFO=\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A(\u30DD\u30FC\u30C8\u3001\u8A8D\u8A3C\u3001SSL)\u304C\u5B9F\u884C\u6642\u306B\u5909\u66F4\u3055\u308C\u307E\u3057\u305F\u3002
ManagementAgentRule_TEXT_INFO_LONG=\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A(\u30DD\u30FC\u30C8\u3001\u8A8D\u8A3C\u3001SSL)\u304C\u5B9F\u884C\u6642\u306B\u5909\u66F4\u3055\u308C\u307E\u3057\u305F\u3002\u3053\u308C\u304C\u5F71\u97FF\u3057\u305F\u53EF\u80FD\u6027\u306F\u9AD8\u304F\u3042\u308A\u307E\u305B\u3093\u304C\u3001\u8ABF\u67FB\u306B\u5F79\u7ACB\u3064\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
ManagmentAgentRuleFactory_RULE_NAME=\u975E\u63A8\u5968\u306E\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A
ManagmentAgentRuleFactory_TEXT_INFO_SSL_DISABLED=\u5B89\u5168\u3067\u306F\u306A\u3044\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A: SSL\u7121\u52B9\u3002
ManagmentAgentRuleFactory_TEXT_INFO_SSL_DISABLED_LONG=\u30E9\u30F3\u30BF\u30A4\u30E0\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A\u304C\u5B89\u5168\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002SSL/TLS\u304C\u7121\u52B9\u3067\u3057\u305F\u3002\u30C8\u30E9\u30D5\u30A3\u30C3\u30AF\u304C\u5B89\u5168\u3067\u306F\u306A\u304F\u306A\u308B\u305F\u3081\u3001\u3053\u308C\u306F\u672C\u756A\u30B7\u30B9\u30C6\u30E0\u3067\u63A8\u5968\u3055\u308C\u307E\u305B\u3093\u3002
ManagmentAgentRuleFactory_TEXT_OK=\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A\u306B\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
ManagmentAgentRuleFactory_TEXT_WARN_AUTH_DISABLED=\u5B89\u5168\u3067\u306F\u306A\u3044\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A: \u30D1\u30B9\u30EF\u30FC\u30C9\u8A8D\u8A3C\u7121\u52B9\u3002
ManagmentAgentRuleFactory_TEXT_WARN_AUTH_DISABLED_LONG=\u30E9\u30F3\u30BF\u30A4\u30E0\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A\u304C\u5B89\u5168\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u8A8D\u8A3C\u304C\u7121\u52B9\u3067\u3057\u305F\u3002\u30DD\u30FC\u30C8\u756A\u53F7\u304A\u3088\u3073\u30DB\u30B9\u30C8\u540D\u3092\u77E5\u3063\u3066\u3044\u308B(\u307E\u305F\u306F\u4E88\u60F3\u3059\u308B)\u30EA\u30E2\u30FC\u30C8\u30FB\u30E6\u30FC\u30B6\u30FC\u304C\u3001Java\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304A\u3088\u3073\u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u3092\u30E2\u30CB\u30BF\u30FC\u304A\u3088\u3073\u5236\u5FA1\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002\u3053\u308C\u306F\u672C\u756A\u30B7\u30B9\u30C6\u30E0\u3067\u63A8\u5968\u3055\u308C\u307E\u305B\u3093\u3002
ManagmentAgentRuleFactory_TEXT_WARN_BOTH_DISABLED=\u5B89\u5168\u3067\u306F\u306A\u3044\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A: \u30D1\u30B9\u30EF\u30FC\u30C9\u8A8D\u8A3C\u304A\u3088\u3073SSL\u306E\u4E21\u65B9\u304C\u7121\u52B9\u3002
ManagmentAgentRuleFactory_TEXT_WARN_BOTH_DISABLED_LONG=\u30E9\u30F3\u30BF\u30A4\u30E0\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u8A2D\u5B9A\u304C\u5B89\u5168\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u8A8D\u8A3C\u304A\u3088\u3073SSL\u306E\u4E21\u65B9\u304C\u7121\u52B9\u3067\u3057\u305F\u3002\u30DD\u30FC\u30C8\u756A\u53F7\u304A\u3088\u3073\u30DB\u30B9\u30C8\u540D\u3092\u77E5\u3063\u3066\u3044\u308B(\u307E\u305F\u306F\u4E88\u60F3\u3059\u308B)\u30EA\u30E2\u30FC\u30C8\u30FB\u30E6\u30FC\u30B6\u30FC\u304C\u3001Java\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304A\u3088\u3073\u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u3092\u30E2\u30CB\u30BF\u30FC\u304A\u3088\u3073\u5236\u5FA1\u3067\u304D\u307E\u3059\u3002\u3053\u308C\u306F\u672C\u756A\u30B7\u30B9\u30C6\u30E0\u3067\u63A8\u5968\u3055\u308C\u307E\u305B\u3093\u3002
ManagmentAgentRuleFactory_TEXT_WARN_CONFIGURE_GUIDE=\u7BA1\u7406\u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u306E\u69CB\u6210\u65B9\u6CD5\u306E\u8A73\u7D30\u306F\u3001[Java\u30E2\u30CB\u30BF\u30EA\u30F3\u30B0\u304A\u3088\u3073\u7BA1\u7406\u30AC\u30A4\u30C9](https://docs.oracle.com/javase/8/docs/technotes/guides/management/agent.html)\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ManyRunningProcessesRule_RULE_NAME=\u7AF6\u5408\u3057\u3066\u3044\u308B\u30D7\u30ED\u30BB\u30B9
# {competingProcessCount} is a number
ManyRunningProcessesRule_TEXT_INFO=\u3053\u306E\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u306E\u4F5C\u6210\u4E2D\u306B\u3001{competingProcessCount}\u500B\u306E\u30D7\u30ED\u30BB\u30B9\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002
# {competingProcessCount} is a number, {competingProcessTime} is a time stamp
ManyRunningProcessesRule_TEXT_INFO_LONG=\u3053\u306E\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u304C\u4F5C\u6210\u3055\u308C\u305F\u30DB\u30B9\u30C8\u30FB\u30DE\u30B7\u30F3\u3067\u3001{competingProcessTime}\u306B\u3001\u5408\u8A08{competingProcessCount}\u500B\u306E\u5225\u306E\u30D7\u30ED\u30BB\u30B9\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002
ManyRunningProcessesRule_TEXT_RECOMMENDATION=\u3053\u308C\u304C\u30B5\u30FC\u30D0\u30FC\u74B0\u5883\u306E\u5834\u5408\u3001\u305D\u306E\u30DE\u30B7\u30F3\u3067\u5B9F\u884C\u3059\u308B\u306E\u306F\u3001\u305D\u306E\u4ED6\u306E\u91CD\u8981\u306A\u30D7\u30ED\u30BB\u30B9\u306E\u307F\u306B\u3059\u308B\u3053\u3068\u3092\u304A\u85A6\u3081\u3057\u307E\u3059\u3002
ManyRunningProcessesRule_INFO_LIMIT=\u7AF6\u5408\u3057\u3066\u3044\u308B\u30D7\u30ED\u30BB\u30B9\u5236\u9650
ManyRunningProcessesRule_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u3001\u540C\u6642\u30D7\u30ED\u30BB\u30B9\u306E\u6570
MetaspaceOomRuleFactory_RULE_NAME=\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u306E\u30E1\u30E2\u30EA\u30FC\u4E0D\u8DB3
MetaspaceOomRuleFactory_TEXT_OK=\u3053\u306E\u8A18\u9332\u4E2D\u306B\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u306F\u67AF\u6E07\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
# {oomCount} is a number
MetaspaceOomRuleFactory_TEXT_WARN=\u3053\u306E\u8A18\u9332\u306B\u306F{oomCount}\u4EF6\u306E ''\u30E1\u30BF\u30B9\u30DA\u30FC\u30B9\u30FB\u30E1\u30E2\u30EA\u30FC\u4E0D\u8DB3''\u30A4\u30D9\u30F3\u30C8\u304C\u3042\u308A\u307E\u3059\u3002
MetaspaceOomRuleFactory_TEXT_WARN_LONG='-XX:MaxMetaSpaceSize'\u30D5\u30E9\u30B0\u3092\u5897\u52A0\u307E\u305F\u306F\u524A\u9664\u3059\u308B\u304B\u3001\u30AF\u30E9\u30B9\u304C\u9069\u5207\u306B\u30A2\u30F3\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u306A\u3044\u7406\u7531\u3092\u8ABF\u67FB\u3057\u307E\u3059\u3002
MethodProfilingDataProvider_AGGR_AGGR_TOP_FRAME_QUOTA=\u30C8\u30C3\u30D7\u30FB\u30D5\u30EC\u30FC\u30E0\u5272\u5F53\u3066\u5236\u9650
MethodProfilingDataProvider_AGGR_AGGR_TOP_FRAME_QUOTA_DESC=\u30C8\u30C3\u30D7\u30FB\u30D5\u30EC\u30FC\u30E0\u3068\u5408\u8A08\u30B5\u30F3\u30D7\u30EB\u30FB\u30AB\u30A6\u30F3\u30C8\u9593\u306E\u5272\u5F53\u3066\u5236\u9650
MethodProfilingDataProvider_AGGR_MAX_ENDTIME=\u6700\u5927\u7D42\u4E86\u6642\u9593
MethodProfilingDataProvider_AGGR_MIN_ENDTIME=\u6700\u5C0F\u7D42\u4E86\u6642\u9593
MethodProfilingDataProvider_AGGR_TOP_FRAME_BALANCE=\u30C8\u30C3\u30D7\u30FB\u30D5\u30EC\u30FC\u30E0\u30FB\u30D0\u30E9\u30F3\u30B9
MethodProfilingDataProvider_AGGR_TOP_FRAME_BALANCE_DESC=\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9\u30FB\u30C8\u30C3\u30D7\u30FB\u30D5\u30EC\u30FC\u30E0\u9593\u306E\u76F8\u5BFE\u30D0\u30E9\u30F3\u30B9
MethodProfilingRule_RULE_NAME=\u30E1\u30BD\u30C3\u30C9\u30FB\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0
MethodProfilingRule_WINDOW_SIZE=\u30E1\u30BD\u30C3\u30C9\u30FB\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u30FB\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA
MethodProfilingRule_WINDOW_SIZE_DESC=\u3053\u306E\u8A18\u9332\u5185\u306E\u30E1\u30BD\u30C3\u30C9\u30FB\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u30FB\u30B5\u30F3\u30D7\u30EB\u306E\u8A55\u4FA1\u306B\u4F7F\u7528\u3059\u308B\u30B9\u30E9\u30A4\u30C7\u30A3\u30F3\u30B0\u30FB\u30A6\u30A3\u30F3\u30C9\u30A6\u306E\u30B5\u30A4\u30BA\u3002\u3053\u306E\u30EB\u30FC\u30EB\u306E\u8A55\u4FA1\u306B\u9577\u6642\u9593\u304B\u304B\u308B\u5834\u5408\u306F\u3001\u3053\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u3092\u5927\u304D\u304F\u3059\u308B\u3053\u3068\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u30A6\u30A3\u30F3\u30C9\u30A6\u30FB\u30B5\u30A4\u30BA\u3092\u5927\u304D\u304F\u3059\u308B\u3068\u30EB\u30FC\u30EB\u306E\u7CBE\u5EA6\u304C\u4F4E\u4E0B\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
MethodProfilingRule_EXCLUDED_PACKAGES=\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u304B\u3089\u9664\u5916\u3059\u308B\u30D1\u30C3\u30B1\u30FC\u30B8
MethodProfilingRule_EXCLUDED_PACKAGES_DESC=\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u30C8\u30E9\u30D0\u30FC\u30B9\u3059\u308B\u969B\u306B\u9664\u5916\u3059\u308B\u30D1\u30C3\u30B1\u30FC\u30B8\u3002\u3069\u3061\u3089\u306B\u3082\u5C5E\u3055\u306A\u3044\u6700\u521D\u306E\u30D5\u30EC\u30FC\u30E0\u306B\u5230\u9054\u3059\u308B\u307E\u3067\u3001\u30D1\u30BF\u30FC\u30F3\u306B\u4E00\u81F4\u3059\u308B\u3059\u3079\u3066\u306E\u30D5\u30EC\u30FC\u30E0\u3092\u524A\u9664\u3057\u307E\u3059\u3002\u304B\u308F\u308A\u306B\u3001\u6700\u521D\u306B\u691C\u51FA\u3055\u308C\u305F\u30D5\u30EC\u30FC\u30E0\u3092\u65B0\u3057\u3044\u3082\u306E\u3068\u3057\u3066\u30AB\u30A6\u30F3\u30C8\u3057\u307E\u3059\u3002
# {0} is a number, {1} is a number
NumberOfGcThreadsRuleFactory_TEXT_INFO=\u30E9\u30F3\u30BF\u30A4\u30E0\u306F{parallelGcThreads}\u500B\u306EGC\u30B9\u30EC\u30C3\u30C9\u3092{hwThreads}\u500B\u306ECPU\u30B3\u30A2\u306E\u3042\u308B\u30DE\u30B7\u30F3\u3067\u4F7F\u7528\u3057\u307E\u3057\u305F\u3002
NumberOfGcThreadsRuleFactory_TEXT_INFO_LONG=\u4F7F\u7528\u53EF\u80FD\u306A\u30B3\u30A2\u3088\u308A\u3082\u591A\u304F\u306EGC\u30B9\u30EC\u30C3\u30C9\u3092\u4F7F\u7528\u3059\u308B\u306E\u306F\u6700\u9069\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002'-XX:ParallelGCThreads'\u30D5\u30E9\u30B0\u3092\u524A\u9664\u3059\u308B\u3068\u3001JVM\u3067GC\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u3092\u81EA\u52D5\u7684\u306B\u8A2D\u5B9A\u3067\u304D\u307E\u3059\u3002
ObjectStatisticsDataProvider_AGGR_LIVE_SIZE_INCREASE=\u30E9\u30A4\u30D6\u5897\u52A0\u30B5\u30A4\u30BA
ObjectStatisticsDataProvider_AGGR_LIVE_SIZE_INCREASE_DESC=\u6700\u521D\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u5F8C\u304B\u3089\u6700\u5F8C\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u5F8C\u307E\u3067\u306E\u5408\u8A08\u30B5\u30A4\u30BA\u306E\u5DEE
OptionsCheckRule_CONFIG_ACCEPTED_OPTIONS=\u53D7\u5165\u308C\u6E08\u30AA\u30D7\u30B7\u30E7\u30F3
OptionsCheckRule_CONFIG_ACCEPTED_OPTIONS_LONG=\u3053\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u306E\u30EA\u30B9\u30C8\u306B\u3042\u308B-XX (\u672A\u691C\u8A3C) JVM\u30AA\u30D7\u30B7\u30E7\u30F3\u540D\u306F\u3001\u30EB\u30FC\u30EB\u3067\u30C1\u30A7\u30C3\u30AF\u3055\u308C\u307E\u305B\u3093
OptionsCheckRule_RULE_NAME=\u30B3\u30DE\u30F3\u30C9\u884C\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30C1\u30A7\u30C3\u30AF
# {0} is a Java version string
OptionsCheckRule_TEXT_DEPRECATED=Java {0}\u3067\u306F\u975E\u63A8\u5968\u3067\u3059\u3002
# {0} is a Java version string, {1} is a Java version string
OptionsCheckRule_TEXT_DEPRECATED_IGNORED=Java {0}\u3067\u306F\u975E\u63A8\u5968\u3067\u3001Java {1}\u3067\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
# {0} is a Java version string, {1} is a Java version string, {2} is a Java version string
OptionsCheckRule_TEXT_DEPRECATED_IGNORED_REMOVED=Java {0}\u3067\u306F\u975E\u63A8\u5968\u3067\u3001Java {1}\u3067\u306F\u7121\u8996\u3055\u308C\u3001Java {2}\u3067\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002
# {0} is a Java version string, {1} is a Java version string
OptionsCheckRule_TEXT_DEPRECATED_REMOVED=Java {0}\u3067\u306F\u975E\u63A8\u5968\u3067\u3001Java {1}\u3067\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002
OptionsCheckRule_TEXT_DEPRECATED_WARNING=\u975E\u63A8\u5968\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u56DE\u907F\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u308C\u3089\u306F\u30EC\u30AC\u30B7\u30FC\u30FB\u30B3\u30FC\u30C9\u3092\u6709\u52B9\u306B\u3059\u308B\u5834\u5408\u3068\u3001\u5B8C\u5168\u306B\u7121\u8996\u3055\u308C\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002\u901A\u5E38\u306F\u3001\u4ECA\u5F8C\u306EJava\u30EA\u30EA\u30FC\u30B9\u3067\u524A\u9664\u3055\u308C\u307E\u3059\u3002
# {0} is a Java version string
OptionsCheckRule_TEXT_IGNORED=Java {0}\u3067\u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
# {0} is a Java version string, {1} is a Java version string
OptionsCheckRule_TEXT_IGNORED_REMOVED=Java {0}\u3067\u306F\u7121\u8996\u3055\u308C\u3001Java {1}\u3067\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002
OptionsCheckRule_TEXT_NA=JVM\u5F15\u6570\u306E\u3042\u308B\u30A4\u30D9\u30F3\u30C8\u306F\u8A18\u9332\u3055\u308C\u3066\u3044\u307E\u305B\u3093
OptionsCheckRule_TEXT_OK=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u3044\u306A\u3044\u304B\u3001\u975E\u63A8\u5968\u306B\u306A\u3063\u305F\u304B\u3001\u63A8\u5968\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F
OptionsCheckRule_TEXT_UNDOC_DEPR_NOTREC=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u304A\u3089\u305A\u3001\u975E\u63A8\u5968\u306B\u306A\u3063\u305F\u3001\u63A8\u5968\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
OptionsCheckRule_TEXT_UNDOC_DEPR=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u304A\u3089\u305A\u3001\u975E\u63A8\u5968\u306B\u306A\u3063\u305F\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
OptionsCheckRule_TEXT_UNDOC_NOTREC=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u304A\u3089\u305A\u3001\u63A8\u5968\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
OptionsCheckRule_TEXT_DEPR_NOTREC=\u975E\u63A8\u5968\u306B\u306A\u3063\u305F\u3001\u63A8\u5968\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
OptionsCheckRule_TEXT_UNDOC=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
OptionsCheckRule_TEXT_DEPR=\u975E\u63A8\u5968\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
OptionsCheckRule_TEXT_NOTREC=\u63A8\u5968\u3055\u308C\u3066\u3044\u306A\u3044\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
OptionsCheckRule_TEXT_GENERAL_PROBLEM=\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306E\u554F\u984C\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
OptionsCheckRule_TEXT_OPTION_DEPRECATED=\u6B21\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u975E\u63A8\u5968\u306B\u306A\u3063\u305F\u304B\u3001\u975E\u63A8\u5968\u306B\u306A\u308B\u4E88\u5B9A\u3067\u3059\u3002 {deprecatedOptions}
OptionsCheckRule_TEXT_OPTION_NOT_DOCUMENTED=\u6B21\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002 {undocumentedOptions}
OptionsCheckRule_TEXT_OPTION_NOT_RECOMMENDED=\u6B21\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u304A\u85A6\u3081\u3057\u307E\u305B\u3093\u3002 {notRecommendedOptions}
OptionsCheckRule_TEXT_OPTIONS_DEPRECATED=\u6B21\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u975E\u63A8\u5968\u306B\u306A\u3063\u305F\u304B\u3001\u975E\u63A8\u5968\u306B\u306A\u308B\u4E88\u5B9A\u3067\u3059\u3002 {deprecatedOptions}
OptionsCheckRule_TEXT_OPTIONS_NOT_DOCUMENTED=\u6B21\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002 {undocumentedOptions}
OptionsCheckRule_TEXT_OPTIONS_NOT_RECOMMENDED=\u6B21\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u30FB\u30D5\u30E9\u30B0\u306F\u304A\u85A6\u3081\u3057\u307E\u305B\u3093\u3002 {notRecommendedOptions}
# {0} is a Java version string
OptionsCheckRule_TEXT_REMOVED=Java {0}\u3067\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002
OptionsCheckRule_TEXT_UNDOCUMENTED_WARNING=\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u5316\u3055\u308C\u3066\u3044\u306A\u3044\u30D5\u30E9\u30B0\u306F\u3001\u5373\u6642\u306B\u306F\u660E\u3089\u304B\u306B\u306A\u3089\u306A\u3044\u65B9\u6CD5\u3067JVM\u306B\u5F71\u97FF\u3059\u308B\u3053\u3068\u304C\u3042\u308A\u3001\u5C06\u6765\u306E\u30EA\u30EA\u30FC\u30B9\u3067\u8B66\u544A\u306A\u3057\u306B\u524A\u9664\u3055\u308C\u308B\u53EF\u80FD\u6027\u3082\u3042\u308A\u307E\u3059\u3002
OptionsCheckRule_TEXT_USE_MAXRAMFRACTION=\u304B\u308F\u308A\u306BMaxRAMFraction\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044
OverAggressiveRecordingSettingRuleFactory_RULE_NAME=\u975E\u63A8\u5968\u306E\u8A18\u9332\u8A2D\u5B9A
OverAggressiveRecordingSettingRuleFactory_RULE_TEXT_OK=\u8A18\u9332\u8A2D\u5B9A\u306B\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
OverAggressiveRecordingSettingRuleFactory_TEXT_INFO=\u6B21\u306E\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u306B\u3057\u304D\u3044\u5024\u304C\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F: {noThresholdEventTypes}\u3002
# {0} is a list of event type names
OverAggressiveRecordingSettingRuleFactory_TEXT_INFO_LONG=\u3057\u304D\u3044\u5024\u306E\u306A\u3044\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7\u306B\u3088\u3063\u3066\u5927\u91CF\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u751F\u6210\u3055\u308C\u3001\u30AA\u30FC\u30D0\u30FC\u30D8\u30C3\u30C9\u306E\u4E0A\u6607\u3092\u62DB\u304F\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u308C\u304C\u610F\u56F3\u7684\u3067\u306F\u306A\u3044\u5834\u5408\u3001\u4ECA\u5F8C\u306E\u8A18\u9332\u306E\u305F\u3081\u306B\u30C6\u30F3\u30D7\u30EC\u30FC\u30C8\u306E\u8A2D\u5B9A\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ParGcFewThreadsRuleFactory_TEXT_INFO=JVM\u306F\u30D1\u30E9\u30EC\u30EBGC\u3092\u4F7F\u7528\u3057\u3066\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u304C\u3001GC\u30B9\u30EC\u30C3\u30C9\u306F1\u3064\u3060\u3051\u3067\u3057\u305F\u3002
ParGcFewThreadsRuleFactory_TEXT_INFO_LONG=JVM\u306F\u30D1\u30E9\u30EC\u30EBGC\u3092\u4F7F\u7528\u3057\u3066\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u304C\u3001GC\u30B9\u30EC\u30C3\u30C9\u306F1\u3064\u3060\u3051\u3067\u3057\u305F\u3002\u3053\u308C\u306F\u9069\u5207\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002GC\u30B9\u30EC\u30C3\u30C9\u306E\u6570\u3092\u5909\u66F4\u3059\u308B\u306B\u306F\u3001\u30B3\u30DE\u30F3\u30C9\u884C\u30D5\u30E9\u30B0\u306E[-XX:ParallelGCThreads=X](https://docs.oracle.com/javase/8/docs/technotes/guides/vm/gctuning/parallel.html)\u3092\u4F7F\u7528\u3057\u307E\u3059\u3002'-XX:ParallelGCThreads'\u30D5\u30E9\u30B0\u3092\u4F7F\u7528\u305B\u305A\u306B\u5B9F\u884C\u3059\u308C\u3070\u3001JVM\u3067\u306F\u9069\u5207\u306A\u6570\u306EGC\u30B9\u30EC\u30C3\u30C9\u304C\u81EA\u52D5\u7684\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
ParallelOnSingleCpuRuleFactory_TEXT_INFO=\u30E9\u30F3\u30BF\u30A4\u30E0\u306F\u30B7\u30F3\u30B0\u30EB\u30B3\u30A2\u30FB\u30DE\u30B7\u30F3\u3067\u30D1\u30E9\u30EC\u30EBGC\u3092\u4F7F\u7528\u3057\u307E\u3057\u305F\u3002
ParallelOnSingleCpuRuleFactory_TEXT_INFO_LONG=\u30E9\u30F3\u30BF\u30A4\u30E0\u306F\u30B7\u30F3\u30B0\u30EB\u30B3\u30A2\u30FB\u30DE\u30B7\u30F3\u3067\u30D1\u30E9\u30EC\u30EBGC\u3092\u4F7F\u7528\u3057\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u9069\u5207\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u30B7\u30F3\u30B0\u30EB\u30B3\u30A2\u30FB\u30DE\u30B7\u30F3\u306B\u6700\u9069\u5316\u3055\u308C\u3066\u3044\u308B[\u30B7\u30EA\u30A2\u30EB\u30FB\u30B3\u30EC\u30AF\u30BF](https://docs.oracle.com/javase/8/docs/technotes/guides/vm/gctuning/collectors.html)\u3092\u304B\u308F\u308A\u306B\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
VerifyNoneRule_WLS_TEXT_INFO=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067\u306F\u3001\u30D0\u30A4\u30C8\u30B3\u30FC\u30C9\u691C\u8A3C\u304C\u7121\u52B9\u5316\u3055\u308C\u305F\u307E\u307EWebLogic Server\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002
VerifyNoneRule_WLS_TEXT_INFO_LONG=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067\u306F\u3001\u30D0\u30A4\u30C8\u30B3\u30FC\u30C9\u691C\u8A3C\u304C\u7121\u52B9\u5316\u3055\u308C\u305F\u307E\u307EWebLogic Server\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002\u4E00\u822C\u7684\u306B\u306F\u63A8\u5968\u3055\u308C\u307E\u305B\u3093\u304C\u3001WLS\u3067\u306F\u554F\u984C\u3042\u308A\u307E\u305B\u3093\u3002
VerifyNoneRule_TEXT_INFO=\u30D0\u30A4\u30C8\u30B3\u30FC\u30C9\u691C\u8A3C\u304C\u7121\u52B9\u5316\u3055\u308C\u305F\u307E\u307E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002
# {0} argument used for disabling bytecode verficiation
VerifyNoneRule_TEXT_INFO_LONG=''{0}''\u5F15\u6570\u306B\u3088\u308A\u30D0\u30A4\u30C8\u30B3\u30FC\u30C9\u691C\u8A3C\u304C\u7121\u52B9\u5316\u3055\u308C\u305F\u307E\u307E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u304C\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002\u30D0\u30A4\u30C8\u30FB\u30B3\u30FC\u30C9\u691C\u8A3C\u306E\u7121\u52B9\u5316\u306F\u5B89\u5168\u3067\u306F\u306A\u3044\u305F\u3081\u3001\u672C\u756A\u30B7\u30B9\u30C6\u30E0\u3067\u306F\u884C\u308F\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u5FC5\u8981\u306A\u3044\u5834\u5408\u306F\u3001\u30B3\u30DE\u30F3\u30C9\u884C\u3067'-Xverify:none'\u3084'-noverify'\u3092\u4F7F\u7528\u3057\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002[Java\u30BB\u30AD\u30E5\u30A2\u30FB\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0\u30FB\u30B9\u30BF\u30F3\u30C0\u30FC\u30C9](https://www.securecoding.cert.org/confluence/display/java/ENV04-J.+Do+not+disable+bytecode+verification)\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
VerifyNoneRule_RULE_NAME=\u30D0\u30A4\u30C8\u30FB\u30B3\u30FC\u30C9\u691C\u8A3C
VerifyNoneRule_TEXT_OK=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306F\u3001\u30D0\u30A4\u30C8\u30B3\u30FC\u30C9\u691C\u8A3C\u304C\u6709\u52B9\u306A\u72B6\u614B\u3067\u5B9F\u884C\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002
DebugNonSafepointsRule_RULE_NAME=DebugNonSafepoints
DebugNonSafepointsRule_DISABLED_RESULT_SUMMARY=DebugNonSafepoints\u306F\u660E\u793A\u7684\u306B\u7121\u52B9\u5316\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002
DebugNonSafepointsRule_NOT_ENABLED_RESULT_SUMMARY=DebugNonSafepoints\u306F\u6709\u52B9\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
DebugNonSafepointsRule_NOT_ENABLED_RESULT_EXPLANATION=DebugNonSafepoints\u304C\u6709\u52B9\u3067\u306A\u3044\u3068\u3001\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u306B\u306A\u3044\u30B9\u30EC\u30C3\u30C9\u304C\u6B63\u3057\u304F\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3055\u308C\u306A\u3044\u305F\u3081\u306B\u3001\u30E1\u30BD\u30C3\u30C9\u30FB\u30D7\u30ED\u30D5\u30A1\u30A4\u30EA\u30F3\u30B0\u306E\u30C7\u30FC\u30BF\u306E\u7CBE\u5EA6\u304C\u4F4E\u304F\u306A\u308A\u307E\u3059\u3002\u3053\u308C\u3089\u306E\u30D5\u30E9\u30B0\u3092\u6709\u52B9\u306B\u3059\u308B\u3068\u3001\u308F\u305A\u304B\u306B\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u30AA\u30FC\u30D0\u30FC\u30D8\u30C3\u30C9\u304C\u767A\u751F\u3057\u307E\u3059\u3002\u8A73\u7D30\u306F\u3001[HotSpot\u30E9\u30F3\u30BF\u30A4\u30E0 \u6982\u8981/\u30B9\u30EC\u30C3\u30C9\u7BA1\u7406](http://openjdk.java.net/groups/hotspot/docs/RuntimeOverview.html#Thread%20Management|outline)\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
DebugNonSafepointsRule_NOT_ENABLED_RESULT_SOLUTION=\u3053\u308C\u3092\u6709\u52B9\u306B\u3059\u308B\u306B\u306F\u3001\u6B21\u306EJVM\u30D5\u30E9\u30B0\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044: '-XX:+UnlockDiagnosticVMOptions -XX:+DebugNonSafepoints'.
DebugNonSafepointsRule_TEXT_OK=DebugNonSafepoints\u304C\u660E\u793A\u7684\u306B\u6709\u52B9\u5316\u3055\u308C\u307E\u3057\u305F\u3002
DebugNonSafepointsRule_IMPLICIT_TEXT_OK=\u3053\u306E\u8A18\u9332\u306E\u4F5C\u6210\u306B\u4F7F\u7528\u3055\u308C\u305FJVM\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u3001DebugNonSafepoints\u304C\u6697\u9ED9\u7684\u306B\u6709\u52B9\u5316\u3055\u308C\u307E\u3057\u305F\u3002
DiscouragedGcOptionsRule_RULE_NAME=GC\u8A2D\u5B9A
DiscouragedGcOptionsRule_TEXT_OK=GC\u8A2D\u5B9A\u306B\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
DiscouragedVmOptionsRule_RULE_NAME=\u63A8\u5968\u3055\u308C\u306A\u3044VM\u30AA\u30D7\u30B7\u30E7\u30F3
DiscouragedVmOptionsRule_TEXT_OK=VM\u30AA\u30D7\u30B7\u30E7\u30F3\u306B\u554F\u984C\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
DiscouragedVmOptionsRule_BOTH_EXPERIMENTAL_AND_IGNORE=\u5B9F\u9A13\u7684VM\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u308BJVM\u3067\u8A18\u9332\u304C\u5B9F\u884C\u3055\u308C\u3001\u8A8D\u8B58\u3055\u308C\u306A\u3044VM\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u7121\u8996\u3055\u308C\u307E\u3057\u305F\u3002
PasswordsInArgsRule_CONFIG_EXCLUDED_STRINGS=\u9664\u5916\u3059\u308B\u6587\u5B57\u5217
PasswordsInArgsRule_CONFIG_EXCLUDED_STRINGS_LONG=\u9664\u5916\u3059\u308B\u6587\u5B57\u5217\u3092\u8AAC\u660E\u3059\u308B\u6B63\u898F\u8868\u73FE\u3002\u4F8B: (passworld|passwise)
PasswordsInArgsRule_JAVAARGS_TEXT_INFO=\u8A18\u9332\u5185\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u5F15\u6570\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
# {suspiciousJavaArgs} is a list of argument strings
PasswordsInArgsRule_JAVAARGS_TEXT_INFO_LONG=\u3053\u306E\u8A18\u9332\u5185\u3067\u6B21\u306E\u4E0D\u5BE9\u306A\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u5F15\u6570\u304C\u898B\u3064\u304B\u308A\u307E\u3057\u305F: {suspiciousJavaArgs}
PasswordsInArgsRule_JAVAARGS_TEXT_SOLUTION=\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u76F4\u63A5Java\u30D7\u30ED\u30BB\u30B9\u306E\u5F15\u6570\u3068\u3057\u3066\u4F7F\u7528\u3057\u305F\u304F\u306A\u3044\u5834\u5408\u3001\u901A\u5E38\u306F\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u306B\u63D0\u4F9B\u3059\u308B\u65B9\u6CD5\u304C\u4ED6\u306B\u3042\u308A\u307E\u3059\u3002\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5F15\u6570\u3068\u3057\u3066\u4F7F\u7528\u3057\u7D9A\u3051\u308B\u304C\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5171\u6709\u305B\u305A\u306B\u8A18\u9332\u3092\u5171\u6709\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u5834\u5408\u306F\u3001''JVM\u60C5\u5831''\u30A4\u30D9\u30F3\u30C8\u3092\u7121\u52B9\u5316\u3057\u3066\u304F\u3060\u3055\u3044\u3002''JVM\u60C5\u5831''\u30A4\u30D9\u30F3\u30C8\u3092\u7121\u52B9\u5316\u3059\u308B\u3068\u3001\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u306E\u81EA\u52D5\u5206\u6790\u6A5F\u80FD\u304C\u5236\u9650\u3055\u308C\u308B\u5834\u5408\u304C\u3042\u308B\u3053\u3068\u306B\u6CE8\u610F\u3057\u3066\u304F\u3060\u3055\u3044\u3002
PasswordsInArgsRule_TEXT_INFO_EXCLUDED=\u3053\u306E\u30EB\u30FC\u30EB\u3067\u306F\u6B21\u306E\u6B63\u898F\u8868\u73FE\u304C\u6587\u5B57\u5217\u306E\u9664\u5916\u306B\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F: ''{passwordsinargs.string.exclude.regexp}''
PasswordsInArgsRule_RULE_NAME=Java\u5F15\u6570\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
PasswordsInArgsRule_TEXT_OK=\u8A18\u9332\u3067\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u5F15\u6570\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u3088\u3046\u306B\u898B\u3048\u307E\u305B\u3093\u3002
PasswordsInEnvironmentRuleFactory_CONFIG_EXCLUDED_STRINGS=\u9664\u5916\u3059\u308B\u6587\u5B57\u5217
PasswordsInEnvironmentRuleFactory_CONFIG_EXCLUDED_STRINGS_LONG=\u9664\u5916\u3059\u308B\u6587\u5B57\u5217\u3092\u8AAC\u660E\u3059\u308B\u6B63\u898F\u8868\u73FE\u3002\u4F8B: (passworld|passwise)
PasswordsInEnvironmentRuleFactory_RULE_NAME=\u74B0\u5883\u5909\u6570\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
PasswordsInEnvironmentRuleFactory_TEXT_INFO=\u8A18\u9332\u5185\u306E\u74B0\u5883\u5909\u6570\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
# {passwordsinenvironment.string.exclude.regexp} is a regular expression exclude strings
PasswordsInEnvironmentRuleFactory_TEXT_INFO_EXCLUDED_INFO=\u3053\u306E\u30EB\u30FC\u30EB\u3067\u306F\u6B21\u306E\u6B63\u898F\u8868\u73FE\u304C\u6587\u5B57\u5217\u306E\u9664\u5916\u306B\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F: ''{passwordsinenvironment.string.exclude.regexp}''
# {suspiciousEnvironmentVariables} is a list of environment variable names
PasswordsInEnvironmentRuleFactory_TEXT_INFO_LONG=\u3053\u306E\u8A18\u9332\u5185\u3067\u6B21\u306E\u4E0D\u5BE9\u306A\u74B0\u5883\u5909\u6570\u304C\u898B\u3064\u304B\u308A\u307E\u3057\u305F: {suspiciousEnvironmentVariables}
PasswordsInEnvironmentRuleFactory_TEXT_SOLUTION=\u74B0\u5883\u5909\u6570\u5185\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u305D\u306E\u307E\u307E\u4FDD\u6301\u3059\u308B\u304C\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5171\u6709\u305B\u305A\u306B\u8A18\u9332\u3092\u5171\u6709\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u5834\u5408\u306F\u3001''\u521D\u671F\u74B0\u5883\u5909\u6570''\u30A4\u30D9\u30F3\u30C8\u3092\u7121\u52B9\u5316\u3057\u3066\u304F\u3060\u3055\u3044\u3002
PasswordsInEnvironmentRuleFactory_TEXT_OK=\u8A18\u9332\u3067\u306F\u74B0\u5883\u5909\u6570\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u3088\u3046\u306B\u898B\u3048\u307E\u305B\u3093\u3002
PasswordsInSystemPropertiesRule_CONFIG_EXCLUDED_STRINGS=\u9664\u5916\u3059\u308B\u6587\u5B57\u5217
PasswordsInSystemPropertiesRule_CONFIG_EXCLUDED_STRINGS_LONG=\u9664\u5916\u3059\u308B\u6587\u5B57\u5217\u3092\u8AAC\u660E\u3059\u308B\u6B63\u898F\u8868\u73FE\u3002\u4F8B: (passworld|passwise)
PasswordsInSystemPropertiesRule_RULE_NAME=\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
PasswordsInSystemPropertiesRule_TEXT_INFO=\u8A18\u9332\u5185\u306E\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
# {passwordsinsystemproperties.string.exclude.regexp} is a regular expression exclude strings
PasswordsInSystemPropertiesRule_TEXT_INFO_EXCLUDED_INFO=\u3053\u306E\u30EB\u30FC\u30EB\u3067\u306F\u6B21\u306E\u6B63\u898F\u8868\u73FE\u304C\u6587\u5B57\u5217\u306E\u9664\u5916\u306B\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F: ''{passwordsinsystemproperties.string.exclude.regexp}''
# {suspiciousSystemProperties} is a list of system property names
PasswordsInSystemPropertiesRule_TEXT_INFO_LONG=\u3053\u306E\u8A18\u9332\u5185\u3067\u6B21\u306E\u4E0D\u5BE9\u306A\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u304C\u898B\u3064\u304B\u308A\u307E\u3057\u305F: {suspiciousSystemProperties}
PasswordsInSystemPropertiesRule_TEXT_SOLUTION=\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u5185\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u305D\u306E\u307E\u307E\u4FDD\u6301\u3059\u308B\u304C\u3001\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5171\u6709\u305B\u305A\u306B\u8A18\u9332\u3092\u5171\u6709\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u5834\u5408\u306F\u3001''\u521D\u671F\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3''\u30A4\u30D9\u30F3\u30C8\u3092\u7121\u52B9\u5316\u3057\u3066\u304F\u3060\u3055\u3044\u3002
PasswordsInSystemPropertiesRule_TEXT_OK=\u8A18\u9332\u3067\u306F\u30B7\u30B9\u30C6\u30E0\u30FB\u30D7\u30ED\u30D1\u30C6\u30A3\u306B\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u3088\u3046\u306B\u898B\u3048\u307E\u305B\u3093\u3002
ProcessStartedRule_RULE_NAME=\u958B\u59CB\u3057\u305F\u30D7\u30ED\u30BB\u30B9
# {processesStarted} is a number of processes
ProcessStartedRule_TEXT_INFO={processesStarted}\u500B\u306E\u30D7\u30ED\u30BB\u30B9\u304C\u958B\u59CB\u3057\u307E\u3057\u305F\u3002
ProcessStartedRule_TEXT_OK=\u3069\u306E\u30D7\u30ED\u30BB\u30B9\u3082\u958B\u59CB\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
ReferenceStatisticsType_FINAL_REFERENCES=\u6700\u7D42\u53C2\u7167
ReferenceStatisticsType_PHANTOM_REFERENCES=\u30D5\u30A1\u30F3\u30C8\u30E0\u53C2\u7167
ReferenceStatisticsType_SOFT_REFERENCES=\u30BD\u30D5\u30C8\u53C2\u7167
ReferenceStatisticsType_WEAK_REFERENCES=\u5F31\u3044\u53C2\u7167
SerialGcOnMultiCpuRuleFactory_TEXT_INFO=\u30B7\u30EA\u30A2\u30EB\u30FB\u30B3\u30EC\u30AF\u30BF\u304C\u30DE\u30EB\u30C1\u30B3\u30A2\u30FB\u30DE\u30B7\u30F3\u3067\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F\u3002
SerialGcOnMultiCpuRuleFactory_TEXT_INFO_LONG=JVM\u306F\u3001\u30DE\u30EB\u30C1\u30B3\u30A2\u30FB\u30DE\u30B7\u30F3\u3067\u5B9F\u884C\u3057\u305F\u5834\u5408\u3067\u3082\u30B7\u30EA\u30A2\u30EBGC\u3092\u4F7F\u7528\u3057\u307E\u3057\u305F\u3002Concurrent Mark Sweep\u3092\u4F7F\u7528\u3059\u308B\u3053\u3068\u3067\u3001G1\u307E\u305F\u306F\u30D1\u30E9\u30EC\u30EBGC\u304C\u304B\u308F\u308A\u306BGC\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306E\u5411\u4E0A\u3092\u3082\u305F\u3089\u3059\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
SerialOldRuleFactory_TEXT_WARN_CMS=CMS\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u304C\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F\u304C\u3001JVM\u306FSerial Old Collection\u3092\u884C\u3046\u305F\u3081\u306B\u623B\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3057\u305F\u3002
SerialOldRuleFactory_TEXT_WARN_CMS_LONG=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3067Concurrent Mark Sweep\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u304C\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F\u304C\u3001JVM\u306F\u3001\u3055\u3089\u306B\u6642\u9593\u3092\u8981\u3059\u308BSerial Old Collection\u306B\u623B\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u3001Concurrent Collector\u304C\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u4E2D\u306B\u767A\u751F\u3057\u305F\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u5272\u5F53\u3066\u3092\u4FDD\u6301\u3067\u304D\u306A\u304B\u3063\u305F\u305F\u3081\u3067\u3059\u3002\u3053\u306E\u30EA\u30B9\u30AF\u306F\u3001[-XX:CMSInitiatingOccupancyFraction](https://docs.oracle.com/javase/8/docs/technotes/guides/vm/gctuning/cms.html)\u306E\u5024\u3092\u4F4E\u304F\u3059\u308B\u3053\u3068\u3067\u6291\u5236\u3067\u304D\u307E\u3059\u3002
SerialOldRuleFactory_TEXT_WARN_G1=G1\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u304C\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F\u304C\u3001JVM\u306FSerial Old Collection\u3092\u884C\u3046\u305F\u3081\u306B\u623B\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3057\u305F\u3002
SerialOldRuleFactory_TEXT_WARN_G1_LONG=JVM\u3067G1\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u304C\u4F7F\u7528\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u3055\u3089\u306B\u6642\u9593\u3092\u8981\u3059\u308BSerial Old Collection\u306B\u623B\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3057\u305F\u3002\u3053\u308C\u306F\u3001G1\u30B3\u30EC\u30AF\u30BF\u304C\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u4E2D\u306B\u767A\u751F\u3057\u305F\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u5272\u5F53\u3066\u3092\u4FDD\u6301\u3067\u304D\u306A\u304B\u3063\u305F\u305F\u3081\u3067\u3059\u3002\u3053\u306E\u30EA\u30B9\u30AF\u306F\u3001[-XX:InitiatingHeapOccupancyPercent](http://www.oracle.com/technetwork/articles/java/vmoptions-jsp-140102.html)\u306E\u5024\u3092\u4F4E\u304F\u3059\u308B\u3053\u3068\u3067\u6291\u5236\u3067\u304D\u307E\u3059\u3002\u3053\u306E[G1\u30C1\u30E5\u30FC\u30CB\u30F3\u30B0\u306E\u8A18\u4E8B](http://www.oracle.com/technetwork/articles/java/g1gc-1984535.html)\u304C\u53C2\u8003\u306B\u306A\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
SocketReadRule_CONFIG_INFO_LIMIT=\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u671F\u9593\u60C5\u5831\u5236\u9650
SocketReadRule_CONFIG_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u671F\u9593
SocketReadRule_CONFIG_WARNING_LIMIT=\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u671F\u9593\u8B66\u544A\u5236\u9650
SocketReadRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u671F\u9593
SocketReadRuleFactory_RULE_NAME=\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u30D4\u30FC\u30AF\u671F\u9593
# {longestReadTime} is a time period
SocketReadRuleFactory_TEXT_OK=\u3053\u306E\u8A18\u9332\u5185\u306B\u3001\u9577\u671F\u306E\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u4E00\u6642\u4F11\u6B62\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F(\u6700\u9577\u306F{longestReadTime}\u3067\u3057\u305F)\u3002
SocketReadRuleFactory_TEXT_NO_EVENTS=\u3053\u306E\u8A18\u9332\u306B\u306F\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u30A4\u30D9\u30F3\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
SocketReadRuleFactory_TEXT_RMI_NOTE=\u4E00\u90E8\u306E\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u30D1\u30BF\u30FC\u30F3\u306F\u3001\u6B63\u5E38\u3068\u60F3\u5B9A\u3055\u308C\u308B\u9577\u671F\u9593\u8AAD\u53D6\u308A\u3092\u793A\u3059\u305F\u3081\u9664\u5916\u3055\u308C\u3066\u3044\u308B\u306E\u3067\u6CE8\u610F\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u3053\u306E\u3088\u3046\u306A\u30D1\u30BF\u30FC\u30F3\u306B\u306FJMX RMI\u901A\u4FE1\u304A\u3088\u3073MQ series\u304C\u542B\u307E\u308C\u307E\u3059\u3002
# {longestReadTime} is a time period
SocketReadRuleFactory_TEXT_WARN=\u3053\u306E\u8A18\u9332\u306B\u306F\u3001\u9577\u671F\u306E\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u4E00\u6642\u4F11\u6B62\u304C\u3042\u308A\u307E\u3059(\u6700\u9577\u306F{longestReadTime}\u3067\u3059)\u3002
# {longestReadTime} is a time period, {longestReadHost} is a host name, {longestReadAmount} is a size in bytes
SocketReadRuleFactory_TEXT_WARN_LONG=\u8A18\u9332\u3055\u308C\u305F\u6700\u9577\u306E\u30BD\u30B1\u30C3\u30C8\u8AAD\u53D6\u308A\u3067\u306F\u3001{longestReadHost}\u306E\u30DB\u30B9\u30C8\u304B\u3089\u306E{longestReadAmount}\u306E\u8AAD\u53D6\u308A\u306B{longestReadTime}\u304B\u304B\u308A\u307E\u3057\u305F\u3002\u8A18\u9332\u3055\u308C\u305FIO\u306E\u5E73\u5747\u6642\u9593: {averageSocketRead}\u3002\u8A18\u9332\u3055\u308C\u305FIO\u306E\u5408\u8A08\u6642\u9593: {totalSocketRead}\u3002\u30DB\u30B9\u30C8{longestReadHost}\u306B\u304A\u3044\u3066\u8A18\u9332\u3055\u308C\u305FIO\u306E\u5408\u8A08\u6642\u9593: {totalReadForLongest}\u3002
SocketWriteRule_CONFIG_INFO_LIMIT=\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u671F\u9593\u60C5\u5831\u5236\u9650
SocketWriteRule_CONFIG_INFO_LIMIT_LONG=\u60C5\u5831\u901A\u77E5\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u671F\u9593
SocketWriteRule_CONFIG_WARNING_LIMIT=\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u671F\u9593\u8B66\u544A\u5236\u9650
SocketWriteRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u6700\u77ED\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u671F\u9593
SocketWriteRuleFactory_RULE_NAME=\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u30D4\u30FC\u30AF\u671F\u9593
# {longestWriteTime} is a time period
SocketWriteRuleFactory_TEXT_OK=\u3053\u306E\u8A18\u9332\u5185\u306B\u3001\u9577\u671F\u306E\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u4E00\u6642\u4F11\u6B62\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F(\u6700\u9577\u306F{longestWriteTime}\u3067\u3057\u305F)\u3002
SocketWriteRuleFactory_TEXT_NO_EVENTS=\u3053\u306E\u8A18\u9332\u306B\u306F\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u30A4\u30D9\u30F3\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
SocketWriteRuleFactory_TEXT_RMI_NOTE=\u4E00\u90E8\u306E\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u30D1\u30BF\u30FC\u30F3\u306F\u3001\u6B63\u5E38\u3068\u60F3\u5B9A\u3055\u308C\u308B\u9577\u671F\u9593\u66F8\u8FBC\u307F\u3092\u793A\u3059\u305F\u3081\u9664\u5916\u3055\u308C\u3066\u3044\u308B\u306E\u3067\u6CE8\u610F\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u3053\u306E\u3088\u3046\u306A\u30D1\u30BF\u30FC\u30F3\u306B\u306FJMX RMI\u901A\u4FE1\u304C\u542B\u307E\u308C\u307E\u3059\u3002
# {longestWriteTime} is a time period
SocketWriteRuleFactory_TEXT_WARN=\u3053\u306E\u8A18\u9332\u306B\u306F\u3001\u9577\u671F\u306E\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u4E00\u6642\u4F11\u6B62\u304C\u3042\u308A\u307E\u3059(\u6700\u9577\u306F{longestWriteTime}\u3067\u3059)\u3002
# {longestWriteTime} is a time period, {longestWriteHost} is a host name, {longestWriteAmount} is a size in bytes
SocketWriteRuleFactory_TEXT_WARN_LONG=\u8A18\u9332\u3055\u308C\u305F\u6700\u9577\u306E\u30BD\u30B1\u30C3\u30C8\u66F8\u8FBC\u307F\u3067\u306F\u3001{longestWriteHost}\u306E\u30DB\u30B9\u30C8\u304B\u3089\u306E{longestWriteAmount}\u306E\u66F8\u8FBC\u307F\u306B{longestWriteTime}\u304B\u304B\u308A\u307E\u3057\u305F\u3002\u8A18\u9332\u3055\u308C\u305FIO\u306E\u5E73\u5747\u6642\u9593: {averageSocketWrite}\u3002\u8A18\u9332\u3055\u308C\u305FIO\u306E\u5408\u8A08\u6642\u9593: {totalSocketWrite}\u3002\u30DB\u30B9\u30C8{longestWriteHost}\u306B\u304A\u3044\u3066\u8A18\u9332\u3055\u308C\u305FIO\u306E\u5408\u8A08\u6642\u9593: {totalWriteForLongest}\u3002
StackdepthSettingRule_RULE_NAME=Stackdepth\u8A2D\u5B9A
StackdepthSettingRule_TEXT_INFO=\u3053\u306E\u8A18\u9332\u3067\u306F\u4E00\u90E8\u306E\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u304C\u5207\u308A\u6368\u3066\u3089\u308C\u307E\u3057\u305F\u3002
# {stackdepth} is a number, {truncationRatio} is a percentage, {truncatedTraces} is a list of event type names in the StackdepthSettingRule_TYPE_LIST_TEMPLATE template
StackdepthSettingRule_TEXT_INFO_LONG=\u30D5\u30E9\u30A4\u30C8\u30FB\u30EC\u30B3\u30FC\u30C0\u306B\u306F\u3001\u30AD\u30E3\u30D7\u30C1\u30E3\u3055\u308C\u308B\u30B9\u30BF\u30C3\u30AF\u6DF1\u5EA6\u306E\u6700\u5927\u5024\u3068\u3057\u3066{stackdepth}\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002\u3059\u3079\u3066\u306E\u30C8\u30EC\u30FC\u30B9\u306E{truncationRatio}\u304C\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u8D85\u3048\u305F\u305F\u3081\u3001\u5207\u308A\u6368\u3066\u3089\u308C\u307E\u3057\u305F\u3002\u8A73\u7D30\u306A\u30C8\u30EC\u30FC\u30B9\u304C\u5FC5\u8981\u306A\u5834\u5408\u306F\u3001''-XX:FlightRecorderOptions=stackdepth=<value>''\u5024\u3092\u5897\u3084\u3057\u3066\u304F\u3060\u3055\u3044\u3002\n\u6B21\u306E\u30BF\u30A4\u30D7\u306E\u30A4\u30D9\u30F3\u30C8\u3067\u306F\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u304C\u5207\u308A\u6368\u3066\u3089\u308C\u3066\u3044\u307E\u3059: {truncatedTraces}
StackdepthSettingRule_TEXT_NA=\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u306E\u30A4\u30D9\u30F3\u30C8\u304C\u8A18\u9332\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
StackdepthSettingRule_TEXT_OK=\u3053\u306E\u8A18\u9332\u306B\u306F\u5207\u308A\u6368\u3066\u3089\u308C\u305F\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u306F\u3042\u308A\u307E\u305B\u3093\u3002
# {0} is an event type name, {1} is a percentage, this is a template that is reused in the StackdepthSettingRule_TEXT_INFO_LONG {truncatedTraces} parameter
StackdepthSettingRule_TYPE_LIST_TEMPLATE={0} ({1}\u306E\u30C8\u30EC\u30FC\u30B9\u3092\u5207\u6368\u3066)
StringDeduplicationRule_RULE_NAME=\u6587\u5B57\u5217\u306E\u91CD\u8907\u9664\u5916
StringDeduplicationRule_STRING_ARRAY_ALLOCATION_FRAMES=\u6587\u5B57\u5217\u5185\u90E8\u914D\u5217\u5272\u5F53\u3066\u30D5\u30EC\u30FC\u30E0
StringDeduplicationRule_STRING_ARRAY_ALLOCATION_FRAMES_DESC=\u6587\u5B57\u5217\u5185\u90E8\u306E\u6587\u5B57/\u30D0\u30A4\u30C8\u914D\u5217\u304C\u5272\u308A\u5F53\u3066\u3089\u308C\u308B\u30D5\u30EC\u30FC\u30E0\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u306E\u30EA\u30B9\u30C8\u3002
StringDeduplicationRule_STRING_ARRAY_LIVESET_RATIO_AND_HEAP_USAGE_LIMIT=\u30D2\u30FC\u30D7\u4F7F\u7528\u91CF\u304A\u3088\u3073\u6587\u5B57\u5217\u5185\u90E8\u914D\u5217\u306E\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u7387\u60C5\u5831\u5236\u9650
StringDeduplicationRule_STRING_ARRAY_LIVESET_RATIO_AND_HEAP_USAGE_LIMIT_DESC=\u30D2\u30FC\u30D7\u4F7F\u7528\u7387\u3001\u304A\u3088\u3073\u5408\u8A08\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u306B\u5BFE\u3059\u308B\u6587\u5B57\u5217\u5185\u90E8\u306E\u6587\u5B57/\u30D0\u30A4\u30C8\u914D\u5217\u306E\u6BD4\u7387\u304C\u3053\u306E\u5236\u9650\u3092\u8D8A\u3048\u308B\u3068\u3001\u60C5\u5831\u901A\u77E5\u304C\u30C8\u30EA\u30AC\u30FC\u3055\u308C\u307E\u3059\u3002
StringDeduplicationRule_STRING_ARRAY_ALLOCATION_RATIO_AND_HEAP_USAGE_LIMIT=\u30D2\u30FC\u30D7\u4F7F\u7528\u91CF\u304A\u3088\u3073\u6587\u5B57\u5217\u5185\u90E8\u914D\u5217\u306E\u5272\u5F53\u3066\u60C5\u5831\u5236\u9650
StringDeduplicationRule_STRING_ARRAY_ALLOCATION_RATIO_AND_HEAP_USAGE_LIMIT_DESC=\u30D2\u30FC\u30D7\u4F7F\u7528\u7387\u3001\u304A\u3088\u3073\u5408\u8A08\u5272\u5F53\u3066\u306B\u5BFE\u3059\u308B\u5272\u308A\u5F53\u3066\u3089\u308C\u305F\u6587\u5B57\u5217\u5185\u90E8\u306E\u6587\u5B57/\u30D0\u30A4\u30C8\u914D\u5217\u306E\u6BD4\u7387\u304C\u3053\u306E\u5236\u9650\u3092\u8D8A\u3048\u308B\u3068\u3001\u60C5\u5831\u901A\u77E5\u304C\u30C8\u30EA\u30AC\u30FC\u3055\u308C\u307E\u3059\u3002
StringDeduplicationRule_RESULT_USE_STRING_DEDUPLICATION_ENABLED=\u6587\u5B57\u5217\u306E\u91CD\u8907\u9664\u5916\u306F\u3059\u3067\u306B\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u307E\u3059\u3002
StringDeduplicationRule_RESULT_GC_LONG=\u6587\u5B57\u5217\u306E\u91CD\u8907\u9664\u5916\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u308B\u306E\u306F\u3001G1\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u3042\u308B\u3044\u306FShenandoah\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u3092\u4F7F\u7528\u3057\u3066\u3044\u308B\u5834\u5408\u306E\u307F\u3067\u3059\u3002\u3053\u306E\u6A5F\u80FD\u3092\u4F7F\u7528\u3059\u308B\u306B\u306F\u3001'-XX:+UseG1GC'\u3092\u4F7F\u7528\u3057\u3066G1\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3001'-XX:+UseShenandoahGC'\u3092\u4F7F\u7528\u3057\u3066Shenandoah\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u3092\u6709\u52B9\u306B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
StringDeduplicationRule_RESULT_DONT_RECOMMEND_STRING_DEDUPLICATION=\u6587\u5B57\u5217\u306E\u91CD\u8907\u9664\u5916\u3092\u6709\u52B9\u5316\u3057\u3066\u3082\u5927\u304D\u306A\u30E1\u30EA\u30C3\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
StringDeduplicationRule_RESULT_RECOMMEND_STRING_DEDUPLICATION=\u6587\u5B57\u5217\u306E\u91CD\u8907\u9664\u5916\u3092\u6709\u52B9\u5316\u3059\u308B\u3068\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306B\u30E1\u30EA\u30C3\u30C8\u304C\u3042\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
# {0} is an event type, # {1} is an event type
StringDeduplicationRule_RESULT_NO_MAX_HEAP_INFO=\u6700\u5927\u30D2\u30FC\u30D7\u30FB\u30B5\u30A4\u30BA\u306B\u95A2\u3059\u308B\u60C5\u5831\u304C\u3042\u308A\u307E\u305B\u3093\u3002\u3053\u306E\u30EB\u30FC\u30EB\u306E\u7CBE\u5EA6\u3092\u5411\u4E0A\u3059\u308B\u306B\u306F\u3001\u30A4\u30D9\u30F3\u30C8\u30FB\u30BF\u30A4\u30D7{0}\u307E\u305F\u306F{1}\u3092\u6709\u52B9\u5316\u3057\u3066\u304F\u3060\u3055\u3044\u3002
StringDeduplicationRule_RESULT_NO_ALLOC_ITEMS=\u6587\u5B57\u5217\u306E\u5185\u90E8\u914D\u5217\u306B\u5272\u5F53\u3066\u30A4\u30D9\u30F3\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u30D5\u30EC\u30FC\u30E0\u30FB\u30D5\u30A3\u30EB\u30BF\u30FB\u30D7\u30EA\u30D5\u30A1\u30EC\u30F3\u30B9\u304C\u6B63\u3057\u304F\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u304B\u3001\u5272\u5F53\u3066\u30A4\u30D9\u30F3\u30C8\u3067stackTrace\u5C5E\u6027\u304C\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
# {heapUsage} is a percentage
StringDeduplicationRule_RESULT_HEAP_USAGE=\u30D2\u30FC\u30D7\u306E\u7D04{heapUsage}\u304C\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002
# {0} is a percentage, {stringType} is either 'byte[]' or 'char[]'
StringDeduplicationRule_RESULT_STRING_ARRAY_LIVESET_RATIO=\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u306E\u7D04{stringHeapRatio}\u304C\u3001\u6587\u5B57\u5217\u306E\u5185\u90E8\u914D\u5217\u30BF\u30A4\u30D7(\u3053\u306EJDK\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u306F''{stringType}'')\u3067\u69CB\u6210\u3055\u308C\u3066\u3044\u307E\u3059\u3002
# {0} is a percentage, {stringType} is either 'byte[]' or 'char[]'
StringDeduplicationRule_RESULT_STRING_ARRAY_ALLOCATION_RATIO=\u3059\u3079\u3066\u306E\u5272\u5F53\u3066\u306E\u7D04{stringHeapRatio}\u304C\u3001\u6587\u5B57\u5217\u306E\u5185\u90E8\u914D\u5217(\u3053\u306EJDK\u30D0\u30FC\u30B8\u30E7\u30F3\u3067\u306F''{stringType}'')\u3067\u3057\u305F\u3002
StringDeduplicationRule_RESULT_LONG_DESCRIPTION=\u6587\u5B57\u5217\u306E\u91CD\u8907\u9664\u5916\u304C\u3001JVM\u30D5\u30E9\u30B0 '-XX:+UseStringDeduplication' \u3092\u4F7F\u7528\u3057\u3066\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u307E\u3059\u3002JDK 8u20\u4EE5\u4E0A\u3067\u306F\u3001\u3053\u306E\u30D5\u30E9\u30B0\u3092G1\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u3042\u308B\u3044\u306FShenandoah\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30BF\u3068\u3068\u3082\u306B\u4F7F\u7528\u3067\u304D\u307E\u3059\u3002\n\u3053\u308C\u306B\u3088\u308A\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u304C\u6539\u5584\u3055\u308C\u308B\u304B\u3069\u3046\u304B\u3092\u691C\u8A3C\u3059\u308B\u306B\u306F\u3001\u6587\u5B57\u5217\u306E\u91CD\u8907\u9664\u5916\u304C\u6709\u52B9\u306E\u5834\u5408\u3068\u7121\u52B9\u306E\u5834\u5408\u306E\u4E21\u65B9\u3067\u30D5\u30E9\u30A4\u30C8\u8A18\u9332\u3092\u4F5C\u6210\u3057\u307E\u3059\u3002\u6587\u5B57\u5217\u306E\u91CD\u8907\u9664\u5916\u3092\u6709\u52B9\u306B\u3057\u3066\u5B9F\u884C\u3059\u308B\u5834\u5408\u3001JDK 8\u3067\u306F '-XX:+PrintStringDeduplicationStatistics' \u3092\u4F7F\u7528\u3057\u3066\u3001JDK 9\u3067\u306F '-Xlog:stringdedup*=debug' \u3092\u4F7F\u7528\u3057\u3066\u7D71\u8A08\u3082\u6709\u52B9\u5316\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u6587\u5B57\u5217\u306E\u91CD\u8907\u9664\u5916\u304C\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u308B\u8A18\u9332\u3067\u306E\u30D2\u30FC\u30D7\u30FB\u30E9\u30A4\u30D6\u30FB\u30BB\u30C3\u30C8\u306E\u6E1B\u5C11\u304C\u3001\u6587\u5B57\u5217\u306E\u91CD\u8907\u9664\u5916\u30E1\u30BF\u30C7\u30FC\u30BF\u8868\u306E\u30B5\u30A4\u30BA\u3088\u308A\u5927\u304D\u3044\u304B\u3069\u3046\u304B\u3092\u78BA\u8A8D\u3057\u307E\u3059\u3002\u30E1\u30BF\u30C7\u30FC\u30BF\u8868\u306E\u30B5\u30A4\u30BA\u306F\u3001\u7D71\u8A08\u306E\u51FA\u529B\u306B'\u8868/\u30E1\u30E2\u30EA\u30FC\u4F7F\u7528\u91CF: XX MB'\u3068\u8868\u793A\u3055\u308C\u307E\u3059\n\u6587\u5B57\u5217\u306E\u91CD\u8907\u9664\u5916\u306E\u8A73\u7D30\u306F\u3001Java\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u3001\u307E\u305F\u306F [JEP 192](https://openjdk.java.net/jeps/192) \u3067\u53C2\u7167\u3067\u304D\u307E\u3059\u3002
SystemGcRule_CONFIG_WARNING_LIMIT=System.gc()\u7387\u5236\u9650
SystemGcRule_CONFIG_WARNING_LIMIT_LONG=System.gc()\u3068\u5408\u8A08\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u9593\u306E\u6BD4\u7387\u306E\u8B66\u544A\u5236\u9650
SystemGcRuleFactory_RULE_NAME=System.gc()\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u305FGC
# {systemGcRatio} is a percentage
SystemGcRuleFactory_TEXT_INFO=\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E{systemGcRatio}\u304CSystem.gc()\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u307E\u3057\u305F\u3002
SystemGcRuleFactory_TEXT_INFO_LONG=System.gc()\u306E\u547C\u51FA\u3057\u306F\u3001\u5FC5\u8981\u4EE5\u4E0A\u306E\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3092\u5F15\u304D\u8D77\u3053\u3059\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u308C\u3089\u306E\u547C\u51FA\u3057\u304C\u5FC5\u8981\u304B\u3069\u3046\u304B\u5206\u304B\u3089\u306A\u3044\u5834\u5408\u306F\u3001\u524A\u9664\u3059\u308B\u3053\u3068\u3092\u691C\u8A0E\u3057\u3066\u304F\u3060\u3055\u3044\u3002<p>\u30BD\u30FC\u30B9\u30FB\u30B3\u30FC\u30C9\u3092\u5909\u66F4\u3067\u304D\u306A\u3044\u30E9\u30A4\u30D6\u30E9\u30EA\u306E\u4E2D\u3067\u306E\u547C\u51FA\u3057\u306E\u5834\u5408\u306B\u306F\u3001\u30B3\u30DE\u30F3\u30C9\u884C\u30D5\u30E9\u30B0'-XX:+DisableExplicitGC'\u3092\u4F7F\u7528\u3057\u3066\u3001JVM\u306B\u3059\u3079\u3066\u306ESystem.gc()\u547C\u51FA\u3057\u3092\u7121\u8996\u3055\u305B\u308B\u3088\u3046\u306B\u3067\u304D\u307E\u3059\u3002
SystemGcRuleFactory_TEXT_OK=System.gc()\u306B\u3088\u3063\u3066\u5F15\u304D\u8D77\u3053\u3055\u308C\u305F\u30AC\u30D9\u30FC\u30B8\u30FB\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u304C\u3042\u308A\u307E\u305B\u3093\u3002
TlabAllocationRatioRuleFactory_RULE_NAME=TLAB\u5272\u5F53\u3066\u7387
# {outsideTlabRatio} is a percentage
TlabAllocationRatioRuleFactory_TEXT_INFO=\u30D7\u30ED\u30B0\u30E9\u30E0\u306F\u30E1\u30E2\u30EA\u30FC\u306E{outsideTlabRatio}\u3092TLAB\u5916\u306B\u5272\u308A\u5F53\u3066\u307E\u3057\u305F\u3002
TlabAllocationRatioRuleFactory_TEXT_RECOMMEND_LESS_ALLOCATION=\u30B9\u30EC\u30C3\u30C9\u30FB\u30ED\u30FC\u30AB\u30EB\u5272\u5F53\u3066\u30D0\u30C3\u30D5\u30A1(TLAB)\u5916\u3078\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u5272\u5F53\u3066\u306F\u3001TLAB\u5185\u306E\u5272\u5F53\u3066\u3088\u308A\u3082\u8CA0\u8377\u304C\u304B\u304B\u308A\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u500B\u5225\u306E\u5272\u5F53\u3066\u304C\u59A5\u5F53\u306ATLAB\u3092\u4E0A\u56DE\u308B\u3053\u3068\u304C\u610F\u56F3\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u8A31\u5BB9\u3067\u304D\u307E\u3059\u3002\u500B\u5225\u306E\u5272\u5F53\u3066\u30B5\u30A4\u30BA\u3092\u6E1B\u3089\u3059\u3053\u3068\u3067\u3001\u3053\u308C\u3092\u56DE\u907F\u3067\u304D\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002TLAB\u95A2\u9023\u306E\u3044\u304F\u3064\u304B\u306EJVM\u30D5\u30E9\u30B0\u3067\u8A66\u884C\u3059\u308B\u3053\u3068\u3082\u3067\u304D\u307E\u3059\u304C\u3001\u901A\u5E38\u306F\u3001JVM\u3067TLAB\u30B5\u30A4\u30BA\u3092\u81EA\u52D5\u7684\u306B\u7BA1\u7406\u3059\u308B\u3053\u3068\u3092\u304A\u85A6\u3081\u3057\u307E\u3059\u3002
TlabAllocationRatioRuleFactory_TEXT_INFO_ONLY_OUTSIDE=\u30D7\u30ED\u30B0\u30E9\u30E0\u306B\u3088\u308A\u3001TLAB\u5916\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u307F\u304C\u5272\u308A\u5F53\u3066\u3089\u308C\u307E\u3057\u305F\u3002
TlabAllocationRatioRuleFactory_TEXT_INFO_ONLY_OUTSIDE_LONG=\u30D7\u30ED\u30B0\u30E9\u30E0\u306B\u3088\u308A\u3001\u30B9\u30EC\u30C3\u30C9\u30FB\u30ED\u30FC\u30AB\u30EB\u5272\u5F53\u3066\u30D0\u30C3\u30D5\u30A1(TLAB)\u5916\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u307F\u304C\u5272\u308A\u5F53\u3066\u3089\u308C\u307E\u3057\u305F\u3002
TlabAllocationRatioRuleFactory_TEXT_OK_NO_OUTSIDE=TLAB\u5916\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u5272\u5F53\u3066\u306F\u691C\u51FA\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
UnlockExperimentalVMOptionsRuleFactory_TEXT_INFO=\u5B9F\u9A13\u7684VM\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u6709\u52B9\u5316\u3055\u308C\u3066\u3044\u308BJVM\u3067\u8A18\u9332\u304C\u5B9F\u884C\u3055\u308C\u307E\u3057\u305F\u3002
UnlockExperimentalVMOptionsRuleFactory_TEXT_INFO_LONG=\u5B9F\u9A13\u7684VM\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u4FE1\u983C\u6027\u306B\u6B20\u3051\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u3001\u672C\u756A\u74B0\u5883\u3067\u306F\u4F7F\u7528\u3059\u3079\u304D\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u5B9F\u9A13\u7684\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3059\u308B\u5FC5\u8981\u304C\u306A\u3044\u5834\u5408\u306F\u3001'-XX:+UnlockExperimentalVMOptions'\u30B3\u30DE\u30F3\u30C9\u884C\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u4F7F\u7528\u3092\u907F\u3051\u3066\u304F\u3060\u3055\u3044\u3002
VMOperations_RULE_NAME=VMOperation\u30D4\u30FC\u30AF\u671F\u9593
VMOperationRule_CONFIG_WARNING_LIMIT=\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308BVM\u64CD\u4F5C\u671F\u9593\u8B66\u544A\u5236\u9650
VMOperationRule_CONFIG_WARNING_LIMIT_LONG=\u8B66\u544A\u306E\u30C8\u30EA\u30AC\u30FC\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u3001\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308BVM\u64CD\u4F5C\u306E\u6700\u5C0F\u671F\u9593
# {longestOperationDuration} is a time period
VMOperationRuleFactory_TEXT_OK=\u904E\u5EA6\u306B\u9577\u671F\u306EVM\u64CD\u4F5C\u306F\u3053\u306E\u8A18\u9332\u5185\u3067\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F(\u6700\u9577\u306F{longestOperationDuration}\u3067\u3057\u305F)\u3002
VMOperationRuleFactory_TEXT_OK_COMBINED_DURATION=\u904E\u5EA6\u306B\u9577\u671F\u306EVM\u64CD\u4F5C\u306F\u3053\u306E\u8A18\u9332\u5185\u3067\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u6700\u9577\u306E\u3082\u306E\u306F\u3001\u8907\u6570\u306E\u9699\u9593\u306A\u304F\u9023\u7D9A\u3057\u305F\u64CD\u4F5C\u306B\u3088\u3063\u3066\u5408\u8A08\u3067{longestOperationDuration}\u306E\u9593\u7D9A\u304D\u307E\u3057\u305F\u3002
# {longestOperationDuration} is a time period
VMOperationRuleFactory_TEXT_WARN=\u9577\u671F\u306B\u7D99\u7D9A\u3057\u3066\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308BVM\u64CD\u4F5C\u304C\u8A18\u9332\u5185\u306B\u3042\u308A\u307E\u3059(\u6700\u9577\u306F{longestOperationDuration}\u3067\u3057\u305F)\u3002
VMOperationRuleFactory_TEXT_WARN_COMBINED_DURATION=\u9577\u671F\u306B\u7D99\u7D9A\u3057\u3066\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308BVM\u64CD\u4F5C\u304C\u8A18\u9332\u5185\u306B\u3042\u308A\u307E\u3059\u3002\u6700\u9577\u306E\u3082\u306E\u306F\u3001\u8907\u6570\u306E\u9699\u9593\u306A\u304F\u9023\u7D9A\u3057\u305F\u64CD\u4F5C\u306B\u3088\u3063\u3066\u5408\u8A08\u3067{longestOperationDuration}\u306E\u9593\u7D9A\u304D\u307E\u3057\u305F\u3002
# {longestOperationDuration} is a time period, {longestOperation} is a JVM operation type, {longestOperationCaller} is a thread name, {longestOperationStartTime} is a time stamp
VMOperationRuleFactory_TEXT_WARN_LONG=\u9577\u671F\u306B\u7D99\u7D9A\u3057\u3066\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308BVM\u64CD\u4F5C\u304C\u8A18\u9332\u5185\u306B\u3042\u308A\u307E\u3059\u3002\u6700\u9577\u306E\u3082\u306E\u306F\u30BF\u30A4\u30D7{longestOperation}\u3067\u3001{longestOperation}\u306E\u9593\u7D9A\u304D\u307E\u3057\u305F\u3002\u3053\u308C\u3089\u306F\u30B9\u30EC\u30C3\u30C9''{longestOperationCaller}''\u306B\u3088\u308A\u958B\u59CB\u3055\u308C\u3001{longestOperationStartTime}\u306B\u767A\u751F\u3057\u307E\u3057\u305F\u3002VM\u64CD\u4F5C\u306FJVM\u5185\u90E8\u64CD\u4F5C\u3067\u3059\u3002\u540C\u671F\u7684\u306B\u5B9F\u884C\u3055\u308C\u308B(\u3064\u307E\u308A\u3001\u547C\u51FA\u3057\u4E2D\u30B9\u30EC\u30C3\u30C9\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B)VM\u64CD\u4F5C\u3082\u3042\u308C\u3070\u3001\u3044\u308F\u3086\u308B\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u3067\u5B9F\u884C\u3055\u308C\u308B\u3053\u3068\u304C\u5FC5\u8981\u306A\u64CD\u4F5C\u3082\u3042\u308A\u307E\u3059\u3002\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u30FB\u30DD\u30FC\u30EA\u30F3\u30B0\u306F\u9023\u52D5\u7684\u306A\u4E00\u6642\u505C\u6B62\u30E1\u30AB\u30CB\u30BA\u30E0\u3067\u3001JVM\u3067\u306E\u30D0\u30A4\u30C8\u30FB\u30B3\u30FC\u30C9\u5B9F\u884C\u3092\u4E2D\u65AD\u3057\u307E\u3059\u3002\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u3067\u884C\u308F\u308C\u308BVM\u64CD\u4F5C\u306F\u4E8B\u5B9F\u4E0A\u306E"Stop-the-world"\u306B\u306A\u308A\u307E\u3059\u3002\u3064\u307E\u308A\u3001\u305D\u306E\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u3067VM\u64CD\u4F5C\u3092\u5B9F\u884C\u3057\u3066\u3044\u308B\u9593\u306F\u3001\u3069\u306E\u30B9\u30EC\u30C3\u30C9\u3067\u3082Java\u30B3\u30FC\u30C9\u304C\u5B9F\u884C\u3055\u308C\u306A\u3044\u3068\u3044\u3046\u3053\u3068\u3067\u3059\u3002\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u3067\u5B9F\u884C\u4E2D\u306E\u9577\u671F\u306B\u7D99\u7D9A\u7684\u306AVM\u64CD\u4F5C\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u5FDC\u7B54\u6027\u3092\u4F4E\u4E0B\u3055\u305B\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u306E\u3088\u3046\u306AVM\u64CD\u4F5C\u304C\u898B\u3064\u304B\u3063\u305F\u5834\u5408\u3001\u64CD\u4F5C\u306E\u30BF\u30A4\u30D7\u3068\u3001\u305D\u306E\u547C\u51FA\u3057\u5143\u30B9\u30EC\u30C3\u30C9\u306F\u3001\u305D\u306EVM\u64CD\u4F5C\u304C\u767A\u751F\u3057\u305F\u7406\u7531\u3092\u7406\u89E3\u3059\u308B\u305F\u3081\u306E\u91CD\u8981\u306A\u60C5\u5831\u6E90\u3068\u306A\u308A\u307E\u3059\u3002\u3088\u308A\u8A73\u3057\u3044\u60C5\u5831\u3092\u5F97\u308B\u306B\u306F\u3001\u6642\u9593\u7684\u306B\u3053\u306E\u30A4\u30D9\u30F3\u30C8\u306B\u4EA4\u5DEE\u3057\u3066\u3044\u308B\u547C\u51FA\u3057\u5143\u30B9\u30EC\u30C3\u30C9\u306B\u30A4\u30D9\u30F3\u30C8\u304C\u3042\u308B\u304B\u3069\u3046\u304B\u3092\u78BA\u8A8D\u3057\u307E\u3059\u3002\u305D\u306E\u3088\u3046\u306A\u30A4\u30D9\u30F3\u30C8\u306E\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u53C2\u7167\u3059\u308B\u3068\u3001\u539F\u56E0\u306E\u7279\u5B9A\u306B\u5F79\u7ACB\u3061\u307E\u3059\u3002\u8A73\u7D30\u306F\u3001[\u30E9\u30F3\u30BF\u30A4\u30E0\u6982\u8981](http://openjdk.java.net/groups/hotspot/docs/RuntimeOverview.html)\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
VMOperationRuleFactory_TEXT_WARN_LONG_COMBINED_DURATION=\u9577\u671F\u306B\u7D99\u7D9A\u3057\u3066\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308BVM\u64CD\u4F5C\u304C\u8A18\u9332\u5185\u306B\u3042\u308A\u307E\u3059\u3002\u6700\u9577\u306E\u3082\u306E\u306F\u8907\u6570\u306E\u9699\u9593\u306A\u304F\u9023\u7D9A\u3057\u305F\u64CD\u4F5C\u306B\u3088\u308B\u3082\u306E\u3067\u3001\u30BF\u30A4\u30D7\u306F{longestOperation}\u3067{longestOperationDuration}\u306E\u9593\u7D9A\u304D\u307E\u3057\u305F\u3002VM\u64CD\u4F5C\u306FJVM\u5185\u90E8\u64CD\u4F5C\u3067\u3059\u3002\u540C\u671F\u7684\u306B\u5B9F\u884C\u3055\u308C\u308B(\u3064\u307E\u308A\u3001\u547C\u51FA\u3057\u4E2D\u30B9\u30EC\u30C3\u30C9\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B)VM\u64CD\u4F5C\u3082\u3042\u308C\u3070\u3001\u3044\u308F\u3086\u308B\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u3067\u5B9F\u884C\u3055\u308C\u308B\u3053\u3068\u304C\u5FC5\u8981\u306A\u64CD\u4F5C\u3082\u3042\u308A\u307E\u3059\u3002\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u30FB\u30DD\u30FC\u30EA\u30F3\u30B0\u306F\u9023\u52D5\u7684\u306A\u4E00\u6642\u505C\u6B62\u30E1\u30AB\u30CB\u30BA\u30E0\u3067\u3001JVM\u3067\u306E\u30D0\u30A4\u30C8\u30FB\u30B3\u30FC\u30C9\u5B9F\u884C\u3092\u4E2D\u65AD\u3057\u307E\u3059\u3002\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u3067\u884C\u308F\u308C\u308BVM\u64CD\u4F5C\u306F\u4E8B\u5B9F\u4E0A\u306E"Stop-the-world"\u306B\u306A\u308A\u307E\u3059\u3002\u3064\u307E\u308A\u3001\u305D\u306E\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u3067VM\u64CD\u4F5C\u3092\u5B9F\u884C\u3057\u3066\u3044\u308B\u9593\u306F\u3001\u3069\u306E\u30B9\u30EC\u30C3\u30C9\u3067\u3082Java\u30B3\u30FC\u30C9\u304C\u5B9F\u884C\u3055\u308C\u306A\u3044\u3068\u3044\u3046\u3053\u3068\u3067\u3059\u3002\u30BB\u30FC\u30D5\u30DD\u30A4\u30F3\u30C8\u3067\u5B9F\u884C\u4E2D\u306E\u9577\u671F\u306B\u7D99\u7D9A\u7684\u306AVM\u64CD\u4F5C\u306F\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u5FDC\u7B54\u6027\u3092\u4F4E\u4E0B\u3055\u305B\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u306E\u3088\u3046\u306AVM\u64CD\u4F5C\u304C\u898B\u3064\u304B\u3063\u305F\u5834\u5408\u3001\u64CD\u4F5C\u306E\u30BF\u30A4\u30D7\u3068\u3001\u305D\u306E\u547C\u51FA\u3057\u5143\u30B9\u30EC\u30C3\u30C9\u306F\u3001\u305D\u306EVM\u64CD\u4F5C\u304C\u767A\u751F\u3057\u305F\u7406\u7531\u3092\u7406\u89E3\u3059\u308B\u305F\u3081\u306E\u91CD\u8981\u306A\u60C5\u5831\u6E90\u3068\u306A\u308A\u307E\u3059\u3002\u3088\u308A\u8A73\u3057\u3044\u60C5\u5831\u3092\u5F97\u308B\u306B\u306F\u3001\u6642\u9593\u7684\u306B\u3053\u306E\u30A4\u30D9\u30F3\u30C8\u306B\u4EA4\u5DEE\u3057\u3066\u3044\u308B\u547C\u51FA\u3057\u5143\u30B9\u30EC\u30C3\u30C9\u306B\u30A4\u30D9\u30F3\u30C8\u304C\u3042\u308B\u304B\u3069\u3046\u304B\u3092\u78BA\u8A8D\u3057\u307E\u3059\u3002\u305D\u306E\u3088\u3046\u306A\u30A4\u30D9\u30F3\u30C8\u306E\u30B9\u30BF\u30C3\u30AF\u30FB\u30C8\u30EC\u30FC\u30B9\u3092\u53C2\u7167\u3059\u308B\u3068\u3001\u539F\u56E0\u306E\u7279\u5B9A\u306B\u5F79\u7ACB\u3061\u307E\u3059\u3002\u8A73\u7D30\u306F\u3001[\u30E9\u30F3\u30BF\u30A4\u30E0\u6982\u8981](http://openjdk.java.net/groups/hotspot/docs/RuntimeOverview.html)\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
